{"title": "Algebra", "chapters": [{"title": "Introduction to Algebra", "goals": ["The student will be able to interprete and apply the basic principles of algebra, including the use of variables, equations, and inequalities. They will also be able to solve linear equations and inequalities, and understand the concept of functions and their graphs. The student will be", "The student will be able to interprete and apply the basic principles of algebra, including the use of variables, equations, and inequalities. They will also be able to solve linear equations and inequalities, and understand the concept of functions and their graphs. The student will be", "The student will be able to use the basic principles of algebra, including the use of variables, equations, and inequalities. They will also be able to solve linear equations and inequalities, and understand the concept of functions and their graphs. The student will be able to", "The student will be able to solve linear equations and inequalities, and understand the concept of functions and their graphs. The student will be able to use the basic principles of algebra, including the use of variables, equations, and inequalities.", "The student will be able to summarizethe basic principles of algebra, including the use of variables, equations, and inequalities.", "The student will be able to selectively apply the basic principles of algebra, including the use of variables, equations, and inequalities.", "The student will be able to statements of the basic principles of algebra, including the use of variables, equations, and inequalities.", "The student will be able to apply the basic principles of algebra, including the use of variables, equations, and inequalities.", "The student will be able to demonstrate the basic principles of algebra, including the use of variables, equations, and inequalities.", "The student will be able to demonstrate the basic principles of algebra, including the use of variables, equations, and inequalities."]}, {"title": "Basic Concepts and Notation", "goals": ["The student will be able to interpret and apply the basic concepts of algebra, including:", "The student will be able to interpret and apply the basic concepts of algebra, including:", "The student will be able to apply the basic concepts of algebra, including:", "The student will be able to solve linear equations and inequalities, and understand the concept of a function.The student will be able tosolve linear equations and inequalities, and understand the concept of a function.The student will be able tosolve systems of linear", "The student will be able to state and solve systems of linear equations and inequalities, and understand the concept of a function.The student will be able tosolve systems of linear equations and inequalities, and understand the concept of a function.The student will be able", "The student will be able to summarizethe basic concepts of algebra, including:The student will be able tosummarize the basic concepts of algebra, including:The student will be able tosolve systems of linear equations and inequalities, and understand the concept of a function.", "The student will be able to select and apply the basic concepts of algebra, including:The student will be able tosolve systems of linear equations and inequalities, and understand the concept of a function.", "The student will be able to use the basic concepts of algebra, including:The student will be able tosolve systems of linear equations and inequalities, and understand the concept of a function.", "The student will be able to demonstrate the basic concepts of algebra, including:The student will be able tosolve systems of linear equations and inequalities, and understand the concept of a function.", "The student will be able to demonstrate the basic concepts of algebra, including:The student will be able tosolve systems of linear equations and inequalities, and understand the concept of a function."]}, {"title": "Polynomials and their Properties", "goals": ["The student will be able to identify and manipulate polynomials, understand the concept of degree and the relationship between the degree and the number of roots, and understand the concept of the derivative and its application in finding the roots of a polynomial.", "The student will be able to identify and manipulate polynomials, understand the concept of degree and the relationship between the degree and the number of roots, and understand the concept of the derivative and its application in finding the roots of a polynomial.", "The student will be able to apply the concept of the derivative and its application in finding the roots of a polynomial.", "The student will be able to solve polynomial equations using the concept of the derivative and its application in finding the roots of a polynomial.", "The student will be able to summarizethe concepts of polynomials, their properties, and their applications in solving polynomial equations.", "The student will be able to selectively apply the concept of the derivative and its application in finding the roots of a polynomial.", "The student will be able to statements of the concepts of polynomials, their properties, and their applications in solving polynomial equations.", "The student will be able to demonstrate the concepts of polynomials, their properties, and their applications in solving polynomial equations.", "The student will be able to demonstrate the concepts of polynomials, their properties, and their applications in solving polynomial equations.", "The student will be able to differentiate the concepts of polynomials, their properties, and their applications in solving polynomial equations."]}, {"title": "Factoring Polynomials", "goals": ["The student will be able to identify the factors of a polynomial, and to factor a polynomial by using the following methods:", "The student will be able to identify the factors of a polynomial, and to factor a polynomial by using the following methods:", "The student will be able to apply the following methods:", "The student will be able to use the following methods:", "The student will be able to implement the following methods:The student will be able toapply the following methods:The student will be able toimplement the following methods:The student will be able toimplement the following methods:The student will be able toimplement the following methods:The", "The student will be able to implement the following methods:The student will be able toimplement the following methods:The student will be able toimplement the following methods:The student will be able toimplement the following methods:The student will be able toimplement the following methods:The student", "The student will be able to develope the following methods:The student will be able todevelop the following methods:The student will be able todevelop the following methods:The student will be able todevelop the following methods:The student will be able todevelop the following methods:The", "The student will be able to devisep the following methods:The student will be able todevelop the following methods:The student will be able todevelop the following methods:The student will be able todevelop the following methods:The student will be able todevelop the following methods:The", "The student will be able to definethe following methods:The student will be able todefine the following methods:The student will be able todefine the following methods:The student will be able todefine the following methods:The student will be able todefine the following methods:TheThe", "The student will be able to defend the following methods:The student will be able todefine the following methods:The student will be able todefine the following methods:The student will be able todefine the following methods:The student will be able todefine the following methods:The"]}, {"title": "Rational Expressions and Equations", "goals": ["The student will be able to identify and manipulate rational expressions and equations, and understand their properties. They will be able to apply these concepts to solve problems and analyze real-world situations.", "The student will be able to identify and manipulate rational expressions and equations, and understand their properties. They will be able to apply these concepts to solve problems and analyze real-world situations.", "The student will be able to apply the concepts of rational expressions and equations to solve problems and analyze real-world situations.", "The student will be able to use the concepts of rational expressions and equations to solve problems and analyze real-world situations.", "The student will be able to solve problems and analyze real-world situations using the concepts of rational expressions and equations.", "The student will be able to summarizethe concepts of rational expressions and equations and their applications in solving problems and analyzing real-world situations.", "The student will be able to describe the concepts of rational expressions and equations and their applications in solving problems and analyzing real-world situations.", "The student will be able to explain the concepts of rational expressions and equations and their applications in solving problems and analyzing real-world situations.", "The student will be able to define the concepts of rational expressions and equations and their applications in solving problems and analyzing real-world situations.", "The student will be able to classify the concepts of rational expressions and equations and their applications in solving problems and analyzing real-world situations."]}, {"title": "Solving Equations by Factoring", "goals": ["The student will be able to solve equations by factoring. ", "The student will be able to use the factoring method to solve linear equations with one variable. The student will be able toapply the factoring method to solve linear equations with two variables. The student will be able touse the factoring method to solve quadratic equations. The student", "The student will be able to apply the factoring method to solve quadratic equations. The student will be able toapply the factoring method to solve quadratic equations. The student will be able toapply the factoring method to solve quadratic equations. The student will be able to", "The student will be able to summarizethe factoring method in a step-by-step process.", "The student will be able to identify the factors of the equation and the factors of the unknown variable. The student will be able toidentify the factors of the equation and the factors of the unknown variable. The student will be able toidentify the factors of the equation and the", "The student will be able to identify the factors of the equation and the factors of the unknown variable. The student will be able toidentify the factors of the equation and the factors of the unknown variable. The student will be able toidentify the factors of the equation and the factors", "The student will be able to select the correct factors to isolate the unknown variable. The student will be able toselect the correct factors to isolate the unknown variable. The student will be able toselect the correct factors to isolate the unknown variable. The student will be able", "The student will be able to evaluate the correct factors to isolate the unknown variable. The student will be able toevaluate the correct factors to isolate the unknown variable. The student will be able toevaluate the correct factors to isolate the unknown variable. The student will", "The student will be able to statethe factoring method in a step-by-step process.", "The student will be able to explain the factoring method in a step-by-step process."]}, {"title": "Solving Equations by Substitution", "goals": ["The student will be able to solve linear equations by substitution, and understand the concept of substitution.", "The student will be able to state the solution of a linear equation in one variable in terms of the other variable. The student will be able tosolve linear equations in two variables by substitution.", "The student will be able to summarize the solution of a linear equation in two variables in terms of the other variable.", "The student will be able to select the appropriate method of solving a linear equation in two variables.", "The student will be able to apply the concept of substitution to solve linear equations in two variables.", "The student will be able to use the concept of substitution to solve linear equations in two variables.", "The student will be able to explain the concept of substitution in solving linear equations in two variables.", "The student will be able to demonstrate the concept of substitution in solving linear equations in two variables.", "The student will be able to identify the appropriate method of solving a linear equation in two variables.", "The student will be able to identify the appropriate method of solving a linear equation in two variables."]}, {"title": "Solving Equations by Graphing", "goals": ["The student will be able to solve linear equations by graphing. ", "The student will be able to identify the intercepts and the slope of a line. The student will be able touse the slope-intercept form of a line to solve linear equations. The student will be able touse the slope-intercept form of a line to solve", "The student will be able to use the slope-intercept form of a line to solve linear equations.", "The student will be able to identify the intercepts and the slope of a line.", "The student will be able to summarizetheir understanding of the course objectives.", "The student will be able to selectively use the slope-intercept form of a line to solve linear equations.", "The student will be able to statements about the course objectives.", "The student will be able to describe the course objectives in their own words.", "The student will be able to demonstrate their understanding of the course objectives.", "The student will be able to apply the course objectives to solve linear equations."]}, {"title": "Solving Equations by Factoring and Graphing", "goals": ["The student will be able to solve linear equations by factoring and graphing. ", "The student will be able to use the concept of the number line to solve linear equations. The student will be able touse the concept of the number line to solve linear equations. The student will be able touse the concept of the number line to solve linear equations. The student will", "The student will be able to summarizetheir understanding of the course by writing a summary of the course objectives.", "The student will be able to apply the concepts of factoring and graphing to solve linear equations.", "The student will be able to identify the key concepts of the course and apply them to solve linear equations.", "The student will be able to identify the key concepts of the course and apply them to solve linear equations.", "The student will be able to explain the concepts of factoring and graphing and their application to solving linear equations.", "The student will be able to demonstrate their understanding of the course by writing a summary of the course objectives.", "The student will be able to demonstrate their understanding of the course by writing a summary of the course objectives.", "The student will be able to differentiate between the concepts of factoring and graphing and their application to solving linear equations."]}, {"title": "Solving Equations by Factoring and Substitution", "goals": ["The student will be able to solve linear equations by factoring and substitution. ", "The student will be able to state the solution of a linear equation in one variable in terms of the coefficients of the equation. The student will be able tosolve linear equations in two variables by substitution. The student will be able tosolve linear equations in two variables by", "The student will be able to summarize the solution of a linear equation in two variables in terms of the coefficients of the equation.", "The student will be able to select the appropriate method of solving a linear equation based on the form of the equation.", "The student will be able to apply the properties of exponents and the order of operations in solving linear equations.", "The student will be able to use the properties of the real numbers to solve linear equations.", "The student will be able to identify the relationship between the coefficients of a linear equation and the solution of the equation.", "The student will be able to identify the relationship between the coefficients of a linear equation and the solution of the equation.", "The student will be able to explain the relationship between the coefficients of a linear equation and the solution of the equation.", "The student will be able to describe the relationship between the coefficients of a linear equation and the solution of the equation."]}, {"title": "Solving Equations by Graphing and Substitution", "goals": ["The student will be able to solve linear equations by graphing and substitution. ", "The student will be able to use the graph of a linear equation to determine the solution of the equation. The student will be able touse the substitution method to solve linear equations.", "The student will be able to identify the slope and y-intercept of a linear equation and use this information to graph the equation.", "The student will be able to identify the slope and y-intercept of a linear equation and use this information to solve the equation.", "The student will be able to apply the substitution method to solve linear equations.", "The student will be able to summarize the steps involved in solving linear equations by graphing and substitution.", "The student will be able to explain the relationship between the graph of a linear equation and its solution.", "The student will be able to compare and contrast the graphing and substitution methods for solving linear equations.", "The student will be able to evaluate the effectiveness of the graphing and substitution methods for solving linear equations.", "The student will be able to distinguishthe correct solution from incorrect solutions when solving linear equations by graphing and substitution."]}, {"title": "Solving Equations by Factoring and Graphing and Substitution", "goals": ["The student will be able to solve equations by factoring and graphing and substitution.", "The student will be able to state the problem and identify the type of equation. The student will be able tosolve linear equations and inequalities. The student will be able tosolve quadratic equations and inequalities. The student will be able tosolve systems", "The student will be able to summarizetheir work and explain their solution.", "The student will be able to use the concept of the number line and the number plane.", "The student will be able to select the appropriate method to solve the problem.", "The student will be able to identify the appropriate method to solve the problem.", "The student will be able to identify the appropriate method to solve the problem.", "The student will be able to apply the concept of the number line and the number plane.", "The student will be able to explain the concept of the number line and the number plane.", "The student will be able to demonstrate the concept of the number line and the number plane."]}, {"title": "Solving Equations by Factoring and Graphing and Substitution and Graphing", "goals": ["The student will be able to solve equations by factoring and graphing, and substitution and graphing.", "The student will be able to summarizetheir understanding of the course objectives.", "The student will be able to applytheir understanding of the course objectives to solve problems in real-life situations.", "The student will be able to evaluate their understanding of the course objectives and identify areas for improvement.", "The student will be able to demonstrate their understanding of the course objectives in a final exam.", "The student will be able to identifytheir strengths and weaknesses in the course objectives and set goals for improvement.", "The student will be able to identifytheir learning style and adapt their study habits to improve their understanding of the course objectives.", "The student will be able to develop a personalized study plan to improve their understanding of the course objectives.", "The student will be able to assess their progress in the course objectives and identify areas for improvement.", "The student will be able to demonstrate their understanding of the course objectives in a final exam."]}, {"title": "Solving Equations by Factoring and Graphing and Substitution and Graphing and Substitution", "goals": ["The student will be able to solve equations by factoring and graphing, and substitution and graphing.", "The student will be able to use the concept of factoring and graphing to solve linear equations and inequalities. The student will be able touse the concept of substitution and graphing to solve quadratic equations and inequalities.", "The student will be able to apply the concept of factoring and graphing to solve linear equations and inequalities. The student will be able toapply the concept of substitution and graphing to solve quadratic equations and inequalities.", "The student will be able to identify the key concepts and techniques in solving linear and quadratic equations and inequalities.", "The student will be able to identify the key concepts and techniques in solving linear and quadratic equations and inequalities.", "The student will be able to demonstrate the ability to solve linear and quadratic equations and inequalities using the concepts and techniques of factoring and graphing and substitution and graphing.", "The student will be able to demonstrate the ability to solve linear and quadratic equations and inequalities using the concepts and techniques of factoring and graphing and substitution and graphing.", "The student will be able to differentiate between the concepts and techniques of factoring and graphing and substitution and graphing in solving linear and quadratic equations and inequalities.", "The student will be able to distinguishthe concepts and techniques of factoring and graphing and substitution and graphing in solving linear and quadratic equations and inequalities.", "The student will be able to explain the concepts and techniques of factoring and graphing and substitution and graphing in solving linear and quadratic equations and inequalities."]}]}