{"title": "Cryptography", "chapters": [{"title": "Introduction to Cryptography", "goals": ["The student will be able to define and understand the basic concepts of cryptography, including:", "The student will be able to describe the basic principles of cryptography, including:", "The student will be able to explain the basic principles of cryptography, including:The student will be able todescribe the basic principles of cryptography, including:The student will be able todescribe the basic principles of cryptography, including:The student will be able to", "The student will be able to identify the basic principles of cryptography, including:The student will be able toidentify the basic principles of cryptography, including:The student will be able toidentify the basic principles of cryptography, including:The student will be able to", "The student will be able to identify the basic principles of cryptography, including:The student will be able toidentify the basic principles of cryptography, including:The student will be able toidentify the basic principles of cryptography, including:The student will be able toident", "The student will be able to differentiate between the basic principles of cryptography, including:The student will be able todifferentiate between the basic principles of cryptography, including:The student will be able todifferentiate between the basic principles of cryptography, including", "The student will be able to demonstrate the basic principles of cryptography, including:The student will be able todemonstrate the basic principles of cryptography, including:The student will be able todemonstrate the basic principles of cryptography, including:The student", "The student will be able to demonstrate the basic principles of cryptography, including:The student will be able todemonstrate the basic principles of cryptography, including:The student will be able todemonstrate the basic principles of cryptography, including:The student will", "The student will be able to distinguishthe basic principles of cryptography, including:The student will be able todistinguishthe basic principles of cryptography, including:The student will be able todistinguishthe basic principles of cryptography, including:The student", "The student will be able to develop an understanding of the basic principles of cryptography, including:The student will be able todevelop an understanding of the basic principles of cryptography, including:The student will be able todevelop an understanding of the basic principles of cryptography, including"]}, {"title": "History of Cryptography", "goals": ["The student will be able to explain the history of cryptography, including the development of cryptographic systems and the evolution of cryptographic algorithms. They will also be able to describe the role of cryptography in the development of the internet and the World Wide Web.", "The student will be able to describe the development of cryptographic systems and the evolution of cryptographic algorithms. They will also be able to describe the role of cryptography in the development of the internet and the World Wide Web.", "The student will be able to identify the key concepts and principles of cryptography, including the use of keys, encryption, and decryption. They will also be able to describe the different types of cryptographic systems, including symmetric and asymmetric cryptography.", "The student will be able to identify the key concepts and principles of cryptography, including the use of keys, encryption, and decryption. They will also be able to describe the different types of cryptographic systems, including symmetric and asymmetric cryptography.The student will be able", "The student will be able to apply cryptographic systems to solve problems and to protect information. They will also be able to describe the different types of cryptographic systems, including symmetric and asymmetric cryptography.The student will be able toapply cryptographic systems to solve problems and to", "The student will be able to evaluate the effectiveness of cryptographic systems and to identify potential vulnerabilities. They will also be able to describe the different types of cryptographic systems, including symmetric and asymmetric cryptography.The student will be able toevaluate the effectiveness of cryptographic", "The student will be able to implement cryptographic systems in real-world scenarios, including the use of digital signatures and the protection of electronic transactions. They will also be able to describe the different types of cryptographic systems, including symmetric and asymmetric cryptography.", "The student will be able to implement cryptographic systems in real-world scenarios, including the use of digital signatures and the protection of electronic transactions.", "The student will be able to distinguishe between the different types of cryptographic systems, including symmetric and asymmetric cryptography.", "The student will be able to demonstrate an understanding of the principles of cryptography and the ability to apply them in real-world scenarios."]}, {"title": "Symmetric Key Cryptography", "goals": ["The student will be able to define, understand and apply the following concepts:", "The student will be able to describe the basic principles of cryptography and its applications.", "The student will be able to explain the basic principles of symmetric key cryptography and its applications.The student will be able todescribe the basic principles of asymmetric key cryptography and its applications.The student will be able todescribe the basic principles of public key cryptography", "The student will be able to apply the basic principles of cryptography to solve problems.", "The student will be able to implement cryptographic protocols and algorithms.", "The student will be able to implement cryptographic protocols and algorithms.", "The student will be able to evaluate the security of cryptographic protocols and algorithms.", "The student will be able to identify and analyze the vulnerabilities of cryptographic protocols and algorithms.", "The student will be able to identify and analyze the vulnerabilities of cryptographic protocols and algorithms.", "The student will be able to design and implement cryptographic protocols and algorithms."]}, {"title": "Asymmetric Key Cryptography", "goals": ["The student will be able to explain the basic principles of asymmetric key cryptography, including the use of public and private keys, and the concept of a digital signature. The student will be able to describe the basic principles of the RSA algorithm, including the use of modular", "The student will be able to describe the basic principles of the RSA algorithm, including the use of modular arithmetic and the use of the Chinese Remainder Theorem. The student will be able to describe the basic principles of the Diffie-Hellman key exchange", "The student will be able to implement the basic principles of the Diffie-Hellman key exchange, including the use of the Chinese Remainder Theorem. The student will be able todescribe the basic principles of the ElGamal encryption scheme, including the use of", "The student will be able to implement the basic principles of the ElGamal encryption scheme, including the use of the Chinese Remainder Theorem. The student will be able todescribe the basic principles of the elliptic curve cryptography, including the use of the Weil", "The student will be able to apply the basic principles of elliptic curve cryptography, including the use of the Weil and HasseThe student will be able todescribe the basic principles of the elliptic curve cryptography, including the use of the Weil and", "The student will be able to use the basic principles of elliptic curve cryptography, including the use of the Weil and HasseThe student will be able todescribe the basic principles of the elliptic curve cryptography, including the use of the Weil and", "The student will be able to define the basic principles of the elliptic curve cryptography, including the use of the Weil and HasseThe student will be able todefine the basic principles of the elliptic curve cryptography, including the use of the Weil and", "The student will be able to identify the basic principles of the elliptic curve cryptography, including the use of the Weil and Hasse", "The student will be able to identify the basic principles of the elliptic curve cryptography, including the use of the Weil andThe student will be able toidentify the basic principles of the elliptic curve cryptography, including the use of the Weil andThe student", "The student will be able to demonstrate the basic principles of the elliptic curve cryptography, including the use of the Weil andThe student will be able todemonstrate the basic principles of the elliptic curve cryptography, including the use of the Weil"]}, {"title": "Hash Functions", "goals": ["The student will be able to define and understand the concept of a hash function. ", "The student will be able to explain the difference between a hash function and a cryptographic hash function. The student will be able todescribe the properties of a cryptographic hash function. The student will be able toexplain the concept of a cryptographic hash function. The student will", "The student will be able to describe the properties of a cryptographic hash function. The student will be able toexplain the concept of a cryptographic hash function. The student will be able todescribe the properties of a cryptographic hash function. The student will be able toexpl", "The student will be able to identify the different types of cryptographic hash functions. The student will be able toexplain the concept of a cryptographic hash function. The student will be able todescribe the properties of a cryptographic hash function. The student will be able to", "The student will be able to identify the different types of cryptographic hash functions. The student will be able toexplain the concept of a cryptographic hash function. The student will be able todescribe the properties of a cryptographic hash function. The student will be able toThe", "The student will be able to distinguishthe different types of cryptographic hash functions. The student will be able toexplain the concept of a cryptographic hash function. The student will be able todescribe the properties of a cryptographic hash function. The student will be able to", "The student will be able to demonstrate the use of a cryptographic hash function in a cryptographic protocol. The student will be able toexplain the concept of a cryptographic hash function. The student will be able todescribe the properties of a cryptographic hash function. The", "The student will be able to demonstrate the use of a cryptographic hash function in a cryptographic protocol. The student will be able toexplain the concept of a cryptographic hash function. The student will be able todescribe the properties of a cryptographic hash function.", "The student will be able to differentiate the different types of cryptographic hash functions. The student will be able toexplain the concept of a cryptographic hash function. The student will be able todescribe the properties of a cryptographic hash function.", "The student will be able to defend the use of a cryptographic hash function in a cryptographic protocol. The student will be able toexplain the concept of a cryptographic hash function. The student will be able todescribe the properties of a cryptographic hash function."]}, {"title": "Digital Signatures", "goals": ["The student will be able to define, understand, and apply the concepts of digital signatures, including the use of public and private keys, digital signatures, and the process of verifying the authenticity of a message. The student will also be able to understand the importance of", "The student will be able to explain the importance of digital signatures in the field of cryptography and their role in ensuring secure communication and transactions.", "The student will be able to describe the different types of digital signatures, including RSA, DSA, and ECC, and understand their strengths and weaknesses. The student will be able toexplain the process of generating and verifying digital signatures, including the use", "The student will be able to demonstrate the use of digital signatures in various scenarios, such as secure email communication, secure transactions, and digital certificates. The student will be able toexplain the importance of digital signatures in the field of cryptography and their role in ensuring", "The student will be able to distinguishe between the different types of digital signatures, including RSA, DSA, and ECC, and understand their strengths and weaknesses. The student will be able toexplain the process of generating and verifying digital signatures, including the", "The student will be able to demonstrate the use of digital signatures in various scenarios, such as secure email communication, secure transactions, and digital certificates.", "The student will be able to identify the importance of digital signatures in the field of cryptography and their role in ensuring secure communication and transactions.", "The student will be able to identify the different types of digital signatures, including RSA, DSA, and ECC, and understand their strengths and weaknesses. The student will be able toexplain the process of generating and verifying digital signatures, including the use", "The student will be able to differentiate between the different types of digital signatures, including RSA, DSA, and ECC, and understand their strengths and weaknesses. The student will be able toexplain the process of generating and verifying digital signatures, including the", "The student will be able to defend the use of digital signatures in various scenarios, such as secure email communication, secure transactions, and digital certificates."]}, {"title": "Public Key Infrastructure", "goals": ["The student will be able to define and explain the concept of a public key infrastructure (PKI) and its components, including the use of digital certificates, digital signatures, and digital signatures. The student will also be able to describe the process of creating a PKI", "The student will be able to describe the process of creating a PKI, including the steps involved in generating a public key and a private key, and the process of exchanging public keys. The student will also be able to describe the process of creating a digital certificate and the process", "The student will be able to explain the process of creating a digital certificate, including the steps involved in generating a certificate signing request (CSR) and the process of verifying the authenticity of a digital certificate. The student will also be able to describe the process of verifying", "The student will be able to examine the process of verifying the authenticity of a digital certificate, including the steps involved in verifying the digital signature and the process of verifying the authenticity of a digital certificate. The student will also be able to describe the process of ver", "The student will be able to distinguishe the process of verifying the authenticity of a digital certificate, including the steps involved in verifying the digital signature and the process of verifying the authenticity of a digital certificate. The student will also be able to describe the process of ver", "The student will be able to identify the process of verifying the authenticity of a digital certificate, including the steps involved in verifying the digital signature and the process of verifying the authenticity of a digital certificate. The student will also be able to describe the process of ver", "The student will be able to identify the process of verifying the authenticity of a digital certificate, including the steps involved in verifying the digital signature and the process of verifying the authenticity of a digital certificate. The student will also be able to describe the process of verThe", "The student will be able to differentiate the process of verifying the authenticity of a digital certificate, including the steps involved in verifying the digital signature and the process of verifying the authenticity of a digital certificate. The student will also be able to describe the process of ver", "The student will be able to demonstrate the process of verifying the authenticity of a digital certificate, including the steps involved in verifying the digital signature and the process of verifying the authenticity of a digital certificate. The student will also be able to describe the process of verThe", "The student will be able to demonstrate the process of verifying the authenticity of a digital certificate, including the steps involved in verifying the digital signature and the process of verifying the authenticity of a digital certificate. The student will also be able to describe the process of verThe"]}, {"title": "Quantum Cryptography", "goals": ["The student will be able to explain the basic principles of quantum mechanics and quantum cryptography. They will also be able to understand the basic principles of quantum entanglement and quantum teleportation. The student will be able to understand the basic principles of quantum key distribution and quantum crypt", "The student will be able to describe the basic principles of quantum cryptography and quantum key distribution. They will also be able to understand the basic principles of quantum entanglement and quantum teleportation. The student will be able to describe the basic principles of quantum cryptography and quantum", "The student will be able to distinguishthe between quantum cryptography and quantum key distribution. They will also be able to understand the basic principles of quantum entanglement and quantum teleportation.", "The student will be able to identify the differences between quantum cryptography and quantum key distribution.", "The student will be able to identify the differences between quantum cryptography and quantum key distribution.", "The student will be able to compare and contrast the different types of quantum cryptography and quantum key distribution.", "The student will be able to evaluate the effectiveness of quantum cryptography and quantum key distribution in terms of security and efficiency.", "The student will be able to assess the effectiveness of quantum cryptography and quantum key distribution in terms of security and efficiency.", "The student will be able to applying the principles of quantum cryptography and quantum key distribution in real-world scenarios.", "The student will be able to implement the principles of quantum cryptography and quantum key distribution in real-world scenarios."]}, {"title": "Cryptanalysis", "goals": ["The student will be able to complete the following tasks:", "The student will be able to compute the following tasks:", "The student will be able to describe the following tasks:", "The student will be able to identify the following tasks:The student will be able toanalyze the following tasks:The student will be able toevaluate the following tasks:The student will be able toapply the following tasks:The student will be able tosynthesize", "The student will be able to evaluate the following tasks:The student will be able toapply the following tasks:The student will be able tosynthesizeThe student will be able toanalyze the following tasks:The student will be able toidentify the following tasks:", "The student will be able to designthe following tasks:The student will be able tocompute the following tasks:The student will be able todescribe the following tasks:The student will be able toidentify the following tasks:The student will be able toanalyze the following", "The student will be able to identify the following tasks:The student will be able todescribe the following tasks:The student will be able toidentify the following tasks:The student will be able toanalyze the following tasks:The student will be able toidentify the following", "The student will be able to apply the following tasks:The student will be able tosynthesizeThe student will be able toanalyze the following tasks:The student will be able toidentify the following tasks:The student will be able todescribe the following tasks", "The student will be able to define the following tasks:The student will be able toidentify the following tasks:The student will be able todescribe the following tasks:The student will be able toidentify the following tasks:The student will be able toanalyze the", "The student will be able to explain the following tasks:The student will be able toidentify the following tasks:The student will be able todescribe the following tasks:The student will be able toidentify the following tasks:The student will be able toanalyze the"]}, {"title": "Cryptographic Attacks", "goals": ["The student will be able to identify and describe the different types of cryptographic attacks, including:", "The student will be able to identify and describe the different types of cryptographic attacks, including:", "The student will be able to describe the different types of cryptographic attacks, including:", "The student will be able to explain the different types of cryptographic attacks, including:The student will be able toexplain the different types of cryptographic attacks, including:The student will be able toexplain the different types of cryptographic attacks, including:The student will", "The student will be able to distinguishe between the different types of cryptographic attacks, including:The student will be able todistinguish between the different types of cryptographic attacks, including:The student will be able todistinguish between the different types of cryptographic attacks,", "The student will be able to differentiate between the different types of cryptographic attacks, including:The student will be able todifferentiate between the different types of cryptographic attacks, including:The student will be able todifferentiate between the different types of cryptographic", "The student will be able to demonstrate the ability to differentiate between the different types of cryptographic attacks, including:The student will be able todemonstrate the ability to differentiate between the different types of cryptographic attacks, including:The student will be able tod", "The student will be able to demonstrate the ability to differentiate between the different types of cryptographic attacks, including:The student will be able todemonstrate the ability to differentiate between the different types of cryptographic attacks, including:The student will be able todemon", "The student will be able to design the ability to differentiate between the different types of cryptographic attacks, including:The student will be able todemonstrate the ability to differentiate between the different types of cryptographic attacks, including:The student will be able tod", "The student will be able to develop the ability to differentiate between the different types of cryptographic attacks, including:The student will be able todevelop the ability to differentiate between the different types of cryptographic attacks, including:The student will be able todevelop the ability to"]}, {"title": "Cryptographic Standards", "goals": ["The student will be able to define and understand the concepts of cryptography, cryptographic standards, and cryptographic protocols. They will also be able to understand the importance of cryptographic standards in the context of secure communication and data transmission.", "The student will be able to explain the importance of cryptographic standards in the context of secure communication and data transmission. They will also be able to understand the importance of cryptographic standards in the context of secure communication and data transmission.", "The student will be able to describe the different types of cryptographic standards, including symmetric key cryptography, asymmetric key cryptography, and hash-based cryptography. They will also be able to understand the importance of cryptographic standards in the context of secure communication and data transmission", "The student will be able to identify the different types of cryptographic standards, including symmetric key cryptography, asymmetric key cryptography, and hash-based cryptography. They will also be able to understand the importance of cryptographic standards in the context of secure communication and data transmission", "The student will be able to distinguishe between the different types of cryptographic standards, including symmetric key cryptography, asymmetric key cryptography, and hash-based cryptography. They will also be able to understand the importance of cryptographic standards in the context of secure communication and data", "The student will be able to identify the different types of cryptographic standards, including symmetric key cryptography, asymmetric key cryptography, and hash-based cryptography. They will also be able to understand the importance of cryptographic standards in the context of secure communication and data transmission", "The student will be able to differentiate between the different types of cryptographic standards, including symmetric key cryptography, asymmetric key cryptography, and hash-based cryptography. They will also be able to understand the importance of cryptographic standards in the context of secure communication and data", "The student will be able to demonstrate an understanding of the different types of cryptographic standards, including symmetric key cryptography, asymmetric key cryptography, and hash-based cryptography. They will also be able to understand the importance of cryptographic standards in the context of secure communication", "The student will be able to demonstrate an understanding of the different types of cryptographic standards, including symmetric key cryptography, asymmetric key cryptography, and hash-based cryptography. They will also be able to understand the importance of cryptographic standards in the context of secure communication and", "The student will be able to develop an understanding of the different types of cryptographic standards, including symmetric key cryptography, asymmetric key cryptography, and hash-based cryptography. They will also be able to understand the importance of cryptographic standards in the context of secure communication"]}, {"title": "Cryptographic Protocols", "goals": ["The student will be able to define, understand and apply cryptographic protocols. ", "The student will be able to describe the basic principles of cryptography and the different types of cryptographic protocols. The student will be able toimplement cryptographic protocols and understand the security and privacy implications of these protocols. The student will be able toanalyze and evaluate", "The student will be able to implement cryptographic protocols and understand the security and privacy implications of these protocols. The student will be able toanalyze and evaluate the security and privacy implications of cryptographic protocols.", "The student will be able to implement cryptographic protocols and understand the security and privacy implications of these protocols.", "The student will be able to evaluate the security and privacy implications of cryptographic protocols.", "The student will be able to apply cryptographic protocols in real-world scenarios.", "The student will be able to identify and analyze the security and privacy implications of cryptographic protocols.", "The student will be able to identify and analyze the security and privacy implications of cryptographic protocols.", "The student will be able to explain the basic principles of cryptography and the different types of cryptographic protocols.", "The student will be able to demonstrate the basic principles of cryptography and the different types of cryptographic protocols."]}, {"title": "Cryptographic Algorithms", "goals": ["The student will be able to define, understand and apply cryptographic algorithms. ", "The student will be able to describe the principles and methods of cryptography and their application in the context of computer security. The student will be able todescribe the principles and methods of cryptography and their application in the context of computer security. The student will be able todesc", "The student will be able to explain the principles and methods of cryptography and their application in the context of computer security. The student will be able todescribe the principles and methods of cryptography and their application in the context of computer security. The student will be able todesc", "The student will be able to apply the principles and methods of cryptography and their application in the context of computer security. The student will be able todescribe the principles and methods of cryptography and their application in the context of computer security. The student will be able todesc", "The student will be able to implement the principles and methods of cryptography and their application in the context of computer security. The student will be able todescribe the principles and methods of cryptography and their application in the context of computer security. The student will be able todesc", "The student will be able to implement the principles and methods of cryptography and their application in the context of computer security. The student will be able todescribe the principles and methods of cryptography and their application in the context of computer security. The student will be able todescThe", "The student will be able to identify the principles and methods of cryptography and their application in the context of computer security.", "The student will be able to identify the principles and methods of cryptography and their application in the context of computer security.", "The student will be able to distinguishthe principles and methods of cryptography and their application in the context of computer security.", "The student will be able to differentiate the principles and methods of cryptography and their application in the context of computer security."]}, {"title": "Cryptographic Applications", "goals": ["The student will be able to complete the following by the end of the course:", "The student will be able to define and explain the following terms:", "The student will be able to describe the basic principles of cryptography and its applications.The student will be able todescribe the basic principles of cryptography and its applications.The student will be able todescribe the basic principles of cryptography and its applications.The student will be", "The student will be able to explain the basic principles of cryptography and its applications.The student will be able toexplain the basic principles of cryptography and its applications.The student will be able toexplain the basic principles of cryptography and its applications.The student will", "The student will be able to identify the basic principles of cryptography and its applications.The student will be able toidentify the basic principles of cryptography and its applications.The student will be able toidentify the basic principles of cryptography and its applications.The student will", "The student will be able to identify the basic principles of cryptography and its applications.", "The student will be able to apply the basic principles of cryptography and its applications.The student will be able toapply the basic principles of cryptography and its applications.The student will be able toapply the basic principles of cryptography and its applications.The student will be able", "The student will be able to demonstrate the basic principles of cryptography and its applications.", "The student will be able to demonstrate the basic principles of cryptography and its applications.", "The student will be able to differentiate between the different types of cryptography and their applications."]}]}