{"title": "Evolutionary biology", "chapters": [{"title": "Introduction to Evolutionary Biology", "goals": ["The student will be able to define and understand the basic concepts of evolutionary biology, including natural selection, genetic variation, and genetic drift. ", "The student will be able to explain the role of evolution in the development of life on Earth, and the importance of evolutionary biology in understanding the history of life. The student will be able todescribe the process of speciation and the factors that influence it, including geographic", "The student will be able to describe the process of speciation and the factors that influence it, including geographic isolation, genetic drift, and genetic variation. The student will be able toexplain the role of evolution in the development of life on Earth, and the importance of evolution", "The student will be able to distinguishe between the different types of evolutionary mechanisms, including genetic drift, natural selection, and sexual selection. The student will be able toexplain the role of evolution in the development of life on Earth, and the importance of evolutionary biology in", "The student will be able to identify the different types of evolutionary mechanisms, including genetic drift, natural selection, and sexual selection. The student will be able toexplain the role of evolution in the development of life on Earth, and the importance of evolutionary biology in understanding", "The student will be able to identify the different types of evolutionary mechanisms, including genetic drift, natural selection, and sexual selection. The student will be able toexplain the role of evolution in the development of life on Earth, and the importance of evolutionary biology in understanding", "The student will be able to compare and contrast the different types of evolutionary mechanisms, including genetic drift, natural selection, and sexual selection. The student will be able toexplain the role of evolution in the development of life on Earth, and the importance of evolutionary biology", "The student will be able to evaluate the role of evolution in the development of life on Earth, and the importance of evolutionary biology in understanding the history of life.", "The student will be able to apply the principles of evolutionary biology to the study of specific organisms, including the study of the evolution of human beings.", "The student will be able to use the principles of evolutionary biology to understand the history of life on Earth."]}, {"title": "The History of Evolutionary Biology", "goals": ["The student will be able to explain the history of evolutionary biology, including the contributions of Charles Darwin, Alfred Russel Wallace, and other key figures in the field. They will also be able to describe the development of the theory of evolution and the role of natural selection in", "The student will be able to describe the development of the theory of evolution and the role of natural selection in shaping the course of life on Earth. They will also be able to explain the role of genetic variation and genetic drift in the process of evolution.", "The student will be able to distinguishe between the different types of evolutionary change, including microevolution, macroevolution, and punctuated equilibrium. They will also be able to describe the process of speciation and the factors that influence it.The student will be able toexpl", "The student will be able to identify the different types of evolutionary change, including microevolution, macroevolution, and punctuated equilibrium. They will also be able to describe the process of speciation and the factors that influence it. The student will be able toexplain", "The student will be able to identify the different types of evolutionary change, including microevolution, macroevolution, and punctuated equilibrium. They will also be able to describe the process of speciation and the factors that influence it. The student will be able toexplain the", "The student will be able to differentiate between the different types of evolutionary change, including microevolution, macroevolution, and punctuated equilibrium. They will also be able to describe the process of speciation and the factors that influence it. The student will be able toexpl", "The student will be able to demonstrate an understanding of the role of genetic variation and genetic drift in the process of evolution. They will also be able to describe the role of natural selection in shaping the course of life on Earth.", "The student will be able to demonstrate an understanding of the role of genetic variation and genetic drift in the process of evolution. They will also be able to describe the role of natural selection in shaping the course of life on Earth.", "The student will be able to define the role of genetic variation and genetic drift in the process of evolution. They will also be able to describe the role of natural selection in shaping the course of life on Earth.", "The student will be able to defend the role of genetic variation and genetic drift in the process of evolution. They will also be able to describe the role of natural selection in shaping the course of life on Earth."]}, {"title": "The Theory of Evolution", "goals": ["The student will be able to explain the basic principles of evolutionary biology, including the process of natural selection, the role of genetic variation, and the importance of genetic drift. They will also be able to understand the concept of adaptation and how it relates to the process of", "The student will be able to apply the principles of evolutionary biology to the study of various species, including humans, and understand how evolutionary biology has been applied to the study of human evolution. They will also be able to understand the role of genetics in the study", "The student will be able to evaluate the role of genetics in the study of evolutionary biology, including the role of genetic variation and the importance of genetic drift. They will also be able to understand the role of genetics in the study of human evolution. The student will", "The student will be able to distinguishe between the different types of evolutionary biology, including the role of genetic variation and the importance of genetic drift. They will also be able to understand the role of genetics in the study of human evolution. The student will be able toevalu", "The student will be able to use the principles of evolutionary biology to evaluate the role of genetics in the study of human evolution, including the role of genetic variation and the importance of genetic drift. They will also be able to understand the role of genetics in the study", "The student will be able to demonstrate the role of genetics in the study of human evolution, including the role of genetic variation and the importance of genetic drift. They will also be able to understand the role of genetics in the study of human evolution.", "The student will be able to demonstrate the role of genetics in the study of human evolution, including the role of genetic variation and the importance of genetic drift.", "The student will be able to differentiate between the different types of evolutionary biology, including the role of genetic variation and the importance of genetic drift. They will also be able to understand the role of genetics in the study of human evolution.", "The student will be able to describe the role of genetics in the study of human evolution, including the role of genetic variation and the importance of genetic drift.", "The student will be able to design the role of genetics in the study of human evolution, including the role of genetic variation and the importance of genetic drift."]}, {"title": "The Evolutionary Process", "goals": ["The student will be able to define and understand the basic concepts of evolutionary biology, including natural selection, genetic variation, and genetic drift. ", "The student will be able to explain the role of genetic variation in the process of evolution, and understand how genetic variation is generated and maintained. The student will be able todescribe the process of natural selection and how it shapes the evolution of species. The student will be able toexpl", "The student will be able to describe the process of natural selection and how it shapes the evolution of species. The student will be able toexplain the role of genetic variation in the process of evolution, and understand how genetic variation is generated and maintained. The student will be able to", "The student will be able to identify the factors that influence the rate of evolution, including genetic drift, gene flow, and sexual selection. The student will be able toexplain the role of genetic drift in the process of evolution, and understand how genetic drift can lead to the fix", "The student will be able to identify the factors that influence the rate of evolution, including genetic drift, gene flow, and sexual selection. The student will be able toexplain the role of genetic drift in the process of evolution, and understand how genetic drift can lead to the fixation", "The student will be able to examine the role of gene flow in the process of evolution, and understand how gene flow can influence the rate of evolution. The student will be able toexplain the role of sexual selection in the process of evolution, and understand how sexual selection can influence", "The student will be able to distinguishthe different types of evolutionary processes, including adaptive evolution, neutral evolution, and disruptive evolution. The student will be able toexplain the role of genetic variation in the process of evolution, and understand how genetic variation is generated and maintained", "The student will be able to differentiate the different types of evolutionary processes, including adaptive evolution, neutral evolution, and disruptive evolution. The student will be able toexplain the role of genetic variation in the process of evolution, and understand how genetic variation is generated and maintained", "The student will be able to evaluate the role of genetic variation in the process of evolution, and understand how genetic variation is generated and maintained.", "The student will be able to demonstrate the role of genetic variation in the process of evolution, and understand how genetic variation is generated and maintained."]}, {"title": "The Evidence for Evolution", "goals": ["The student will be able to explain the basic principles of evolutionary biology, including the process of natural selection, the role of genetic variation, and the importance of genetic drift. They will also be able to understand the role of genetic variation in the process of evolution, and the", "The student will be able to apply the principles of evolutionary biology to the study of the history of life on Earth, including the development of new species and the extinction of others. They will also be able to understand the role of genetic variation in the process of evolution,", "The student will be able to describe the role of genetic variation in the process of evolution, and the importance of genetic drift. They will also be able to understand the role of genetic variation in the process of evolution, and the importance of genetic drift.", "The student will be able to distinguishe between the different types of evolutionary mechanisms, including genetic drift, natural selection, and genetic adaptation. They will also be able to understand the role of genetic variation in the process of evolution, and the importance of genetic drift.", "The student will be able to identify the different types of evolutionary mechanisms, including genetic drift, natural selection, and genetic adaptation. They will also be able to understand the role of genetic variation in the process of evolution, and the importance of genetic drift.", "The student will be able to identify the different types of evolutionary mechanisms, including genetic drift, natural selection, and genetic adaptation. They will also be able to understand the role of genetic variation in the process of evolution, and the importance of genetic drift.", "The student will be able to evaluate the evidence for evolution, including the fossil record, the comparative anatomy of living organisms, and the molecular evidence. They will also be able to understand the role of genetic variation in the process of evolution, and the importance of", "The student will be able to assess the evidence for evolution, including the fossil record, the comparative anatomy of living organisms, and the molecular evidence. They will also be able to understand the role of genetic variation in the process of evolution, and the importance of", "The student will be able to interpret the evidence for evolution, including the fossil record, the comparative anatomy of living organisms, and the molecular evidence. They will also be able to understand the role of genetic variation in the process of evolution, and the importance of", "The student will be able to interpret the evidence for evolution, including the fossil record, the comparative anatomy of living organisms, and the molecular evidence. They will also be able to understand the role of genetic variation in the process of evolution, and the importance ofThe"]}, {"title": "The Evolutionary Tree of Life", "goals": ["The student will be able to explain the basic principles of evolutionary biology, including the process of natural selection, the role of genetic variation, and the importance of genetic drift. They will also be able to describe the process of speciation and the role of genetic drift in the", "The student will be able to describe the process of speciation and the role of genetic drift in the development of new species. They will also be able to explain the role of genetic drift in the development of new species. They will be able to describe the process of speciation and", "The student will be able to distinguishe the different types of speciation, including allopatric, sympatric, and hybrid speciation. They will also be able to describe the role of genetic drift in the development of new species. They will be able to distinguish the different", "The student will be able to differentiate the different types of speciation, including allopatric, sympatric, and hybrid speciation. They will also be able to describe the role of genetic drift in the development of new species. They will be able to distinguish the different", "The student will be able to demonstrate the different types of speciation, including allopatric, sympatric, and hybrid speciation. They will also be able to describe the role of genetic drift in the development of new species. They will be able to distinguish the differentThe", "The student will be able to demonstrate the different types of speciation, including allopatric, sympatric, and hybrid speciation. They will also be able to describe the role of genetic drift in the development of new species. They will be able to distinguish the differentThe", "The student will be able to define the different types of speciation, including allopatric, sympatric, and hybrid speciation. They will also be able to describe the role of genetic drift in the development of new species. They will be able to distinguish the different", "The student will be able to identify the different types of speciation, including allopatric, sympatric, and hybrid speciation. They will also be able to describe the role of genetic drift in the development of new species. They will be able to distinguish the different", "The student will be able to identify the different types of speciation, including allopatric, sympatric, and hybrid speciation. They will also be able to describe the role of genetic drift in the development of new species. They will be able to distinguish the differentThe", "The student will be able to classify the different types of speciation, including allopatric, sympatric, and hybrid speciation. They will also be able to describe the role of genetic drift in the development of new species. They will be able to distinguish the different"]}, {"title": "The Evolutionary Relationships of Humans", "goals": ["The student will be able to explain the basic principles of evolutionary biology, including natural selection, genetic variation, and genetic drift. ", "The student will be able to describe the process of speciation and the factors that influence it. The student will be able toexplain the role of genetic variation in the development of new traits and the process of adaptation. The student will be able todescribe the role of genetic", "The student will be able to distinguishe between the different types of evolutionary relationships, including common descent, common ancestry, and common descent with common ancestry. The student will be able todescribe the role of genetic variation in the development of new traits and the process of adaptation", "The student will be able to identify the factors that influence the process of speciation. The student will be able todescribe the role of genetic variation in the development of new traits and the process of adaptation. The student will be able toidentify the factors that influence the process", "The student will be able to identify the factors that influence the process of speciation. The student will be able todescribe the role of genetic variation in the development of new traits and the process of adaptation. The student will be able toidentify the factors that influence the process of", "The student will be able to differentiate between the different types of evolutionary relationships, including common descent, common ancestry, and common descent with common ancestry. The student will be able todescribe the role of genetic variation in the development of new traits and the process of adaptation", "The student will be able to demonstrate the role of genetic variation in the development of new traits and the process of adaptation.", "The student will be able to demonstrate the role of genetic variation in the development of new traits and the process of adaptation.", "The student will be able to designate the factors that influence the process of speciation.", "The student will be able to define the factors that influence the process of speciation."]}, {"title": "The Evolutionary Relationships of Other Species", "goals": ["The student will be able to identify the evolutionary relationships of other species, including humans, and understand how these relationships have evolved over time. They will also be able to discuss the role of natural selection and genetic drift in shaping these relationships.", "The student will be able to explain the concept of speciation and how it occurs, and understand the role of geographic isolation and genetic drift in the process. They will also be able to discuss the role of genetic drift in shaping the evolutionary relationships of other species.", "The student will be able to distinguishe between the different types of speciation, including allopatric, sympatric, and polyploid speciation, and understand how these different types of speciation have evolved over time.", "The student will be able to identify the role of genetic drift in shaping the evolutionary relationships of other species, and understand how genetic drift has evolved over time.", "The student will be able to compare and contrast the evolutionary relationships of different species, including humans, and understand how these relationships have evolved over time.", "The student will be able to evaluate the role of natural selection and genetic drift in shaping the evolutionary relationships of other species, and understand how these factors have evolved over time.", "The student will be able to describe the process of speciation and how it occurs, and understand the role of geographic isolation and genetic drift in the process.", "The student will be able to differentiate between the different types of speciation, including allopatric, sympatric, and polyploid speciation, and understand how these different types of speciation have evolved over time.", "The student will be able to examine the role of genetic drift in shaping the evolutionary relationships of other species, and understand how genetic drift has evolved over time.", "The student will be able to assess the role of natural selection and genetic drift in shaping the evolutionary relationships of other species, and understand how these factors have evolved over time."]}, {"title": "The Evolutionary Relationships of Plants", "goals": ["The student will be able to identify and describe the major groups of plants, their relationships, and the evolutionary history of the plant kingdom. The student will be able to describe the major evolutionary events in the plant kingdom, including the origin of land plants, the origin of seed", "The student will be able to describe the major evolutionary events in the plant kingdom, including the origin of land plants, the origin of seed plants, and the origin of flowering plants. The student will be able to describe the major evolutionary events in the plant kingdom, including the", "The student will be able to explain the major evolutionary events in the plant kingdom, including the origin of land plants, the origin of seed plants, and the origin of flowering plants. The student will be able to describe the major evolutionary events in the plant kingdom, including", "The student will be able to distinguishe the major evolutionary events in the plant kingdom, including the origin of land plants, the origin of seed plants, and the origin of flowering plants.", "The student will be able to identify the major evolutionary events in the plant kingdom, including the origin of land plants, the origin of seed plants, and the origin of flowering plants.", "The student will be able to compare the major evolutionary events in the plant kingdom, including the origin of land plants, the origin of seed plants, and the origin of flowering plants.", "The student will be able to contrast the major evolutionary events in the plant kingdom, including the origin of land plants, the origin of seed plants, and the origin of flowering plants.", "The student will be able to evaluate the major evolutionary events in the plant kingdom, including the origin of land plants, the origin of seed plants, and the origin of flowering plants.", "The student will be able to assess the major evolutionary events in the plant kingdom, including the origin of land plants, the origin of seed plants, and the origin of flowering plants.", "The student will be able to critique the major evolutionary events in the plant kingdom, including the origin of land plants, the origin of seed plants, and the origin of flowering plants."]}, {"title": "The Evolutionary Relationships of Fungi", "goals": ["The student will be able to identify and describe the major groups of fungi, including their morphological and ecological characteristics. ", "The student will be able to explain the role of fungi in the ecosystem, including their role in decomposition and nutrient cycling. The student will be able todescribe the process of speciation and the factors that influence it, including the role of genetic drift, gene flow,", "The student will be able to describe the process of speciation and the factors that influence it, including the role of genetic drift, gene flow, and natural selection. The student will be able toexplain the role of fungi in the ecosystem, including their role in decomposition and", "The student will be able to identify and describe the major groups of fungi, including their morphological and ecological characteristics. The student will be able todescribe the process of speciation and the factors that influence it, including the role of genetic drift, gene flow, and", "The student will be able to distinguishthe different types of evolutionary relationships between fungi, including symbiosis, parasitism, and mutualism. The student will be able toexplain the role of fungi in the ecosystem, including their role in decomposition and nut", "The student will be able to compare and contrast the different types of evolutionary relationships between fungi, including symbiosis, parasitism, and mutualism. The student will be able toexplain the role of fungi in the ecosystem, including their role in decomposition", "The student will be able to evaluate the role of fungi in the ecosystem, including their role in decomposition and nutrient cycling.", "The student will be able to demonstrate an understanding of the process of speciation and the factors that influence it, including the role of genetic drift, gene flow, and natural selection.", "The student will be able to demonstrate an understanding of the process of speciation and the factors that influence it, including the role of genetic drift, gene flow, and natural selection.", "The student will be able to differentiate the different types of evolutionary relationships between fungi, including symbiosis, parasitism, and mutualism."]}, {"title": "The Evolutionary Relationships of Bacteria", "goals": ["The student will be able to identify the different types of bacteria and their evolutionary relationships. They will also be able to understand the role of bacteria in the environment and their impact on human health. Additionally, the student will be able to discuss the different types of antibiotic resistance", "The student will be able to identify the different types of bacteria and their evolutionary relationships. They will also be able to understand the role of bacteria in the environment and their impact on human health. Additionally, the student will be able to discuss the different types of antibiotic resistance.", "The student will be able to explain the different types of bacteria and their evolutionary relationships. They will also be able to understand the role of bacteria in the environment and their impact on human health. Additionally, the student will be able to discuss the different types of antibiotic resistance", "The student will be able to distinguishe the different types of bacteria and their evolutionary relationships. They will also be able to understand the role of bacteria in the environment and their impact on human health. Additionally, the student will be able to discuss the different types of antibiotic resistance", "The student will be able to describe the different types of bacteria and their evolutionary relationships. They will also be able to understand the role of bacteria in the environment and their impact on human health. Additionally, the student will be able to discuss the different types of antibiotic resistance", "The student will be able to define the different types of bacteria and their evolutionary relationships. They will also be able to understand the role of bacteria in the environment and their impact on human health. Additionally, the student will be able to discuss the different types of antibiotic resistance", "The student will be able to classify the different types of bacteria and their evolutionary relationships. They will also be able to understand the role of bacteria in the environment and their impact on human health. Additionally, the student will be able to discuss the different types of antibiotic resistance", "The student will be able to compare the different types of bacteria and their evolutionary relationships. They will also be able to understand the role of bacteria in the environment and their impact on human health. Additionally, the student will be able to discuss the different types of antibiotic resistance", "The student will be able to contrast the different types of bacteria and their evolutionary relationships. They will also be able to understand the role of bacteria in the environment and their impact on human health. Additionally, the student will be able to discuss the different types of antibiotic resistance", "The student will be able to evaluate the different types of bacteria and their evolutionary relationships. They will also be able to understand the role of bacteria in the environment and their impact on human health. Additionally, the student will be able to discuss the different types of antibiotic resistance"]}, {"title": "The Evolutionary Relationships of Viruses", "goals": ["The student will be able to explain the concept of evolutionary relationships and how it applies to viruses. ", "The student will be able to describe the different types of viruses and their classification. The student will be able toexplain the role of viruses in the evolution of life and the role of evolution in the development of viruses. The student will be able todescribe the", "The student will be able to distinguishe between the different types of viruses and their classification. The student will be able toexplain the role of viruses in the evolution of life and the role of evolution in the development of viruses. The student will be able todescribe", "The student will be able to differentiate between the different types of viruses and their classification. The student will be able toexplain the role of viruses in the evolution of life and the role of evolution in the development of viruses.", "The student will be able to demonstrate an understanding of the different types of viruses and their classification. The student will be able toexplain the role of viruses in the evolution of life and the role of evolution in the development of viruses.", "The student will be able to demonstrate an understanding of the different types of viruses and their classification. The student will be able toexplain the role of viruses in the evolution of life and the role of evolution in the development of viruses.", "The student will be able to define the different types of viruses and their classification. The student will be able toexplain the role of viruses in the evolution of life and the role of evolution in the development of viruses.", "The student will be able to defend the different types of viruses and their classification. The student will be able toexplain the role of viruses in the evolution of life and the role of evolution in the development of viruses.", "The student will be able to designate the different types of viruses and their classification. The student will be able toexplain the role of viruses in the evolution of life and the role of evolution in the development of viruses.", "The student will be able to identify the different types of viruses and their classification. The student will be able toexplain the role of viruses in the evolution of life and the role of evolution in the development of viruses."]}, {"title": "The Evolutionary Relationships of Fossils", "goals": ["The student will be able to identify the evolutionary relationships of fossils, understand the process of fossilization, and recognize the importance of fossils in the study of evolution.", "The student will be able to identify the evolutionary relationships of fossils, understand the process of fossilization, and recognize the importance of fossils in the study of evolution.", "The student will be able to explain the role of fossils in the study of evolution, and understand the importance of fossils in the study of evolution.", "The student will be able to describe the process of fossilization, and understand the importance of fossils in the study of evolution.", "The student will be able to distinguishe the different types of fossils, and understand the importance of fossils in the study of evolution.", "The student will be able to compare and contrast the different types of fossils, and understand the importance of fossils in the study of evolution.", "The student will be able to evaluate the importance of fossils in the study of evolution, and understand the importance of fossils in the study of evolution.", "The student will be able to assess the importance of fossils in the study of evolution, and understand the importance of fossils in the study of evolution.", "The student will be able to applying the knowledge of the evolutionary relationships of fossils in the study of evolution, and understand the importance of fossils in the study of evolution.", "The student will be able to demonstrate the knowledge of the evolutionary relationships of fossils in the study of evolution, and understand the importance of fossils in the study of evolution."]}, {"title": "The Evolutionary Relationships of Genes", "goals": ["The student will be able to explain the basic principles of evolutionary biology, including the concept of natural selection, genetic variation, and genetic drift. They will also be able to understand the role of genetic variation in the process of evolution, and how it is influenced by factors such", "The student will be able to apply the basic principles of evolutionary biology, including the concept of natural selection, genetic variation, and genetic drift. They will also be able to understand the role of genetic variation in the process of evolution, and how it is influenced by factors such", "The student will be able to describe the basic principles of evolutionary biology, including the concept of natural selection, genetic variation, and genetic drift. They will also be able to understand the role of genetic variation in the process of evolution, and how it is influenced by factors such", "The student will be able to distinguishe the basic principles of evolutionary biology, including the concept of natural selection, genetic variation, and genetic drift. They will also be able to understand the role of genetic variation in the process of evolution, and how it is influenced by factors such", "The student will be able to identify the basic principles of evolutionary biology, including the concept of natural selection, genetic variation, and genetic drift. They will also be able to understand the role of genetic variation in the process of evolution, and how it is influenced by factors such", "The student will be able to define the basic principles of evolutionary biology, including the concept of natural selection, genetic variation, and genetic drift. They will also be able to understand the role of genetic variation in the process of evolution, and how it is influenced by factors such", "The student will be able to classify the basic principles of evolutionary biology, including the concept of natural selection, genetic variation, and genetic drift. They will also be able to understand the role of genetic variation in the process of evolution, and how it is influenced by factors such", "The student will be able to critique the basic principles of evolutionary biology, including the concept of natural selection, genetic variation, and genetic drift. They will also be able to understand the role of genetic variation in the process of evolution, and how it is influenced by factors such", "The student will be able to evaluate the basic principles of evolutionary biology, including the concept of natural selection, genetic variation, and genetic drift. They will also be able to understand the role of genetic variation in the process of evolution, and how it is influenced by factors such", "The student will be able to assess the basic principles of evolutionary biology, including the concept of natural selection, genetic variation, and genetic drift. They will also be able to understand the role of genetic variation in the process of evolution, and how it is influenced by factors such"]}]}