{"title": "Human sexuality", "chapters": [{"title": "Introduction to Human Sexuality", "goals": ["The student will be able to define and understand the following terms:", "The student will be able to explain the biological, psychological, and social aspects of human sexuality.", "The student will be able to identify the various types of sexual behavior and understand the factors that influence these behaviors.The student will be able todescribe the development of human sexuality from childhood through adulthood.The student will be able toexplain the role of culture and", "The student will be able to identify the role of culture and religion in shaping human sexuality.", "The student will be able to describe the role of the media in shaping human sexuality.The student will be able toexplain the role of the media in shaping human sexuality.", "The student will be able to distinguishe between healthy and unhealthy sexual behaviors.The student will be able toexplain the role of the media in shaping human sexuality.", "The student will be able to evaluate the role of the media in shaping human sexuality.", "The student will be able to demonstrate an understanding of the role of the media in shaping human sexuality.", "The student will be able to demonstrate an understanding of the role of the media in shaping human sexuality.", "The student will be able to differentiate between healthy and unhealthy sexual behaviors."]}, {"title": "Historical Perspectives on Human Sexuality", "goals": ["The student will be able to identify and analyze the historical contexts in which human sexuality has been understood and practiced. ", "The student will be able to evaluate the ways in which historical perspectives have shaped contemporary understandings of human sexuality. The student will be able toanalyze the ways in which historical perspectives on human sexuality have been influenced by cultural, social, and political factors. The student", "The student will be able to identify and analyze the historical contexts in which human sexuality has been understood and practiced. The student will be able toevaluate the ways in which historical perspectives have shaped contemporary understandings of human sexuality. The student will be able to", "The student will be able to examine the ways in which historical perspectives on human sexuality have been influenced by cultural, social, and political factors. The student will be able toanalyze the ways in which historical perspectives on human sexuality have been influenced by cultural, social", "The student will be able to explain the ways in which historical perspectives on human sexuality have been influenced by cultural, social, and political factors. The student will be able toanalyze the ways in which historical perspectives on human sexuality have been influenced by cultural, social,", "The student will be able to distinguishe the ways in which historical perspectives on human sexuality have been influenced by cultural, social, and political factors.", "The student will be able to compare and contrast the ways in which historical perspectives on human sexuality have been influenced by cultural, social, and political factors.", "The student will be able to assess the ways in which historical perspectives on human sexuality have been influenced by cultural, social,", "The student will be able to demonstrate the ways in which historical perspectives on human sexuality have been influenced by cultural, social, and political factors.", "The student will be able to demonstrate the ways in which historical perspectives on human sexuality have been influenced by cultural, social,"]}, {"title": "Biological Aspects of Human Sexuality", "goals": ["The student will be able to identify and understand the biological basis of human sexuality, including the physiological and anatomical aspects of sexual behavior. ", "The student will be able to explain the role of hormones and other chemical messengers in the regulation of sexual behavior. The student will be able todescribe the development of the reproductive system and the role of the endocrine system in the regulation of sexual behavior.", "The student will be able to identify and understand the role of the nervous system in the regulation of sexual behavior. The student will be able todescribe the role of the immune system in the regulation of sexual behavior. The student will be able toidentify and understand the role of the", "The student will be able to describe the role of the immune system in the regulation of sexual behavior. The student will be able toidentify and understand the role of the immune system in the regulation of sexual behavior. The student will be able todescribe the role of the immune", "The student will be able to distinguishthe role of the immune system in the regulation of sexual behavior.", "The student will be able to compare and contrast the differences in sexual behavior between males and females. The student will be able toidentify and understand the role of the immune system in the regulation of sexual behavior. The student will be able todescribe the role of the immune system", "The student will be able to differentiate the role of the immune system in the regulation of sexual behavior. The student will be able toidentify and understand the role of the immune system in the regulation of sexual behavior. The student will be able todescribe the role of the immune", "The student will be able to demonstrate the role of the immune system in the regulation of sexual behavior. The student will be able toidentify and understand the role of the immune system in the regulation of sexual behavior. The student will be able todescribe the role of the immune system", "The student will be able to demonstrate the role of the immune system in the regulation of sexual behavior. The student will be able toidentify and understand the role of the immune system in the regulation of sexual behavior. The student will be able todescribe the role of the immune system", "The student will be able to designate the role of the immune system in the regulation of sexual behavior. The student will be able toidentify and understand the role of the immune system in the regulation of sexual behavior. The student will be able todescribe the role of the"]}, {"title": "Psychological Aspects of Human Sexuality", "goals": ["The student will be able to identify and discuss the psychological aspects of human sexuality, including the role of psychological factors in sexual behavior, the influence of psychological factors on sexual behavior, and the psychological factors that influence sexual behavior. The student will be able to identify and discuss the psychological", "The student will be able to identify and discuss the psychological aspects of human sexuality, including the role of psychological factors in sexual behavior, the influence of psychological factors on sexual behavior, and the psychological factors that influence sexual behavior. The student will be able to identify and discuss the psychological aspects", "The student will be able to distinguishthe psychological aspects of human sexuality, including the role of psychological factors in sexual behavior, the influence of psychological factors on sexual behavior, and the psychological factors that influence sexual behavior. The student will be able to distinguish the psychological aspects of human sexual", "The student will be able to differentiate the psychological aspects of human sexuality, including the role of psychological factors in sexual behavior, the influence of psychological factors on sexual behavior, and the psychological factors that influence sexual behavior.", "The student will be able to demonstrate an understanding of the psychological aspects of human sexuality, including the role of psychological factors in sexual behavior, the influence of psychological factors on sexual behavior, and the psychological factors that influence sexual behavior.", "The student will be able to demonstrate an understanding of the psychological aspects of human sexuality, including the role of psychological factors in sexual behavior, the influence of psychological factors on sexual behavior, and the psychological factors that influence sexual behavior.", "The student will be able to apply psychological concepts and theories to the understanding of human sexuality, including the role of psychological factors in sexual behavior, the influence of psychological factors on sexual behavior, and the psychological factors that influence sexual behavior.", "The student will be able to explain the role of psychological factors in sexual behavior, the influence of psychological factors on sexual behavior, and the psychological factors that influence sexual behavior.", "The student will be able to describe the role of psychological factors in sexual behavior, the influence of psychological factors on sexual behavior, and the psychological factors that influence sexual behavior.", "The student will be able to define the role of psychological factors in sexual behavior, the influence of psychological factors on sexual behavior, and the psychological factors that influence sexual behavior."]}, {"title": "Social Aspects of Human Sexuality", "goals": ["The student will be able to identify and discuss the social, cultural, and historical contexts of human sexuality. ", "The student will be able to identify and discuss the social, cultural, and historical contexts of human sexuality. The student will be able toidentify and discuss the social, cultural, and historical contexts of human sexuality. The student will be able toidentify and", "The student will be able to distinguishthe various theories and models of human sexuality. The student will be able toidentify and discuss the social, cultural, and historical contexts of human sexuality. The student will be able toidentify and discuss the social, cultural,", "The student will be able to apply theories and models of human sexuality to understand the complexities of human sexuality. The student will be able toidentify and discuss the social, cultural, and historical contexts of human sexuality. The student will be able toidentify", "The student will be able to evaluate the impact of social, cultural, and historical contexts on human sexuality.", "The student will be able to explain the role of social, cultural, and historical contexts in shaping human sexuality.", "The student will be able to describe the role of social, cultural, and historical contexts in shaping human sexuality.", "The student will be able to demonstrate an understanding of the role of social, cultural, and historical contexts in shaping human sexuality.", "The student will be able to demonstrate an understanding of the role of social, cultural, and historical contexts in shaping human sexuality.", "The student will be able to differentiate between the various theories and models of human sexuality."]}, {"title": "Cultural Aspects of Human Sexuality", "goals": ["The student will be able to identify and discuss the cultural aspects of human sexuality. This will be achieved through a comprehensive understanding of the historical, social, and cultural contexts in which human sexuality is expressed and understood. The student will also be able to analyze and evaluate the", "The student will be able to identify and discuss the cultural aspects of human sexuality. This will be achieved through a comprehensive understanding of the historical, social, and cultural contexts in which human sexuality is expressed and understood. The student will also be able to analyze and evaluate theThe", "The student will be able to explain the historical, social, and cultural contexts in which human sexuality is expressed and understood. The student will also be able to analyze and evaluate theTheThe student will be able toexplain the historical, social, and cultural contexts in", "The student will be able to distinguishthe historical, social, and cultural contexts in which human sexuality is expressed and understood. The student will also be able to analyze and evaluate theTheThe student will be able todistinguishthe historical, social, and cultural context", "The student will be able to evaluate the historical, social, and cultural contexts in which human sexuality is expressed and understood. The student will also be able to analyze and evaluate theTheThe student will be able toevaluate the historical, social, and cultural contexts in", "The student will be able to compare and contrast the historical, social, and cultural contexts in which human sexuality is expressed and understood. The student will also be able to analyze and evaluate theTheThe student will be able tocompare and contrast the historical, social, and cultural", "The student will be able to contrast the historical, social, and cultural contexts in which human sexuality is expressed and understood. The student will also be able to analyze and evaluate theThe", "The student will be able to construct the historical, social, and cultural contexts inThe student will be able tocontrast the historical, social, and cultural contexts in which human sexuality is expressed and understood. The student will also be able to analyze and evaluate theThe", "The student will be able to reproduce the historical, social, and cultural contexts inThe student will be able tocontrast the historical, social, and cultural contexts in which human sexuality is expressed and understood. The student will also be able to analyze and evaluate theThe", "The student will be able to recall the historical, social, and cultural contexts inThe student will be able tocontrast the historical, social, and cultural contexts in which human sexuality is expressed and understood. The student will also be able to analyze and evaluate theThe"]}, {"title": "Religious Aspects of Human Sexuality", "goals": ["The student will be able to identify and discuss the religious aspects of human sexuality. This will be achieved through a comprehensive understanding of the religious teachings and beliefs of various religions, including Christianity, Judaism, Islam, and Hinduism. The student will also be able", "The student will be able to identify and discuss the religious aspects of human sexuality. This will be achieved through a comprehensive understanding of the religious teachings and beliefs of various religions, including Christianity, Judaism, Islam, and Hinduism. The student will also be able to", "The student will be able to distinguishthe various religious perspectives on sexuality, including the role of religion in shaping sexual behavior, the role of religion in shaping sexual morality, and the role of religion in shaping sexual ethics. The student will be able to", "The student will be able to evaluate the impact of religious beliefs and teachings on sexual behavior, sexual morality, and sexual ethics. The student will be able toThe student will be able toanalyze the role of religious beliefs and teachings in shaping sexual behavior,", "The student will be able to explain the role of religious beliefs and teachings in shaping sexual behavior, sexual morality, and sexual ethics. The student will be able toThe student will be able toanalyze the role of religious beliefs and teachings in shaping sexual", "The student will be able to examine the role of religious beliefs and teachings in shaping sexual behavior, sexual morality, and sexual ethics. The student will be able toThe student will be able toevaluate the role of religious beliefs and teachings in shaping sexual", "The student will be able to assess the role of religious beliefs and teachings in shaping sexual behavior, sexual morality, and sexual ethics. The student will be able toThe student will be able toanalyze the role of religious beliefs and teachings in shaping sexual", "The student will be able to applying the role of religious beliefs and teachings in shaping sexual behavior, sexual morality, and sexual ethics. The student will be able toThe student will be able toevaluate the role of religious beliefs and teachings in shaping sexual", "The student will be able to compare the role of religious beliefs and teachings in shaping sexual behavior, sexual morality, and sexual ethics. The student will be able toThe student will be able toanalyze the role of religious beliefs and teachings in shaping sexual", "The student will be able to demonstrate the role of religious beliefs and teachings in shaping sexual behavior, sexual morality, and sexual ethics."]}, {"title": "Sexual Orientation", "goals": ["The student will be able to define and understand the concept of sexual orientation. ", "The student will be able to identify the different types of sexual orientation. The student will be able todiscuss the factors that influence sexual orientation. The student will be able todiscuss the social and cultural factors that influence sexual orientation. The student will be able todiscuss the psychological", "The student will be able to distinguishthe differences between sexual orientation and sexual behavior. The student will be able todiscuss the impact of sexual orientation on personal relationships. The student will be able todiscuss the impact of sexual orientation on personal relationships. The student will be able to", "The student will be able to identify the different types of sexual orientation. The student will be able todiscuss the factors that influence sexual orientation. The student will be able todiscuss the social and cultural factors that influence sexual orientation. The student will be able todiscuss the", "The student will be able to differentiate between sexual orientation and sexual behavior. The student will be able todiscuss the impact of sexual orientation on personal relationships. The student will be able todiscuss the impact of sexual orientation on personal relationships.", "The student will be able to demonstrate an understanding of the different types of sexual orientation. The student will be able todiscuss the factors that influence sexual orientation. The student will be able todiscuss the social and cultural factors that influence sexual orientation. The student will be able to", "The student will be able to demonstrate an understanding of the different types of sexual orientation. The student will be able todiscuss the factors that influence sexual orientation. The student will be able todiscuss the social and cultural factors that influence sexual orientation. The student will be able toThe", "The student will be able to describe the differences between sexual orientation and sexual behavior. The student will be able todiscuss the impact of sexual orientation on personal relationships. The student will be able todiscuss the impact of sexual orientation on personal relationships.", "The student will be able to defend the concept of sexual orientation. The student will be able todiscuss the factors that influence sexual orientation. The student will be able todiscuss the social and cultural factors that influence sexual orientation. The student will be able toThe student will be", "The student will be able to designate the differences between sexual orientation and sexual behavior. The student will be able todiscuss the impact of sexual orientation on personal relationships. The student will be able todiscuss the impact of sexual orientation on personal relationships.The student will be able"]}, {"title": "Sexual Identity", "goals": ["The student will be able to define and understand the concept of sexual identity. ", "The student will be able to identify the various factors that influence sexual identity. The student will be able todescribe the different types of sexual identities. The student will be able toexplain the relationship between sexual identity and sexual behavior. The student will be able todiscuss the", "The student will be able to distinguishthe differences between sexual identity and sexual orientation. The student will be able toexplain the role of society and culture in shaping sexual identity. The student will be able todiscuss the impact of sexual identity on personal relationships and social interactions.", "The student will be able to explain the role of sexual identity in the development of self-esteem and self-acceptance.", "The student will be able to identify the various challenges that individuals with non-traditional sexual identities may face. The student will be able todiscuss the role of sexual identity in the development of personal values and beliefs.", "The student will be able to describe the various strategies that individuals can use to cope with the challenges associated with their sexual identity.", "The student will be able to evaluate the effectiveness of different interventions and support systems for individuals with non-traditional sexual identities.", "The student will be able to assess the impact of sexual identity on personal and professional decision-making.", "The student will be able to compare and contrast the different approaches to sexual identity development and expression.", "The student will be able to critique the various theories and models of sexual identity development."]}, {"title": "Sexual Behaviors", "goals": ["The student will be able to identify and describe the various types of sexual behaviors, including but not limited to:", "The student will be able to identify and describe the various types of sexual behaviors, including but not limited to:", "The student will be able to explain the biological, psychological, and social factors that influence sexual behaviors.The student will be able toexplain the biological, psychological, and social factors that influence sexual behaviors.The student will be able toexplain the biological, psychological, and social", "The student will be able to distinguishthe between normal and abnormal sexual behaviors.The student will be able todistinguishthe between normal and abnormal sexual behaviors.The student will be able toexplain the role of culture and religion in shaping sexual behaviors.The", "The student will be able to describe the role of culture and religion in shaping sexual behaviors.The student will be able todescribe the role of culture and religion in shaping sexual behaviors.The student will be able todescribe the role of culture and religion in shaping", "The student will be able to evaluate the impact of sexual behaviors on individuals and society.The student will be able toevaluate the impact of sexual behaviors on individuals and society.", "The student will be able to assess the impact of sexual behaviors on individuals and society.", "The student will be able to compare and contrast the different approaches to the study of sexual behaviors.The student will be able tocompare and contrast the different approaches to the study of sexual behaviors.", "The student will be able to apply the different approaches to the study of sexual behaviors.", "The student will be able to demonstrate the different approaches to the study of sexual behaviors."]}, {"title": "Sexual Health", "goals": ["The student will be able to define and understand the concepts of sexual health, sexuality, and sexual behavior. ", "The student will be able to identify the factors that influence sexual behavior and sexual health. The student will be able todescribe the physical, emotional, and social aspects of sexual health. The student will be able toidentify the factors that influence sexual behavior and sexual health. The student", "The student will be able to describe the physical, emotional, and social aspects of sexual health. The student will be able toidentify the factors that influence sexual behavior and sexual health. The student will be able todescribe the physical, emotional, and social aspects of sexual health.", "The student will be able to identify the factors that influence sexual behavior and sexual health. The student will be able todescribe the physical, emotional, and social aspects of sexual health. The student will be able toidentify the factors that influence sexual behavior and sexual health. The student", "The student will be able to distinguishthe between normal and abnormal sexual behavior. The student will be able todescribe the physical, emotional, and social aspects of sexual health. The student will be able toidentify the factors that influence sexual behavior and sexual health. The student", "The student will be able to differentiate between normal and abnormal sexual behavior. The student will be able todescribe the physical, emotional, and social aspects of sexual health. The student will be able toidentify the factors that influence sexual behavior and sexual health. The studentThe", "The student will be able to demonstrate an understanding of the physical, emotional, and social aspects of sexual health. The student will be able toidentify the factors that influence sexual behavior and sexual health. The student will be able todescribe the physical, emotional, and social aspects", "The student will be able to demonstrate an understanding of the physical, emotional, and social aspects of sexual health. The student will be able toidentify the factors that influence sexual behavior and sexual health. The student will be able todescribe the physical, emotional, and social aspects of", "The student will be able to develop an understanding of the physical, emotional, and social aspects of sexual health. The student will be able toidentify the factors that influence sexual behavior and sexual health. The student will be able todescribe the physical, emotional, and social aspects", "The student will be able to design an understanding of the physical, emotional, and social aspects of sexual health. The student will be able toidentify the factors that influence sexual behavior and sexual health. The student will be able todescribe the physical, emotional, and social aspects"]}, {"title": "Sexual Disorders", "goals": ["The student will be able to define and understand the concept of sexual disorders. ", "The student will be able to identify the different types of sexual disorders. The student will be able todescribe the causes and risk factors associated with sexual disorders. The student will be able todescribe the diagnostic criteria and assessment tools used to diagnose sexual disorders. The student will be", "The student will be able to describe the various treatment options available for sexual disorders. The student will be able todescribe the role of the healthcare provider in the treatment of sexual disorders. The student will be able todescribe the role of the patient in the treatment of sexual disorders.", "The student will be able to distinguishthe between normal and abnormal sexual behavior. The student will be able todescribe the impact of sexual disorders on the individual and their relationships. The student will be able todescribe the impact of sexual disorders on the individual and their relationships.", "The student will be able to identify the resources available for individuals with sexual disorders.", "The student will be able to explain the importance of early detection and intervention for sexual disorders.", "The student will be able to evaluate the effectiveness of various treatment options for sexual disorders.", "The student will be able to demonstrate an understanding of the ethical and legal issues surrounding sexual disorders.", "The student will be able to demonstrate an understanding of the cultural and societal influences on sexual disorders.", "The student will be able to differentiate between the various types of sexual disorders."]}, {"title": "Sexual Education", "goals": ["The student will be able to identify and discuss the various aspects of human sexuality, including biological, psychological, and social factors. They will also be able to discuss the role of culture and religion in shaping sexual behavior and attitudes. The student will be able to discuss the role", "The student will be able to distinguishthe various aspects of human sexuality, including biological, psychological, and social factors. They will also be able to discuss the role of culture and religion in shaping sexual behavior and attitudes. The student will be able to distinguish the various aspects of", "The student will be able to identify and discuss the various aspects of human sexuality, including biological, psychological, and social factors. They will also be able to discuss the role of culture and religion in shaping sexual behavior and attitudes. The student will be able to distinguish the various", "The student will be able to explain the various aspects of human sexuality, including biological, psychological, and social factors. They will also be able to discuss the role of culture and religion in shaping sexual behavior and attitudes.", "The student will be able to describe the various aspects of human sexuality, including biological, psychological, and social factors. They will also be able to discuss the role of culture and religion in shaping sexual behavior and attitudes.", "The student will be able to define the various aspects of human sexuality, including biological, psychological, and social factors. They will also be able to discuss the role of culture and religion in shaping sexual behavior and attitudes.", "The student will be able to list the various aspects of human sexuality, including biological, psychological, and social factors.", "The student will be able to name the various aspects of human sexuality, including biological, psychological, and social factors.", "The student will be able to compare the various aspects of human sexuality, including biological, psychological, and social factors.", "The student will be able to contrast the various aspects of human sexuality, including biological, psychological, and social factors."]}, {"title": "Sexual Ethics", "goals": ["The student will be able to identify and analyze the various ethical issues that arise in human sexuality. ", "The student will be able to apply ethical principles and theories to the analysis of sexual ethics. The student will be able toevaluate the impact of sexual ethics on individuals, relationships, and society. The student will be able todevelop a personal code of sexual ethics based on", "The student will be able to identify and analyze the various ethical issues that arise in human sexuality. The student will be able toapply ethical principles and theories to the analysis of sexual ethics. The student will be able toevaluate the impact of sexual ethics on individuals, relationships", "The student will be able to develop a personal code of sexual ethics based onThe student will be able toidentify and analyze the various ethical issues that arise in human sexuality. The student will be able toapply ethical principles and theories to the analysis of sexual ethics. The", "The student will be able to evaluate the impact of sexual ethics on individuals, relationships, and society. The student will be able todevelop a personal code of sexual ethics based onThe student will be able toidentify and analyze the various ethical issues that arise in human sexuality", "The student will be able to demonstrate an understanding of the historical and cultural contexts of sexual ethics. The student will be able toanalyze the role of sexual ethics in shaping human behavior and social norms.", "The student will be able to demonstrate an understanding of the historical and cultural contexts of sexual ethics. The student will be able toanalyze the role of sexual ethics in shaping human behavior and social norms.", "The student will be able to differentiate between the various approaches to sexual ethics, including religious, philosophical, and legal perspectives. The student will be able toanalyze the role of sexual ethics in shaping human behavior and social norms.", "The student will be able to distinguishe between the various approaches to sexual ethics, including religious, philosophical, and legal perspectives. The student will be able toanalyze the role of sexual ethics in shaping human behavior and social norms.", "The student will be able to assess the impact of sexual ethics on individuals, relationships, and society. The student will be able toassess the impact of sexual ethics on individuals, relationships, and society."]}]}