{"title": "Linear algebra", "chapters": [{"title": "Introduction to Linear Algebra", "goals": ["The student will be able to interpret and apply the basic concepts of linear algebra, including vectors, matrices, and linear transformations. They will also be able to apply the basic concepts of linear algebra to solve problems in physics, engineering, and other scientific fields. The student will be", "The student will be able to interpret and apply the basic concepts of linear algebra, including vectors, matrices, and linear transformations. They will also be able to apply the basic concepts of linear algebra to solve problems in physics, engineering, and other scientific fields. The student will be able", "The student will be able to apply the basic concepts of linear algebra, including vectors, matrices, and linear transformations. They will also be able to apply the basic concepts of linear algebra to solve problems in physics, engineering, and other scientific fields. The student will be able to", "The student will be able to solve problems in physics, engineering, and other scientific fields using the basic concepts of linear algebra, including vectors, matrices, and linear transformations.", "The student will be able to summarizethe basic concepts of linear algebra, including vectors, matrices, and linear transformations.", "The student will be able to select and apply the appropriate linear algebra techniques to solve problems in physics, engineering, and other scientific fields.", "The student will be able to explain the basic concepts of linear algebra, including vectors, matrices, and linear transformations, and their applications in physics, engineering, and other scientific fields.", "The student will be able to demonstrate their understanding of the basic concepts of linear algebra, including vectors, matrices, and linear transformations, through problem-solving in physics, engineering, and other scientific fields.", "The student will be able to identify and apply the appropriate linear algebra techniques to solve problems in physics, engineering, and other scientific fields.", "The student will be able to identify and apply the appropriate linear algebra techniques to solve problems in physics, engineering, and other scientific fields."]}, {"title": "Vectors and Matrices", "goals": ["The student will be able to define and manipulate vectors and matrices, understand the concept of linear transformations, and be able to solve systems of linear equations. The student will also be able to understand the concept of linear transformations and be able to solve systems of linear equations.", "The student will be able to apply the concept of linear transformations and be able to solve systems of linear equations.", "The student will be able to solve systems of linear equations and understand the concept of linear transformations.", "The student will be able to summarizethe concept of linear transformations and be able to solve systems of linear equations.", "The student will be able to state the concept of linear transformations and be able to solve systems of linear equations.", "The student will be able to describe the concept of linear transformations and be able to solve systems of linear equations.", "The student will be able to identify the concept of linear transformations and be able to solve systems of linear equations.", "The student will be able to identify the concept of linear transformations and be able to solve systems of linear equations.", "The student will be able to explain the concept of linear transformations and be able to solve systems of linear equations.", "The student will be able to distinguishthe concept of linear transformations and be able to solve systems of linear equations."]}, {"title": "Vector Spaces", "goals": ["The student will be able to define and manipulate vector spaces, understand the concept of linear transformations, and be able to apply the concept of linear transformations to solve problems.", "The student will be able to apply the concept of linear transformations to solve problems.", "The student will be able to solve problems using linear transformations.", "The student will be able to summarizethe concepts of linear transformations.", "The student will be able to state the concepts of linear transformations.", "The student will be able to describe the concepts of linear transformations.", "The student will be able to identify the concepts of linear transformations.", "The student will be able to identify the concepts of linear transformations.", "The student will be able to explain the concepts of linear transformations.", "The student will be able to distinguishthe concepts of linear transformations."]}, {"title": "Linear Transformations", "goals": ["The student will be able to define and apply the concept of linear transformations, understand the concept of linear transformations, and apply the concept of linear transformations to solve problems.", "The student will be able to apply the concept of linear transformations to solve problems.", "The student will be able to demonstrate the concept of linear transformations in a variety of contexts.", "The student will be able to demonstrate the concept of linear transformations in a variety of contexts.", "The student will be able to differentiate between the different types of linear transformations.", "The student will be able to distinguishthe different types of linear transformations.The student will be able toapply the concept of linear transformations to solve problems.", "The student will be able to describe the concept of linear transformations in a variety of contexts.The student will be able todescribe the concept of linear transformations in a variety of contexts.", "The student will be able to defend the concept of linear transformations in a variety of contexts.The student will be able todemonstrate the concept of linear transformations in a variety of contexts.", "The student will be able to develop the concept of linear transformations in a variety of contexts.", "The student will be able to design the concept of linear transformations in a variety of contexts."]}, {"title": "Eigenvalues and Eigenvectors", "goals": ["The student will be able to compute and understand the concept of eigenvalues and eigenvectors. They will be able to apply this knowledge to solve systems of linear equations and to analyze the behavior of matrices.", "The student will be able to apply the concept of eigenvalues and eigenvectors to solve systems of linear equations and to analyze the behavior of matrices.", "The student will be able to explain the concept of eigenvalues and eigenvectors and their applications in linear algebra.", "The student will be able to solve systems of linear equations using eigenvalues and eigenvectors.", "The student will be able to use eigenvalues and eigenvectors to analyze the behavior of matrices.", "The student will be able to demonstrate their understanding of eigenvalues and eigenvectors through problem-solving exercises.", "The student will be able to identify the eigenvalues and eigenvectors of a given matrix.", "The student will be able to describe the properties of eigenvalues and eigenvectors and their applications in linear algebra.", "The student will be able to summarize the concept of eigenvalues and eigenvectors and their applications in linear algebra.", "The student will be able to state the relationship between eigenvalues and eigenvectors and their applications in linear algebra."]}, {"title": "Determinants and Inverses", "goals": ["The student will be able to compute the determinant of a matrix, and use it to solve systems of linear equations. The student will also be able to compute the inverse of a matrix, and use it to solve systems of linear equations.", "The student will be able to use the properties of determinants and inverses to solve systems of linear equations.", "The student will be able to apply the properties of determinants and inverses to solve systems of linear equations.", "The student will be able to solve systems of linear equations using the properties of determinants and inverses.", "The student will be able to summarize the properties of determinants and inverses.", "The student will be able to state the properties of determinants and inverses.", "The student will be able to define the properties of determinants and inverses.", "The student will be able to describe the properties of determinants and invers", "The student will be able to explain the properties of determinants and inverses.", "The student will be able to identify the properties of determinants and inverses."]}, {"title": "Linear Equations", "goals": ["The student will be able to solve systems of linear equations, understand the concept of linear transformations, and be able to apply the concept of linear transformations to solve problems.", "The student will be able to state and understand the concept of linear transformations, and be able to apply the concept of linear transformations to solve problems.", "The student will be able to summarize the concept of linear transformations and be able to apply the concept of linear transformations to solve problems.", "The student will be able to apply the concept of linear transformations to solve problems.", "The student will be able to select and apply the concept of linear transformations to solve problems.", "The student will be able to identify and apply the concept of linear transformations to solve problems.", "The student will be able to identify and apply the concept of linear transformations to solve problems.", "The student will be able to use the concept of linear transformations to solve problems.", "The student will be able to explain the concept of linear transformations and be able to apply the concept of linear transformations to solve problems.", "The student will be able to describe the concept of linear transformations and be able to apply the concept of linear transformations to solve problems."]}, {"title": "Linear Transformations and Eigenvalues", "goals": ["The student will be able to define and apply the concept of linear transformations, understand the concept of eigenvalues and eigenvectors, and apply the concept of eigenvalues and eigenvectors to solve linear equations.", "The student will be able to apply the concept of linear transformations, understand the concept of eigenvalues and eigenvectors, and apply the concept of eigenvalues and eigenvectors to solve linear equations.", "The student will be able to solve linear equations using eigenvalues and eigenvectors.", "The student will be able to summarizethe concepts of linear transformations, eigenvalues, and eigenvectors.", "The student will be able to state the properties of linear transformations, eigenvalues, and eigenvectors.", "The student will be able to select the correct linear transformation, eigenvalues, and eigenvectors for a given problem.", "The student will be able to use the concept of linear transformations, eigenvalues, and eigenvectors to solve linear equations.", "The student will be able to explain the concept of linear transformations, eigenvalues, and eigenvectors.", "The student will be able to describe the concept of linear transformations, eigenvalues, and eigenvectors.", "The student will be able to identify the concept of linear transformations, eigenvalues, and eigenvectors."]}, {"title": "Linear Transformations and Eigenvectors", "goals": ["The student will be able to define and understand the concept of linear transformations and eigenvectors. They will be able to apply the concept of linear transformations and eigenvectors to solve problems in linear algebra. They will also be able to understand the concept of eigenvalues and", "The student will be able to apply the concept of linear transformations and eigenvectors to solve problems in linear algebra. They will also be able to understand the concept of eigenvalues and eigenvectors and their applications in linear algebra.", "The student will be able to solve problems in linear algebra using linear transformations and eigenvectors. They will also be able to understand the concept of eigenvalues and eigenvevectors and their applications in linear algebra.", "The student will be able to summarizetheir understanding of linear transformations and eigenvectors in a written report.", "The student will be able to select and apply the appropriate mathematical techniques to solve problems in linear algebra.", "The student will be able to demonstrate their understanding of linear transformations and eigenvectors in a written report.", "The student will be able to demonstrate their understanding of linear transformations and eigenvectors in a written report.", "The student will be able to differentiate between the different types of linear transformations and eigenvectors.", "The student will be able to distinguishe between the different types of linear transformations and eigenvectors.", "The student will be able to identify the properties of linear transformations and eigenvectors."]}, {"title": "Determinants and Inverses of Matrices", "goals": ["The student will be able to compute the determinant and inverse of a matrix, and understand the properties of these operations. They will also be able to apply these concepts to solve systems of linear equations.", "The student will be able to apply the concepts of determinants and inverses of matrices to solve systems of linear equations.", "The student will be able to use the properties of determinants and inverses of matrices to solve systems of linear equations.", "The student will be able to explain the relationship between the determinant and the inverse of a matrix.", "The student will be able to demonstrate the use of determinants and inverses of matrices in solving systems of linear equations.", "The student will be able to identify the properties of determinants and inverses of matrices and apply them to solve systems of linear equations.", "The student will be able to describe the relationship between the determinant and the inverse of a matrix.", "The student will be able to demonstrate the use of determinants and inverses of matrices in solving systems of linear equations.", "The student will be able to identify the properties of determinants and inverses of matrices and apply them to solve systems of linear equations.", "The student will be able to differentiate between the determinant and the inverse of a matrix."]}, {"title": "Linear Equations and Eigenvalues", "goals": ["The student will be able to solve systems of linear equations, understand the concept of eigenvalues and eigenvectors, and apply these concepts to solve problems in physics and engineering.", "The student will be able to summarizethe concepts of linear equations and eigenvalues and eigenvectors, and apply these concepts to solve problems in physics and engineering.", "The student will be able to selectively apply the concepts of linear equations and eigenvalues and eigenvectors, and apply these concepts to solve problems in physics and engineering.", "The student will be able to apply the concepts of linear equations and eigenvalues and eigenvectors, and apply these concepts to solve problems in physics and engineering.", "The student will be able to statementsolve systems of linear equations, understand the concept of eigenvalues and eigenvectors, and apply these concepts to solve problems in physics and engineering.", "The student will be able to describe the concepts of linear equations and eigenvalues and eigenvectors, and apply these concepts to solve problems in physics and engineering.", "The student will be able to define the concepts of linear equations and eigenvalues and eigenvectors, and apply these concepts to solve problems in physics and engineering.", "The student will be able to identify the concepts of linear equations and eigenvalues and eigenvectors, and apply these concepts to solve problems in physics and engineering.", "The student will be able to identify the concepts of linear equations and eigenvalues and eigenvectors, and apply these concepts to solve problems in physics and engineering.", "The student will be able to explain the concepts of linear equations and eigenvalues and eigenvectors, and apply these concepts to solve problems in physics and engineering."]}, {"title": "Linear Equations and Eigenvectors", "goals": ["The student will be able to solve systems of linear equations, understand the concept of eigenvectors and eigenvalues, and apply the concept of eigenvectors and eigenvalues to solve systems of linear equations.", "The student will be able to summarizethe concepts of linear equations and eigenvectors in a concise manner.", "The student will be able to apply the concept of eigenvectors and eigenvalues to solve systems of linear equations.", "The student will be able to state the concept of eigenvectors and eigenvalues in a concise manner.", "The student will be able to select the correct eigenvectors and eigenvalues for a given matrix.", "The student will be able to use the concept of eigenvectors and eigenvalues to solve systems of linear equations.", "The student will be able to explain the concept of eigenvectors and eigenvalues in a concise manner.", "The student will be able to define the concept of eigenvectors and eigenvalues.", "The student will be able to describe the concept of eigenvectors and eigenvalues.", "The student will be able to identify the concept of eigenvectors and eigenvalues."]}, {"title": "Determinants and Inverses of Matrices and Eigenvalues", "goals": ["The student will be able to compute the determinant and inverse of a matrix, and understand the concept of eigenvalues and eigenvectors.", "The student will be able to apply the concept of determinants and inverses of matrices in solving linear equations and systems of linear equations. The student will be able toapply the concept of eigenvalues and eigenvectors in solving linear equations and systems of linear equations.", "The student will be able to use the concept of determinants and inverses of matrices in solving linear equations and systems of linear equations.", "The student will be able to explain the concept of eigenvalues and eigenvectors in solving linear equations and systems of linear equations.", "The student will be able to demonstrate the concept of determinants and inverses of matrices in solving linear equations and systems of linear equations.", "The student will be able to demonstrate the concept of eigenvalues and eigenvectors in solving linear equations and systems of linear equations.", "The student will be able to differentiate between the concept of determinants and inverses of matrices and the concept of eigenvalues and eigenvectors in solving linear equations and systems of linear equations.", "The student will be able to compare the concept of determinants and inverses of matrices and the concept of eigenvalues and eigenvectors in solving linear equations and systems of linear equations.", "The student will be able to evaluate the concept of determinants and inverses of matrices and the concept of eigenvalues and eigenvectors in solving linear equations and systems of linear equations.", "The student will be able to assess the concept of determinants and inverses of matrices and the concept of eigenvalues and eigenvectors in solving linear equations and systems of linear equations."]}, {"title": "Determinants and Inverses of Matrices and Eigenvectors", "goals": ["The student will be able to compute the determinant and inverse of a matrix, and understand the concept of eigenvectors and their relationship to the matrix.", "The student will be able to apply the concept of determinants and inverses of matrices in solving linear equations and systems of linear equations. The student will be able toapply the concept of eigenvectors and their relationship to the matrix in solving linear equations and systems of linear equations.", "The student will be able to use the concept of determinants and inverses of matrices in solving linear equations and systems of linear equations.", "The student will be able to explain the concept of eigenvectors and their relationship to the matrix in solving linear equations and systems of linear equations.", "The student will be able to demonstrate the concept of determinants and inverses of matrices in solving linear equations and systems of linear equations.", "The student will be able to demonstrate the concept of eigenvectors and their relationship to the matrix in solving linear equations and systems of linear equations.", "The student will be able to differentiate between the concept of determinants and inverses of matrices and the concept of eigenvectors and their relationship to the matrix in solving linear equations and systems of linear equations.", "The student will be able to identify the concept of determinants and inverses of matrices and the concept of eigenvectors and their relationship to the matrix in solving linear equations and systems of linear equations.", "The student will be able to identify the concept of determinants and inverses of matrices and the concept of eigenvectors and their relationship to the matrix in solving linear equations and systems of linear equations.", "The student will be able to compare the concept of determinants and inverses of matrices and the concept of eigenvectors and their relationship to the matrix in solving linear equations and systems of linear equations."]}]}