{"title": "Microbiology", "chapters": [{"title": "Introduction to Microbiology", "goals": ["The student will be able to define and explain the following terms:", "The student will be able to explain the basic principles of microbiology, including the role of microorganisms in the environment, the human body, and the food industry. The student will be able todescribe the basic structure and function of prokaryotic and euk", "The student will be able to describe the basic structure and function of prokaryotic and eukaryotic cells, including the differences between the two types of cells. The student will be able todescribe the basic structure and function of prokaryotic and eukaryotic", "The student will be able to identify and describe the basic structure and function of prokaryotic and eukaryotic cells, including the differences between the two types of cells. The student will be able todescribe the basic structure and function of prokaryotic and e", "The student will be able to identify and describe the basic structure and function of prokaryotic and eukaryotic cells, including the differences between the two types of cells. The student will be able todescribe the basic structure and function of prokaryotic and euk", "The student will be able to differentiate between the basic structure and function of prokaryotic and eukaryotic cells, including the differences between the two types of cells. The student will be able todescribe the basic structure and function of prokaryotic and euk", "The student will be able to demonstrate an understanding of the basic structure and function of prokaryotic and eukaryotic cells, including the differences between the two types of cells. The student will be able todescribe the basic structure and function of prokaryotic and", "The student will be able to demonstrate an understanding of the basic structure and function of prokaryotic and eukaryotic cells, including the differences between the two types of cells. The student will be able todescribe the basic structure and function of prokaryotic and e", "The student will be able to distinguishthe basic structure and function of prokaryotic and eukaryotic cells, including the differences between the two types of cells. The student will be able todescribe the basic structure and function of prokaryotic and eukThe", "The student will be able to defend the basic structure and function of prokaryotic and eukaryotic cells, including the differences between the two types of cells. The student will be able todescribe the basic structure and function of prokaryotic and eukThe"]}, {"title": "The Microbial World", "goals": ["The student will be able to identify and describe the basic structure and function of prokaryotic and eukaryotic cells. ", "The student will be able to describe the basic structure and function of the cell wall and cell membrane. The student will be able todescribe the basic structure and function of the nucleus and the cell membrane. The student will be able todescribe the basic structure and function", "The student will be able to identify and describe the basic structure and function of the cell wall and cell membrane. The student will be able todescribe the basic structure and function of the nucleus and the cell membrane. The student will be able todescribe the basic", "The student will be able to explain the basic structure and function of the cell wall and cell membrane. The student will be able todescribe the basic structure and function of the nucleus and the cell membrane. The student will be able todescribe the basic structure and", "The student will be able to distinguishthe basic structure and function of the cell wall and cell membrane. The student will be able todescribe the basic structure and function of the nucleus and the cell membrane. The student will be able todescribe the basic structure and", "The student will be able to differentiate the basic structure and function of the cell wall and cell membrane. The student will be able todescribe the basic structure and function of the nucleus and the cell membrane. The student will be able todescribe the basic structure and", "The student will be able to demonstrate the basic structure and function of the cell wall and cell membrane. The student will be able todescribe the basic structure and function of the nucleus and the cell membrane. The student will be able todescribe the basic structure and", "The student will be able to demonstrate the basic structure and function of the cell wall and cell membrane. The student will be able todescribe the basic structure and function of the nucleus and the cell membrane. The student will be able todescribe the basic structure andThe", "The student will be able to design the basic structure and function of the cell wall and cell membrane. The student will be able todescribe the basic structure and function of the nucleus and the cell membrane. The student will be able todescribe the basic structure and", "The student will be able to define the basic structure and function of the cell wall and cell membrane. The student will be able todescribe the basic structure and function of the nucleus and the cell membrane. The student will be able todescribe the basic structure and"]}, {"title": "Bacteria: The Single-Celled Prokaryotes", "goals": ["The student will be able to identify the different types of bacteria, including the differences between Gram-positive and Gram-negative bacteria.", "The student will be able to describe the structure and function of the bacterial cell wall, including the role of peptidoglycan and the role of the cell wall in bacterial resistance to antibiotics.The student will be able todescribe the structure and function of", "The student will be able to explain the role of the bacterial cell wall in the process of bacterial transformation, and the role of the cell wall in the process of bacterial conjugation.The student will be able todescribe the structure and function of the bacterial", "The student will be able to identify the different types of bacterial infections, including the differences between bacterial and viral infections.The student will be able todescribe the structure and function of the bacterial cell wall, including the role of peptidogly", "The student will be able to distinguishthe different types of bacterial infections, including the differences between bacterial and viral infections.", "The student will be able to define the term \"bacterial cell wall\" and explain its role in the process of bacterial transformation and bacterial conjugation.", "The student will be able to list the different types of antibiotics and their mechanisms of action, including the role of the bacterial cell wall in the process of bacterial transformation and bacterial conjugation.", "The student will be able to differentiate between the different types of bacterial infections, including the differences between bacterial and viral infections.", "The student will be able to demonstrate the role of the bacterial cell wall in the process of bacterial transformation and bacterial conjugation.", "The student will be able to demonstrate the role of the bacterial cell wall in the process of bacterial transformation and bacterial conjugation."]}, {"title": "Archaea: The Single-Celled Prokaryotes", "goals": ["The student will be able to identify the major characteristics of the Archaea, including their unique cellular structure, their unique cellular structure, and their unique cellular structure. They will also be able to describe the unique cellular structure of the Archaea, including their", "The student will be able to identify the major characteristics of the Archaea, including their unique cellular structure, their unique cellular structure, and their unique cellular structure. They will also be able to describe the unique cellular structure of the Archaea, including their unique", "The student will be able to describe the unique cellular structure of the Archaea, including their unique cellular structure, and their unique cellular structure.", "The student will be able to explain the unique cellular structure of the Archaea, including their unique cellular structure, and their unique cellular structure.", "The student will be able to distinguishe the Archaea from other prokaryotes, including the Bacteria and the Eukarya.", "The student will be able to compare and contrast the Archaea with other prokaryotes, including the Bacteria and the Eukarya.The student will be able todescribe the unique cellular structure of the Archaea, including their unique cellular", "The student will be able to differentiate the Archaea from other prokaryotes, including the Bacteria and the Eukarya.", "The student will be able to demonstrate the unique cellular structure of the Archaea, including their unique cellular structure, and their unique cellular structure.", "The student will be able to demonstrate the unique cellular structure of the Archaea, including their unique cellular structure, and their unique cellular structure.", "The student will be able to define the Archaea and describe their unique cellular structure, including their unique cellular structure, and their unique cellular structure."]}, {"title": "Viruses: The Non-Cellular Microorganisms", "goals": ["The student will be able to define and describe the structure and function of viruses, including their replication process and the role of the host cell in this process. The student will also be able to describe the different types of viruses and their classification, and understand the role of", "The student will be able to describe the structure and function of viruses, including their replication process and the role of the host cell in this process. The student will also be able to describe the different types of viruses and their classification, and understand the role of viruses", "The student will be able to explain the role of viruses in the environment, in the human body, and in the life cycle of other organisms. The student will also be able to describe the different types of viruses and their classification, and understand the role of viruses", "The student will be able to distinguishe between different types of viruses and their classification, and understand the role of viruses in the environment, in the human body, and in the life cycle of other organisms.", "The student will be able to identify the different types of viruses and their classification, and understand the role of viruses in the environment, in the human body, and in the life cycle of other organisms.", "The student will be able to identify the different types of viruses and their classification, and understand the role of viruses in the environment, in the human body, and in the life cycle of other organisms.", "The student will be able to differentiate between different types of viruses and their classification, and understand the role of viruses in the environment, in the human body, and in the life cycle of other organisms.", "The student will be able to demonstrate an understanding of the different types of viruses and their classification, and understand the role of viruses in the environment, in the human body, and in the life cycle of other organisms.", "The student will be able to demonstrate an understanding of the different types of viruses and their classification, and understand the role of viruses in the environment, in the human body, and in the life cycle of other organisms.", "The student will be able to defend the role of viruses in the environment, in the human body, and in the life cycle of other organisms."]}, {"title": "Fungi: The Eukaryotic Microorganisms", "goals": ["The student will be able to identify and describe the structure and function of fungi, including their cellular components, reproductive structures, and life cycle. ", "The student will be able to describe the role of fungi in the environment, including their role in decomposition, symbiosis, and disease. The student will be able todescribe the mechanisms of fungal pathogenesis, including the mechanisms of fungal toxin production", "The student will be able to identify and describe the mechanisms of fungal resistance and susceptibility to antifungal agents. The student will be able todescribe the mechanisms of fungal resistance and susceptibility to antifungal agents.", "The student will be able to explain the role of fungi in the development of antibiotics and the role of antibiotics in the treatment of fungal infections.", "The student will be able to distinguishe between different types of fungi, including yeasts, molds, and mushrooms, and describe the differences in their morphology and physiology.", "The student will be able to compare and contrast the growth patterns of different types of fungi, including the growth patterns of yeasts, molds, and mushrooms.", "The student will be able to define and describe the differences in the growth patterns of different types of fungi, including the growth patterns of yeasts, molds, and mushrooms.", "The student will be able to evaluate the role of fungi in the development of antibiotics and the role of antibiotics in the treatment of fungal infections.", "The student will be able to assess the role of fungi in the development of antibiotics and the role of antibiotics in the treatment of fungal infections.", "The student will be able to demonstrate the role of fungi in the development of antibiotics and the role of antibiotics in the treatment of fungal infections."]}, {"title": "Protists: The Eukaryotic Microorganisms", "goals": ["The student will be able to identify and describe the morphology and physiology of protists, including their life cycles and reproductive strategies. ", "The student will be able to describe the ecological roles of protists, including their roles in the environment and in human health. The student will be able todescribe the taxonomy and classification of protists, including the differences between prokaryotic and eukaryotic organ", "The student will be able to explain the evolutionary relationships between protists and other eukaryotic organisms, including the role of protists in the development of the eukaryotic cell. The student will be able todescribe the biochemical and molecular mechanisms", "The student will be able to identify and describe the morphology and physiology of protists, including their life cycles and reproductive strategies. The student will be able todescribe the ecological roles of protists, including their roles in the environment and in human health", "The student will be able to distinguishthe taxonomy and classification of protists, including the differences between prokaryotic and eukaryotic organisms. The student will be able toexplain the evolutionary relationships between protists and other eukaryotic organisms,", "The student will be able to examine the biochemical and molecular mechanisms that underlie the unique characteristics of protists, including the roles of cellular organelles and the mechanisms of cellular communication.", "The student will be able to evaluate the potential applications of protists in biotechnology and medicine, including the potential for the development of new drugs and therapies.", "The student will be able to assess the potential risks and benefits of the use of protists in biotechnology and medicine, including the potential for the development of new drugs and therapies.", "The student will be able to compare and contrast the different approaches to the study of protists, including the use of molecular and cellular techniques, and the use of ecological and evolutionary approaches.", "The student will be able to apply the principles of microbiology to the study of protists, including the use of microscopy and the use of molecular and cellular techniques."]}, {"title": "Algae: The Eukaryotic Microorganisms", "goals": ["The student will be able to identify and describe the structure and function of the cell wall, cell membrane, and cell membrane. ", "The student will be able to describe the structure and function of the cell wall, cell membrane, and cell membrane. The student will be able todescribe the structure and function of the cell wall, cell membrane, and cell membrane. The student will be able to", "The student will be able to identify and describe the structure and function of the cell wall, cell membrane, and cell membrane. The student will be able todescribe the structure and function of the cell wall, cell membrane, and cell membrane. The student will", "The student will be able to explain the role of the cell wall, cell membrane, and cell membrane in the life of the algae. The student will be able todescribe the structure and function of the cell wall, cell membrane, and cell membrane", "The student will be able to distinguishe between the different types of algae and their respective habitats. The student will be able todescribe the structure and function of the cell wall, cell membrane, and cell membrane. The student will be able toexplain the", "The student will be able to differentiate between the different types of algae and their respective habitats. The student will be able todescribe the structure and function of the cell wall, cell membrane, and cell membrane. The student will be able toexplain the", "The student will be able to demonstrate the role of the cell wall, cell membrane, and cell membrane in the life of the algae. The student will be able todescribe the structure and function of the cell wall, cell membrane, and cell membrane", "The student will be able to demonstrate the role of the cell wall, cell membrane, and cell membrane in the life of the algae. The student will be able todescribe the structure and function of the cell wall, cell membrane, and cell membrane", "The student will be able to define the role of the cell wall, cell membrane, and cell membrane in the life of the algae. The student will be able todescribe the structure and function of the cell wall, cell membrane, and cell membrane", "The student will be able to defend the role of the cell wall, cell membrane, and cell membrane in the life of the algae. The student will be able todescribe the structure and function of the cell wall, cell membrane, and cell membrane"]}, {"title": "Fungi: The Eukaryotic Microorganisms", "goals": ["The student will be able to identify and describe the structure and function of fungi, including their cellular components, reproductive structures, and life cycle. ", "The student will be able to describe the role of fungi in the environment, including their role in decomposition, symbiosis, and disease. The student will be able todescribe the mechanisms of fungal pathogenesis, including the mechanisms of fungal toxin production", "The student will be able to identify and describe the mechanisms of fungal resistance and susceptibility to antifungal agents. The student will be able todescribe the mechanisms of fungal resistance and susceptibility to antifungal agents.", "The student will be able to explain the role of fungi in the development of antibiotics and the role of antibiotics in the treatment of fungal infections.", "The student will be able to distinguishe between different types of fungi, including yeasts, molds, and mushrooms, and describe the differences in their morphology and physiology.", "The student will be able to compare and contrast the growth patterns of different types of fungi, including the growth patterns of yeasts, molds, and mushrooms.", "The student will be able to define and describe the differences in the growth patterns of different types of fungi, including the growth patterns of yeasts, molds, and mushrooms.", "The student will be able to evaluate the role of fungi in the development of antibiotics and the role of antibiotics in the treatment of fungal infections.", "The student will be able to assess the role of fungi in the development of antibiotics and the role of antibiotics in the treatment of fungal infections.", "The student will be able to demonstrate the role of fungi in the development of antibiotics and the role of antibiotics in the treatment of fungal infections."]}, {"title": "Bacteria: The Single-Celled Prokaryotes", "goals": ["The student will be able to identify the different types of bacteria, including the differences between Gram-positive and Gram-negative bacteria.", "The student will be able to describe the structure and function of the bacterial cell wall, including the role of peptidoglycan and the role of the cell wall in bacterial resistance to antibiotics.The student will be able todescribe the structure and function of", "The student will be able to explain the role of the bacterial cell wall in the process of bacterial transformation, and the role of the cell wall in the process of bacterial conjugation.The student will be able todescribe the structure and function of the bacterial", "The student will be able to identify the different types of bacterial infections, including the differences between bacterial and viral infections.The student will be able todescribe the structure and function of the bacterial cell wall, including the role of peptidogly", "The student will be able to distinguishthe different types of bacterial infections, including the differences between bacterial and viral infections.", "The student will be able to define the term \"bacterial cell wall\" and explain its role in the process of bacterial transformation and bacterial conjugation.", "The student will be able to list the different types of antibiotics and their mechanisms of action, including the role of the bacterial cell wall in the process of bacterial transformation and bacterial conjugation.", "The student will be able to differentiate between the different types of bacterial infections, including the differences between bacterial and viral infections.", "The student will be able to demonstrate the role of the bacterial cell wall in the process of bacterial transformation and bacterial conjugation.", "The student will be able to demonstrate the role of the bacterial cell wall in the process of bacterial transformation and bacterial conjugation."]}, {"title": "Archaea: The Single-Celled Prokaryotes", "goals": ["The student will be able to identify the major characteristics of the Archaea, including their unique cellular structure, their unique cellular structure, and their unique cellular structure. They will also be able to describe the unique cellular structure of the Archaea, including their", "The student will be able to identify the major characteristics of the Archaea, including their unique cellular structure, their unique cellular structure, and their unique cellular structure. They will also be able to describe the unique cellular structure of the Archaea, including their unique", "The student will be able to describe the unique cellular structure of the Archaea, including their unique cellular structure, and their unique cellular structure.", "The student will be able to explain the unique cellular structure of the Archaea, including their unique cellular structure, and their unique cellular structure.", "The student will be able to distinguishe the Archaea from other prokaryotes, including the Bacteria and the Eukarya.", "The student will be able to compare and contrast the Archaea with other prokaryotes, including the Bacteria and the Eukarya.The student will be able todescribe the unique cellular structure of the Archaea, including their unique cellular", "The student will be able to differentiate the Archaea from other prokaryotes, including the Bacteria and the Eukarya.", "The student will be able to demonstrate the unique cellular structure of the Archaea, including their unique cellular structure, and their unique cellular structure.", "The student will be able to demonstrate the unique cellular structure of the Archaea, including their unique cellular structure, and their unique cellular structure.", "The student will be able to define the Archaea and describe their unique cellular structure, including their unique cellular structure, and their unique cellular structure."]}, {"title": "Viruses: The Non-Cellular Microorganisms", "goals": ["The student will be able to define and describe the structure and function of viruses, including their replication process and the role of the host cell in this process. The student will also be able to describe the different types of viruses and their classification, and understand the role of", "The student will be able to describe the structure and function of viruses, including their replication process and the role of the host cell in this process. The student will also be able to describe the different types of viruses and their classification, and understand the role of viruses", "The student will be able to explain the role of viruses in the environment, in the human body, and in the life cycle of other organisms. The student will also be able to describe the different types of viruses and their classification, and understand the role of viruses", "The student will be able to distinguishe between different types of viruses and their classification, and understand the role of viruses in the environment, in the human body, and in the life cycle of other organisms.", "The student will be able to identify the different types of viruses and their classification, and understand the role of viruses in the environment, in the human body, and in the life cycle of other organisms.", "The student will be able to identify the different types of viruses and their classification, and understand the role of viruses in the environment, in the human body, and in the life cycle of other organisms.", "The student will be able to differentiate between different types of viruses and their classification, and understand the role of viruses in the environment, in the human body, and in the life cycle of other organisms.", "The student will be able to demonstrate an understanding of the different types of viruses and their classification, and understand the role of viruses in the environment, in the human body, and in the life cycle of other organisms.", "The student will be able to demonstrate an understanding of the different types of viruses and their classification, and understand the role of viruses in the environment, in the human body, and in the life cycle of other organisms.", "The student will be able to defend the role of viruses in the environment, in the human body, and in the life cycle of other organisms."]}, {"title": "Fungi: The Eukaryotic Microorganisms", "goals": ["The student will be able to identify and describe the structure and function of fungi, including their cellular components, reproductive structures, and life cycle. ", "The student will be able to describe the role of fungi in the environment, including their role in decomposition, symbiosis, and disease. The student will be able todescribe the mechanisms of fungal pathogenesis, including the mechanisms of fungal toxin production", "The student will be able to identify and describe the mechanisms of fungal resistance and susceptibility to antifungal agents. The student will be able todescribe the mechanisms of fungal resistance and susceptibility to antifungal agents.", "The student will be able to explain the role of fungi in the development of antibiotics and the role of antibiotics in the treatment of fungal infections.", "The student will be able to distinguishe between different types of fungi, including yeasts, molds, and mushrooms, and describe the differences in their morphology and physiology.", "The student will be able to compare and contrast the growth patterns of different types of fungi, including the growth patterns of yeasts, molds, and mushrooms.", "The student will be able to define and describe the differences in the growth patterns of different types of fungi, including the growth patterns of yeasts, molds, and mushrooms.", "The student will be able to evaluate the role of fungi in the development of antibiotics and the role of antibiotics in the treatment of fungal infections.", "The student will be able to assess the role of fungi in the development of antibiotics and the role of antibiotics in the treatment of fungal infections.", "The student will be able to demonstrate the role of fungi in the development of antibiotics and the role of antibiotics in the treatment of fungal infections."]}, {"title": "Protists: The Eukaryotic Microorganisms", "goals": ["The student will be able to identify and describe the morphology and physiology of protists, including their life cycles and reproductive strategies. ", "The student will be able to describe the ecological roles of protists, including their roles in the environment and in human health. The student will be able todescribe the taxonomy and classification of protists, including the differences between prokaryotic and eukaryotic organ", "The student will be able to explain the evolutionary relationships between protists and other eukaryotic organisms, including the role of protists in the development of the eukaryotic cell. The student will be able todescribe the biochemical and molecular mechanisms", "The student will be able to identify and describe the morphology and physiology of protists, including their life cycles and reproductive strategies. The student will be able todescribe the ecological roles of protists, including their roles in the environment and in human health", "The student will be able to distinguishthe taxonomy and classification of protists, including the differences between prokaryotic and eukaryotic organisms. The student will be able toexplain the evolutionary relationships between protists and other eukaryotic organisms,", "The student will be able to examine the biochemical and molecular mechanisms that underlie the unique characteristics of protists, including the roles of cellular organelles and the mechanisms of cellular communication.", "The student will be able to evaluate the potential applications of protists in biotechnology and medicine, including the potential for the development of new drugs and therapies.", "The student will be able to assess the potential risks and benefits of the use of protists in biotechnology and medicine, including the potential for the development of new drugs and therapies.", "The student will be able to compare and contrast the different approaches to the study of protists, including the use of molecular and cellular techniques, and the use of ecological and evolutionary approaches.", "The student will be able to apply the principles of microbiology to the study of protists, including the use of microscopy and the use of molecular and cellular techniques."]}]}