{"title": "Nursing", "chapters": [{"title": "Introduction to Nursing", "goals": ["The student will be able to define and explain the role of the nurse in the healthcare team. ", "The student will be able to describe the scope of nursing practice and the role of the nurse in the healthcare team. The student will be able todescribe the scope of nursing practice and the role of the nurse in the healthcare team. The student will be able todescribe the scope", "The student will be able to explain the role of the nurse in the healthcare team. The student will be able todescribe the scope of nursing practice and the role of the nurse in the healthcare team. The student will be able todescribe the scope of nursing practice and the", "The student will be able to identify the role of the nurse in the healthcare team. The student will be able todescribe the scope of nursing practice and the role of the nurse in the healthcare team. The student will be able todescribe the scope of nursing practice and the", "The student will be able to identify the role of the nurse in the healthcare team. The student will be able todescribe the scope of nursing practice and the role of the nurse in the healthcare team. The student will be able todescribe the scope of nursing practice and theThe", "The student will be able to distinguishthe role of the nurse in the healthcare team. The student will be able todescribe the scope of nursing practice and the role of the nurse in the healthcare team. The student will be able todescribe the scope of nursing practice and the", "The student will be able to differentiate the role of the nurse in the healthcare team. The student will be able todescribe the scope of nursing practice and the role of the nurse in the healthcare team. The student will be able todescribe the scope of nursing practice and the", "The student will be able to demonstrate the role of the nurse in the healthcare team. The student will be able todescribe the scope of nursing practice and the role of the nurse in the healthcare team. The student will be able todescribe the scope of nursing practice and theThe", "The student will be able to demonstrate the role of the nurse in the healthcare team. The student will be able todescribe the scope of nursing practice and the role of the nurse in the healthcare team. The student will be able todescribe the scope of nursing practice and theThe", "The student will be able to designate the role of the nurse in the healthcare team. The student will be able todescribe the scope of nursing practice and the role of the nurse in the healthcare team. The student will be able todescribe the scope of nursing practice and"]}, {"title": "The History of Nursing", "goals": ["The student will be able to identify the historical context of nursing and its evolution over time. ", "The student will be able to describe the role of nursing in the development of modern healthcare systems. The student will be able toanalyze the impact of nursing on the development of modern healthcare systems. The student will be able toevaluate the role of nursing in the development of modern healthcare", "The student will be able to evaluate the role of nursing in the development of modern healthcare systems.", "The student will be able to identify the historical context of nursing and its evolution over time. The student will be able todescribe the role of nursing in the development of modern healthcare systems. The student will be able toanalyze the impact of nursing on the development of modern healthcare", "The student will be able to distinguishthe historical context of nursing and its evolution over time. The student will be able todescribe the role of nursing in the development of modern healthcare systems. The student will be able toanalyze the impact of nursing on the development of modern healthcare", "The student will be able to demonstrate the historical context of nursing and its evolution over time. The student will be able todescribe the role of nursing in the development of modern healthcare systems. The student will be able toanalyze the impact of nursing on the development of modern healthcare", "The student will be able to demonstrate the historical context of nursing and its evolution over time. The student will be able todescribe the role of nursing in the development of modern healthcare systems. The student will be able toanalyze the impact of nursing on the development of modern healthcareThe", "The student will be able to differentiate the historical context of nursing and its evolution over time. The student will be able todescribe the role of nursing in the development of modern healthcare systems. The student will be able toanalyze the impact of nursing on the development of modern healthcare", "The student will be able to define the historical context of nursing and its evolution over time. The student will be able todescribe the role of nursing in the development of modern healthcare systems. The student will be able toanalyze the impact of nursing on the development of modern healthcare", "The student will be able to defend the historical context of nursing and its evolution over time. The student will be able todescribe the role of nursing in the development of modern healthcare systems. The student will be able toanalyze the impact of nursing on the development of modern healthcare"]}, {"title": "The Role of the Nurse", "goals": ["The student will be able to define the role of the nurse in the healthcare system. ", "The student will be able to explain the importance of the nurse in the healthcare system. The student will be able todescribe the different types of nurses and their roles in the healthcare system. The student will be able toexplain the importance of the nurse in the healthcare system. The", "The student will be able to describe the different types of nurses and their roles in the healthcare system. The student will be able toexplain the importance of the nurse in the healthcare system. The student will be able todescribe the different types of nurses and their roles in the healthcare", "The student will be able to identify the different types of nurses and their roles in the healthcare system. The student will be able toexplain the importance of the nurse in the healthcare system. The student will be able todescribe the different types of nurses and their roles in the", "The student will be able to identify the different types of nurses and their roles in the healthcare system. The student will be able toexplain the importance of the nurse in the healthcare system. The student will be able todescribe the different types of nurses and their roles in the healthcare", "The student will be able to distinguishthe different types of nurses and their roles in the healthcare system. The student will be able toexplain the importance of the nurse in the healthcare system. The student will be able todescribe the different types of nurses and their roles in the", "The student will be able to differentiate the different types of nurses and their roles in the healthcare system. The student will be able toexplain the importance of the nurse in the healthcare system. The student will be able todescribe the different types of nurses and their roles in the", "The student will be able to demonstrate the different types of nurses and their roles in the healthcare system. The student will be able toexplain the importance of the nurse in the healthcare system. The student will be able todescribe the different types of nurses and their roles in theThe", "The student will be able to demonstrate the different types of nurses and their roles in the healthcare system. The student will be able toexplain the importance of the nurse in the healthcare system. The student will be able todescribe the different types of nurses and their roles in theThe", "The student will be able to designate the different types of nurses and their roles in the healthcare system. The student will be able toexplain the importance of the nurse in the healthcare system. The student will be able todescribe the different types of nurses and their roles in"]}, {"title": "The Education and Training of Nurses", "goals": ["The student will be able to interpret and apply the nursing process in the care of patients. ", "The student will be able to apply critical thinking skills in the assessment, planning, implementation, and evaluation of nursing care. The student will be able toapply the nursing process in the care of patients. The student will be able toapply critical thinking skills in the assessment, planning, implementation", "The student will be able to evaluate nursing care. The student will be able toapply the nursing process in the care of patients. The student will be able toapply critical thinking skills in the assessment, planning, implementation, and evaluation of nursing care.", "The student will be able to demonstrate knowledge of the nursing process in the care of patients.", "The student will be able to demonstrate knowledge of the nursing process in the care of patients.", "The student will be able to differentiate between the nursing process and the medical process.", "The student will be able to distinguishthe nursing process from the medical process.", "The student will be able to describe the nursing process and its importance in the care of patients.", "The student will be able to explain the nursing process and its importance in the care of patients.", "The student will be able to identify the nursing process and its importance in the care of patients."]}, {"title": "The Scope of Nursing Practice", "goals": ["The student will be able to define and describe the scope of nursing practice. ", "The student will be able to identify the role of the nurse in the healthcare team. The student will be able todescribe the nursing process and the importance of critical thinking in nursing practice. The student will be able todescribe the importance of communication and documentation in nursing practice. The", "The student will be able to describe the importance of professionalism and ethical behavior in nursing practice. The student will be able todescribe the importance of cultural competence in nursing practice. The student will be able todescribe the importance of evidence-based practice in nursing practice. The", "The student will be able to identify the importance of continuing education and professional development in nursing practice.", "The student will be able to explain the importance of self-care and self-reflection in nursing practice.", "The student will be able to distinguishthe differences between nursing care and medical care.", "The student will be able to demonstrate the ability to apply critical thinking and problem-solving skills in nursing practice.", "The student will be able to demonstrate the ability to apply the nursing process in a variety of healthcare settings.", "The student will be able to differentiate between the roles and responsibilities of the nurse and other healthcare professionals.", "The student will be able to apply the nursing process in a variety of healthcare settings."]}, {"title": "The Patient-Nurse Relationship", "goals": ["The student will be able to identify the importance of the patient-nurse relationship in the nursing process. ", "The student will be able to describe the role of the nurse in the patient-nurse relationship. The student will be able toexplain the importance of effective communication in the patient-nurse relationship. The student will be able todiscuss the importance of empathy and", "The student will be able to distinguishthe difference between empathy and sympathy. The student will be able todescribe the importance of cultural competence in the patient-nurse relationship. The student will be able toexplain the importance of confidentiality in the patient-n", "The student will be able to identify the importance of the patient-nurse relationship in the nursing process. The student will be able todescribe the role of the nurse in the patient-nurse relationship. The student will be able toexplain the importance of effective", "The student will be able to explain the importance of effective communication in the patient-nurse relationship. The student will be able todiscuss the importance of empathy andThe student will be able todistinguishthe difference between empathy and sympathy. The student will be", "The student will be able to examine the importance of cultural competence in the patient-nurse relationship. The student will be able toexplain the importance of confidentiality in the patient-nurse relationship. The student will be able toidentify the importance of the", "The student will be able to demonstrate the importance of the patient-nurse relationship in the nursing process. The student will be able todescribe the role of the nurse in the patient-nurse relationship. The student will be able toexplain the importance of effective", "The student will be able to demonstrate the importance of effective communication in the patient-nurse relationship. The student will be able todiscuss the importance of empathy andThe student will be able todistinguishthe difference between empathy and sympathy. The student will", "The student will be able to differentiate between empathy and sympathy. The student will be able toexamine the importance of cultural competence in the patient-nurse relationship. The student will be able toexplain the importance of confidentiality in the patient-nurse", "The student will be able to develop the importance of the patient-nurse relationship in the nursing process. The student will be able todescribe the role of the nurse in the patient-nurse relationship. The student will be able toexplain the importance of effective"]}, {"title": "The Nurse's Role in Health Promotion", "goals": ["The student will be able to define health promotion and its importance in the context of nursing. ", "The student will be able to identify the role of the nurse in health promotion. The student will be able todescribe the various strategies and interventions that nurses can use to promote health. The student will be able todiscuss the importance of health promotion in the context of public health", "The student will be able to identify the role of the nurse in health promotion. The student will be able todescribe the various strategies and interventions that nurses can use to promote health. The student will be able todiscuss the importance of health promotion in the context of public health", "The student will be able to distinguishthe role of the nurse in health promotion. The student will be able todescribe the various strategies and interventions that nurses can use to promote health. The student will be able todiscuss the importance of health promotion in the context of public", "The student will be able to describe the various strategies and interventions that nurses can use to promote health. The student will be able todiscuss the importance of health promotion in the context of public health.", "The student will be able to demonstrate an understanding of the role of the nurse in health promotion.", "The student will be able to demonstrate an understanding of the role of the nurse in health promotion.", "The student will be able to differentiate the role of the nurse in health promotion.", "The student will be able to defend the importance of health promotion in the context of public health.", "The student will be able to develop a plan for health promotion in a community setting."]}, {"title": "The Nurse's Role in Disease Prevention", "goals": ["The student will be able to identify the role of the nurse in disease prevention. ", "The student will be able to describe the importance of vaccination and immunization. The student will be able toexplain the role of public health in disease prevention. The student will be able todescribe the importance of health education in disease prevention. The student will be able to", "The student will be able to identify the role of the nurse in disease prevention. The student will be able todescribe the importance of vaccination and immunization. The student will be able toexplain the role of public health in disease prevention. The student will be able", "The student will be able to explain the role of public health in disease prevention. The student will be able todescribe the importance of health education in disease prevention. The student will be able toidentify the role of the nurse in disease prevention. The student will be able to", "The student will be able to distinguishthe role of the nurse in disease prevention.", "The student will be able to demonstrate the role of the nurse in disease prevention.", "The student will be able to demonstrate the role of the nurse in disease prevention.", "The student will be able to differentiate the role of the nurse in disease prevention.", "The student will be able to define the role of the nurse in disease prevention.", "The student will be able to defend the role of the nurse in disease prevention."]}, {"title": "The Nurse's Role in Disease Management", "goals": ["The student will be able to identify the role of the nurse in disease management. ", "The student will be able to describe the process of disease management. The student will be able toexplain the importance of patient education in disease management. The student will be able todiscuss the role of the nurse in promoting health and wellness. The student will be able todesc", "The student will be able to distinguishthe differences between acute and chronic diseases. The student will be able toexplain the importance of early detection and intervention in disease management. The student will be able todescribe the role of the nurse in promoting health and wellness. The", "The student will be able to identify the role of the nurse in disease management. The student will be able todescribe the process of disease management. The student will be able toexplain the importance of patient education in disease management. The student will be able todiscuss the role", "The student will be able to differentiate between acute and chronic diseases. The student will be able toexplain the importance of early detection and intervention in disease management. The student will be able todescribe the role of the nurse in promoting health and wellness.", "The student will be able to explain the importance of early detection and intervention in disease management.", "The student will be able to demonstrate the role of the nurse in promoting health and wellness.", "The student will be able to demonstrate the role of the nurse in promoting health and wellness.", "The student will be able to designate the role of the nurse in promoting health and wellness.", "The student will be able to define the role of the nurse in promoting health and wellness."]}, {"title": "The Nurse's Role in End-of-Life Care", "goals": ["The student will be able to define and discuss the role of the nurse in end-of-life care. ", "The student will be able to identify the physical, emotional, and spiritual needs of the patient and their family. The student will be able todescribe the importance of communication and collaboration with the interdisciplinary team. The student will be able toidentify the importance of the nurse", "The student will be able to identify the importance of the nurse in providing comfort and support to the patient and their family. The student will be able todescribe the importance of the nurse in providing comfort and support to the patient and their family. The student will be able toidentify", "The student will be able to describe the importance of the nurse in providing comfort and support to the patient and their family. The student will be able toidentifyThe student will be able todescribe the importance of the nurse in providing comfort and support to the patient and their family", "The student will be able to distinguishthe importance of the nurse in providing comfort and support to the patient and their family.", "The student will be able to demonstrate the importance of the nurse in providing comfort and support to the patient and their family.", "The student will be able to demonstrate the importance of the nurse in providing comfort and support to the patient and their family.", "The student will be able to differentiate the importance of the nurse in providing comfort and support to the patient and their family.", "The student will be able to defend the importance of the nurse in providing comfort and support to the patient and their family.", "The student will be able to design the importance of the nurse in providing comfort and support to the patient and their family."]}, {"title": "The Nurse's Role in Community Health", "goals": ["The student will be able to identify the role of the nurse in the community health setting. ", "The student will be able to describe the various community health settings in which a nurse may work. The student will be able toexplain the importance of community health nursing in the overall health care system. The student will be able todescribe the various roles and responsibilities of a community", "The student will be able to identify the role of the nurse in the community health setting. The student will be able todescribe the various community health settings in which a nurse may work. The student will be able toexplain the importance of community health nursing in the overall health care", "The student will be able to explain the importance of community health nursing in the overall health care system. The student will be able todescribe the various roles and responsibilities of a community health nurse. The student will be able toidentify the various community health nursing interventions and", "The student will be able to distinguishthe various community health nursing interventions and the various community health nursing interventions and the various community health nursing interventions and the various community health nursing interventions and the various community health nursing interventions and the various community health nursing interventions and the", "The student will be able to differentiate the various community health nursing interventions and the various community health nursing interventions and the various community health nursing interventions and the various community health nursing interventions and the various community health nursing interventions and the various community health nursing interventions and the", "The student will be able to demonstrate the various community health nursing interventions and the various community health nursing interventions and the various community health nursing interventions and the various community health nursing interventions and the various community health nursing interventions and the various community health nursing interventions and the", "The student will be able to demonstrate the various community health nursing interventions and the various community health nursing interventions and the various community health nursing interventions and the various community health nursing interventions and the various community health nursing interventions and the various community health nursing interventions and the", "The student will be able to develop a plan for community health nursing interventions and the various community health nursing interventions and the various community health nursing interventions and the various community health nursing interventions and the various community health nursing interventions and the various community health nursing interventions and", "The student will be able to evaluate the effectiveness of community health nursing interventions and the various community health nursing interventions and the various community health nursing interventions and the various community health nursing interventions and the various community health nursing interventions and the various community health nursing interventions andThe"]}, {"title": "The Nurse's Role in Public Health", "goals": ["The student will be able to define public health and its role in the healthcare system. ", "The student will be able to explain the role of the nurse in public health. The student will be able toidentify the various components of public health and their importance in the healthcare system. The student will be able todescribe the various types of public health interventions and their effectiveness", "The student will be able to identify the various types of public health interventions and their effectiveness. The student will be able toexplain the role of the nurse in public health interventions. The student will be able toidentify the various types of public health interventions and their", "The student will be able to identify the various types of public health interventions and their effectiveness. The student will be able toexplain the role of the nurse in public health interventions.", "The student will be able to describe the various types of public health interventions and their effectiveness.", "The student will be able to evaluate the effectiveness of public health interventions.", "The student will be able to distinguishthe various types of public health interventions and their effectiveness.", "The student will be able to assess the role of the nurse in public health interventions.", "The student will be able to compare and contrast the various types of public health interventions and their effectiveness.", "The student will be able to demonstrate the role of the nurse in public health interventions."]}, {"title": "The Nurse's Role in Disaster Preparedness and Response", "goals": ["The student will be able to identify the role of the nurse in disaster preparedness and response. ", "The student will be able to describe the different types of disasters and the potential impact on the community. The student will be able toexplain the importance of disaster preparedness and response. The student will be able todescribe the different types of emergency response systems and the role of", "The student will be able to explain the importance of disaster preparedness and response. The student will be able todescribe the different types of emergency response systems and the role of the nurse in each system. The student will be able todescribe the different types of emergency response systems", "The student will be able to identify the role of the nurse in each system. The student will be able todescribe the different types of emergency response systems and the role of the nurse in each system. The student will be able toidentify the role of the nurse in each", "The student will be able to distinguishe between the different types of emergency response systems and the role of the nurse in each system. The student will be able toidentify the role of the nurse in each system.", "The student will be able to differentiate between the different types of emergency response systems and the role of the nurse in each system.", "The student will be able to demonstrate the ability to identify the role of the nurse in each system.", "The student will be able to demonstrate the ability to differentiate between the different types of emergency response systems and the role of the nurse in each system.", "The student will be able to develop a plan for disaster preparedness and response.", "The student will be able to design a plan for disaster preparedness and response."]}, {"title": "The Nurse's Role in Research and Evidence-Based Practice", "goals": ["The student will be able to define and explain the role of the nurse in research and evidence-based practice. ", "The student will be able to identify the importance of research and evidence-based practice in nursing. The student will be able todescribe the process of evidence-based practice. The student will be able toidentify the importance of research and evidence-based practice in nursing. The student", "The student will be able to identify the importance of research and evidence-based practice in nursing. The student will be able todescribe the process of evidence-based practice. The student will be able toidentify the importance of research and evidence-based practice in nursing. The student", "The student will be able to describe the process of evidence-based practice. The student will be able toidentify the importance of research and evidence-based practice in nursing. The student will be able todescribe the process of evidence-based practice. The student will be able to", "The student will be able to explain the role of the nurse in research and evidence-based practice. The student will be able toidentify the importance of research and evidence-based practice in nursing. The student will be able todescribe the process of evidence-based practice.", "The student will be able to examine the role of the nurse in research and evidence-based practice. The student will be able toidentify the importance of research and evidence-based practice in nursing. The student will be able todescribe the process of evidence-based practice.", "The student will be able to evaluate the role of the nurse in research and evidence-based practice. The student will be able toidentify the importance of research and evidence-based practice in nursing. The student will be able todescribe the process of evidence-based practice.", "The student will be able to assess the role of the nurse in research and evidence-based practice. The student will be able toidentify the importance of research and evidence-based practice in nursing. The student will be able todescribe the process of evidence-based practice.", "The student will be able to applying the role of the nurse in research and evidence-based practice. The student will be able toidentify the importance of research and evidence-based practice in nursing. The student will be able todescribe the process of evidence-based practice.", "The student will be able to implement the role of the nurse in research and evidence-based practice. The student will be able toidentify the importance of research and evidence-based practice in nursing. The student will be able todescribe the process of evidence-based practice."]}]}