{"title": "Trigonometry", "chapters": [{"title": "Introduction to Trigonometry", "goals": ["The student will be able to define and use the basic terms and concepts of trigonometry, including angles, arcs, radii, and circumferences. They will also be able to understand the basic principles of trigonometry, including the properties of triangles,", "The student will be able to apply the basic principles of trigonometry to solve problems involving angles, arcs, radii, and circumferences. They will also be able to understand the basic principles of trigonometry, including the properties of triangles, and the", "The student will be able to use the basic principles of trigonometry to solve problems involving angles, arcs, radii, and circumferences. They will also be able to understand the basic principles of trigonometry, including the properties of triangles, and the", "The student will be able to solve problems involving angles, arcs, radii, and circumferences using the basic principles of trigonometry. They will also be able to understand the basic principles of trigonometry, including the properties of triangles, and theThe", "The student will be able to summarizethe basic principles of trigonometry, including the properties of triangles, and theThe student will be able tosummarize the basic principles of trigonometry, including the properties of triangles, and theThe student will be able", "The student will be able to describe the basic principles of trigonometry, including the properties of triangles, and theThe student will be able todescribe the basic principles of trigonometry, including the properties of triangles, and theThe student will be able", "The student will be able to explain the basic principles of trigonometry, including the properties of triangles, and theThe student will be able toexplain the basic principles of trigonometry, including the properties of triangles, and theThe student will be able", "The student will be able to distinguishthe basic principles of trigonometry, including the properties of triangles, and theThe student will be able todistinguish the basic principles of trigonometry, including the properties of triangles, and theThe student will be", "The student will be able to identify the basic principles of trigonometry, including the properties of triangles, and theThe student will be able toidentify the basic principles of trigonometry, including the properties of triangles, and theThe student will be ableThe", "The student will be able to identify the basic principles of trigonometry, including the properties of triangles, and theThe student will be able toidentify the basic principles of trigonometry, including the properties of triangles, and theThe student will be able"]}, {"title": "Basic Concepts and Notation", "goals": ["The student will be able to define and use the basic concepts and notation of trigonometry. ", "The student will be able to use the basic concepts and notation of trigonometry to solve problems. The student will be able touse the basic concepts and notation of trigonometry to solve problems. The student will be able touse the basic concepts and notation of tr", "The student will be able to apply the basic concepts and notation of trigonometry to solve problems. The student will be able toapply the basic concepts and notation of trigonometry to solve problems. The student will be able toapply the basic concepts and notation of tr", "The student will be able to solve problems using the basic concepts and notation of trigonometry. The student will be able tosolve problems using the basic concepts and notation of trigonometry. The student will be able tosolve problems using the basic concepts and notation", "The student will be able to summarizethe basic concepts and notation of trigonometry. The student will be able tosummarizethe basic concepts and notation of trigonometry. The student will be able tosummarizethe basic concepts and notation of trigonometry", "The student will be able to describe the basic concepts and notation of trigonometry. The student will be able todescribe the basic concepts and notation of trigonometry. The student will be able todescribe the basic concepts and notation of trigonometry.", "The student will be able to identify the basic concepts and notation of trigonometry. The student will be able toidentify the basic concepts and notation of trigonometry. The student will be able toidentify the basic concepts and notation of trigonometry.", "The student will be able to identify the basic concepts and notation of trigonometry. The student will be able toidentify the basic concepts and notation of trigonometry. The student will be able toidentify the basic concepts and notation of trigonometry. The", "The student will be able to explain the basic concepts and notation of trigonometry. The student will be able toexplain the basic concepts and notation of trigonometry. The student will be able toexplain the basic concepts and notation of trigonometry.", "The student will be able to distinguishthe basic concepts and notation of trigonometry. The student will be able todistinguishthe basic concepts and notation of trigonometry. The student will be able todistinguishthe basic concepts and notation of tr"]}, {"title": "Angles and Sines", "goals": ["The student will be able to define and understand the concept of angles and sines. They will be able to identify the different types of angles and their relationships to the sines. They will also be able to apply the concept of sines in solving problems related to angles.", "The student will be able to identify and understand the concept of angles and their relationships to the sines. They will be able to apply the concept of sines in solving problems related to angles.", "The student will be able to identify and understand the concept of angles and their relationships to the sines. They will be able to apply the concept of sines in solving problems related to angles.", "The student will be able to apply the concept of sines in solving problems related to angles.", "The student will be able to use the concept of sines in solving problems related to angles.", "The student will be able to explain the concept of angles and their relationships to the sines.", "The student will be able to solve problems related to angles using the concept of sines.", "The student will be able to state the concept of angles and their relationships to the sines.", "The student will be able to summarizethe concept of angles and their relationships to the sines.", "The student will be able to select the concept of angles and their relationships to the sines."]}, {"title": "Angles and Cosines", "goals": ["The student will be able to identify the basic concepts of trigonometry, including the definition of a triangle, the definition of a circle, and the definition of a line. They will also be able to understand the concept of a circle, including its center, its radius, and", "The student will be able to identify the basic concepts of trigonometry, including the definition of a triangle, the definition of a circle, and the definition of a line. They will also be able to understand the concept of a circle, including its center, its radius, and", "The student will be able to apply the basic concepts of trigonometry, including the definition of a triangle, the definition of a circle, and the definition of a line. They will also be able to understand the concept of a circle, including its center, its radius,", "The student will be able to use the basic concepts of trigonometry, including the definition of a triangle, the definition of a circle, and the definition of a line. They will also be able to understand the concept of a circle, including its center, its radius,", "The student will be able to explain the basic concepts of trigonometry, including the definition of a triangle, the definition of a circle, and the definition of a line. They will also be able to understand the concept of a circle, including its center, its radius,", "The student will be able to describe the basic concepts of trigonometry, including the definition of a triangle, the definition of a circle, and the definition of a line. They will also be able to understand the concept of a circle, including its center, its radius,", "The student will be able to define the basic concepts of trigonometry, including the definition of a triangle, the definition of a circle, and the definition of a line. They will also be able to understand the concept of a circle, including its center, its radius,The", "The student will be able to distinguishthe basic concepts of trigonometry, including the definition of a triangle, the definition of a circle, and the definition of a line. They will also be able to understand the concept of a circle, including its center, its radius,", "The student will be able to demonstrate the basic concepts of trigonometry, including the definition of a triangle, the definition of a circle, and the definition of a line. They will also be able to understand the concept of a circle, including its center, its radius,", "The student will be able to demonstrate the basic concepts of trigonometry, including the definition of a triangle, the definition of a circle, and the definition of a line. They will also be able to understand the concept of a circle, including its center, its radius,The"]}, {"title": "Angles and Tangents", "goals": ["The student will be able to identify and apply the basic principles of trigonometry, including the definition of sine, cosine, and tangent, and the properties of the unit circle. They will also be able to apply the basic trigonometric formulas, including", "The student will be able to identify and apply the basic principles of trigonometry, including the definition of sine, cosine, and tangent, and the properties of the unit circle. They will also be able to apply the basic trigonometric formulas, including", "The student will be able to apply the basic principles of trigonometry, including the definition of sine, cosine, and tangent, and the properties of the unit circle. They will also be able to apply the basic trigonometric formulas, includingThe", "The student will be able to use the basic principles of trigonometry, including the definition of sine, cosine, and tangent, and the properties of the unit circle. They will also be able to use the basic trigonometric formulas, includingThe", "The student will be able to explain the basic principles of trigonometry, including the definition of sine, cosine, and tangent, and the properties of the unit circle. They will also be able to use the basic trigonometric formulas, includingThe", "The student will be able to describe the basic principles of trigonometry, including the definition of sine, cosine, and tangent, and the properties of the unit circle. They will also be able to use the basic trigonometric formulas, includingThe", "The student will be able to define the basic principles of trigonometry, including the definition of sine, cosine, and tangent, and the properties of the unit circle. They will also be able to use the basic trigonometric formulas, including", "The student will be able to list the basic principles of trigonometry, including the definition of sine, cosine, and tangent, and the properties of the unit circle.", "The student will be able to state the basic principles of trigonometry, including the definition of sine, cosine, and tangent, and the properties of the unit circle.", "The student will be able to recite the basic principles of trigonometry, including the definition of sine, cosine, and tangent, and the properties of the unit circle."]}, {"title": "Angles and Secants", "goals": ["The student will be able to identify and use the basic definitions and properties of angles and secants. They will be able to apply these definitions and properties to solve problems involving angles and secants. They will also be able to use the basic definitions and properties of angles and secants to", "The student will be able to identify and use the basic definitions and properties of angles and secants. They will be able to apply these definitions and properties to solve problems involving angles and secants. They will also be able to use the basic definitions and properties of angles and secants to", "The student will be able to apply the basic definitions and properties of angles and secants to solve problems involving angles and secants. They will also be able to use the basic definitions and properties of angles and secants toThe student will be able toapply the basic definitions and properties", "The student will be able to use the basic definitions and properties of angles and secants to solve problems involving angles and secants. They will also be able to use the basic definitions and properties of angles and secants toThe student will be able touse the basic definitions and properties", "The student will be able to solve problems involving angles and secants using the basic definitions and properties of angles and secants.", "The student will be able to summarizethe basic definitions and properties of angles and secants.", "The student will be able to select and apply the appropriate definitions and properties of angles and secants to solve problems involving angles and secants.", "The student will be able to explain the basic definitions and properties of angles and secants.", "The student will be able to demonstrate the basic definitions and properties of angles and secants.", "The student will be able to demonstrate the basic definitions and properties of angles and secants."]}, {"title": "Angles and Cosecants", "goals": ["The student will be able to identify and use the basic properties of angles and cosecants. They will be able to apply the basic properties of angles and cosecants to solve problems. They will also be able to use the basic properties of angles and cosecants", "The student will be able to identify and use the basic properties of angles and cosecants. They will be able to apply the basic properties of angles and cosecants to solve problems. They will also be able to use the basic properties of angles and cosecants", "The student will be able to use the basic properties of angles and cosecants to solve problems.", "The student will be able to apply the basic properties of angles and cosecants to solve problems.", "The student will be able to solve problems using the basic properties of angles and cosecants.", "The student will be able to summarizethe basic properties of angles and cosecants.", "The student will be able to explain the basic properties of angles and cosecants.", "The student will be able to define the basic properties of angles and cosecants.", "The student will be able to describe the basic properties of angles and cosecants.", "The student will be able to list the basic properties of angles and cosecants."]}, {"title": "The Law of Sines", "goals": ["The student will be able to apply the Law of Sines in solving for the missing sides and angles in a triangle. The student will be able to apply the Law of Sines in solving for the missing sides and angles in a triangle. The student will be able to apply the Law", "The student will be able to use the Law of Sines in solving for the missing sides and angles in a triangle. The student will be able touse the Law of Sines in solving for the missing sides and angles in a triangle.", "The student will be able to explain the Law of Sines and its applications in solving for the missing sides and angles in a triangle.", "The student will be able to identify the Law of Sines and its applications in solving for the missing sides and angles in a triangle.", "The student will be able to identify the Law of Sines and its applications in solving for the missing sides and angles in a triangle.", "The student will be able to describe the Law of Sines and its applications in solving for the missing sides and angles in a triangle.", "The student will be able to define the Law of Sines and its applications in solving for the missing sides and angles in a triangle.", "The student will be able to demonstrate the Law of Sines and its applications in solving for the missing sides and angles in a triangle.", "The student will be able to demonstrate the Law of Sines and its applications in solving for the missing sides and angles in a triangle.", "The student will be able to differentiate the Law of Sines and its applications in solving for the missing sides and angles in a triangle."]}, {"title": "The Law of Cosines", "goals": ["The student will be able to apply the Law of Cosines to solve for the length of a side of a triangle, given the lengths of the other two sides and the angle between them. The student will also be able to apply the Law of Cosines to solve for the angle between", "The student will be able to solve for the angle between two sides of a triangle, given the lengths of the other two sides and the angle between them. The student will be able tosolve for the angle between two sides of a triangle, given the lengths of the other two", "The student will be able to states of the Law of Cosines to solve for the angle between two sides of a triangle, given the lengths of the other two sides and the angle between them. The student will be able tosolve for the angle between two sides of a triangle", "The student will be able to select the Law of Cosines to solve for the angle between two sides of a triangle, given the lengths of the other two sides and the angle between them.", "The student will be able to summarize the Law of Cosines as a formula that can be used to solve for the angle between two sides of a triangle, given the lengths of the other two sides and the angle between them.", "The student will be able to use the Law of Cosines to solve for the angle between two sides of a triangle, given the lengths of the other two sides and the angle between them.", "The student will be able to explain the Law of Cosines as a formula that can be used to solve for the angle between two sides of a triangle, given the lengths of the other two sides and the angle between them.", "The student will be able to describe the Law of Cosines as a formula that can be used to solve for the angle between two sides of a triangle, given the lengths of the other two sides and the angle between them.", "The student will be able to define the Law of Cosines as a formula that can be used to solve for the angle between two sides of a triangle, given the lengths of the other two sides and the angle between them.", "The student will be able to identify the Law of Cosines as a formula that can be used to solve for the angle between two sides of a triangle, given the lengths of the other two sides and the angle between them."]}, {"title": "The Law of Tangents", "goals": ["The student will be able to apply the Law of Tangents to solve problems involving the angles of a triangle. The student will be able to apply the Law of Tangents to solve problems involving the angles of a triangle.", "The student will be able to use the Law of Tangents to solve problems involving the angles of a triangle.", "The student will be able to explain the Law of Tangents and its application in solving problems involving the angles of a triangle.", "The student will be able to identify the Law of Tangents and its application in solving problems involving the angles of a triangle.", "The student will be able to identify the Law of Tangents and its application in solving problems involving the angles of a triangle.", "The student will be able to describe the Law of Tangents and its application in solving problems involving the angles of a triangle.", "The student will be able to define the Law of Tangents and its application in solving problems involving the angles of a triangle.", "The student will be able to demonstrate the Law of Tangents and its application in solving problems involving the angles of a triangle.", "The student will be able to demonstrate the Law of Tangents and its application in solving problems involving the angles of a triangle.", "The student will be able to differentiate the Law of Tangents and its application in solving problems involving the angles of a triangle."]}, {"title": "The Law of Secants", "goals": ["The student will be able to apply the Law of Secants to find the value of a sine or cosine of a given angle in a right triangle. The student will be able to apply the Law of Secants to find the value of a sine or cosine of a", "The student will be able to use the Law of Secants to find the value of a sine or cosine of a given angle in a right triangle. The student will be able touse the Law of Secants to find the value of a sine or cosine of", "The student will be able to identify the relationship between the sine and cosine of complementary angles. The student will be able toidentify the relationship between the sine and cosine of complementary angles. The student will be able toidentify the relationship between the s", "The student will be able to identify the relationship between the sine and cosine of complementary angles. The student will be able toidentify the relationship between the sine and cosine of complementary angles. The student will be able toidentify the relationship between the sine", "The student will be able to describe the relationship between the sine and cosine of complementary angles. The student will be able todescribe the relationship between the sine and cosine of complementary angles. The student will be able todescribe the relationship between the s", "The student will be able to explain the relationship between the sine and cosine of complementary angles. The student will be able toexplain the relationship between the sine and cosine of complementary angles. The student will be able toexplain the relationship between the s", "The student will be able to define the sine and cosine of complementary angles. The student will be able todefine the sine and cosine of complementary angles. The student will be able todefine the sine and cosine of complementary angles. The student", "The student will be able to demonstrate the sine and cosine of complementary angles. The student will be able todemonstrate the sine and cosine of complementary angles. The student will be able todemonstrate the sine and cosine of", "The student will be able to demonstrate the sine and cosine of complementary angles. The student will be able todemonstrate the sine and cosine of complementary angles. The student will be able todemonstrate the sine and cosine of complement", "The student will be able to differentiate between the sine and cosine of complementary angles. The student will be able todifferentiate between the sine and cosine of complementary angles. The student will be able todifferentiate between the sine and"]}, {"title": "The Law of Cosecants", "goals": ["The student will be able to apply the Law of Cosecants to solve for the unknown angle in a right triangle. The student will be able to apply the Law of Sines to solve for the unknown angle in a triangle. The student will be able to apply the Law of", "The student will be able to use the Law of Cosines to solve for the unknown side of a triangle. The student will be able to use the Law of Cosines to solve for the unknown side of a triangle. The student will be able to use the Law of Cosines", "The student will be able to solve for the unknown side of a triangle. The student will be able to use the Law of Cosines to solve for the unknown side of a triangle. The student will be able to use the Law of Cosines to solve for the unknown side of", "The student will be able to summarizethe Law of Cosines. The student will be able to summarize the Law of Cosines. The student will be able to use the Law of Cosines to solve for the unknown side of a triangle. The student will be able to use the", "The student will be able to state the Law of Cosines. The student will be able to use the Law of Cosines to solve for the unknown side of a triangle. The student will be able to use the Law of Cosines to solve for the unknown side of a triangle", "The student will be able to define the Law of Cosines. The student will be able to use the Law of Cosines to solve for the unknown side of a triangle. The student will be able to use the Law of Cosines to solve for the unknown side of a triangle", "The student will be able to describe the Law of Cosines. The student will be able to use the Law of Cosines to solve for the unknown side of a triangle. The student will be able to use the Law of Cosines to solve for the unknown side of a triangle", "The student will be able to identify the Law of Cosines. The student will be able to use the Law of Cosines to solve for the unknown side of a triangle. The student will be able to use the Law of Cosines to solve for the unknown side of a triangle", "The student will be able to explain the Law of Cosines. The student will be able to use the Law of Cosines to solve for the unknown side of a triangle. The student will be able to use the Law of Cosines to solve for the unknown side of a triangle", "The student will be able to identify the Law of Cosines. The student will be able to use the Law of Cosines to solve for the unknown side of a triangle. The student will be able to use the Law of Cosines to solve for the unknown side of a triangle"]}, {"title": "Trigonometric Identities", "goals": ["The student will be able to identify and use the basic trigonometric identities, including the Pythagorean identity, the identity for cosine, and the identity for sine. The student will be able to use these identities to solve problems involving trigon", "The student will be able to use the basic trigonometric identities to solve problems involving trigonometry.", "The student will be able to apply the basic trigonometric identities to solve problems involving trigonometry.", "The student will be able to identify and use the basic trigonometric identities to solve problems involving trigonometry.", "The student will be able to solve problems involving trigonometry using the basic trigonometric identities.", "The student will be able to summarizethe basic trigonometric identities and their applications in solving problems involving trigonometry.", "The student will be able to state the basic trigonometric identities and their applications in solving problems involving trigonometry.", "The student will be able to describe the basic trigonometric identities and their applications in solving problems involving trigonometry.", "The student will be able to define the basic trigonometric identities and their applications in solving problems involving trigonometry.", "The student will be able to list the basic trigonometric identities and their applications in solving problems involving trigonometry."]}, {"title": "Trigonometric Equations", "goals": ["The student will be able to identify and solve trigonometric equations, including those involving the sine, cosine, and tangent functions. The student will also be able to apply the properties of trigonometric functions, such as the sum-to-product and product", "The student will be able to apply the properties of trigonometric functions, such as the sum-to-product and product-to-sum formulas, as well as the double-angle and half-angle formulas. The student will be able tosolve trig", "The student will be able to solve trigonometric equations involving the sine, cosine, and tangent functions, as well as their inverses. The student will also be able to apply the properties of trigonometric functions, such as the sum-to", "The student will be able to summarizethe properties of trigonometric functions, such as the sum-to-product and product-to-sum formulas, as well as the double-angle and half-angle formulas. The student will be able tosolve trig", "The student will be able to select and apply the appropriate trigonometric functions and their inverses to solve problems involving angles and lengths in triangles and other geometric shapes.", "The student will be able to statements of trigonometric functions and their inverses to solve problems involving angles and lengths in triangles and other geometric shapes.", "The student will be able to use the properties of trigonometric functions, such as the sum-to-product and product-to-sum formulas, as well as the double-angle and half-angle formulas, to solve problems involving angles and lengths in tri", "The student will be able to identify and solve trigonometric equations involving the sine, cosine, and tangent functions, as well as their inverses. The student will also be able to apply the properties of trigonometric functions, such as the sum", "The student will be able to describe the properties of trigonometric functions, such as the sum-to-product and product-to-sum formulas, as well as the double-angle and half-angle formulas. The student will be able tosolve tr", "The student will be able to define and apply the appropriate trigonometric functions and their inverses to solve problems involving angles and lengths in triangles and other geometric shapes."]}]}