{"title": "Developmental psychology", "key": "Developmental_psychology", "summary": "{{short description|Scientific study of psychological changes in humans over the course of their lives}}\n{{For|the journal|Developmental Psychology (journal)}}\n{{redirect|Child psychology|the Black Box Recorder song|Child Psychology (song)}}\n{{Psychology sidebar|basic}}\n[[File:Baby.jpg|thumb|Special methods are used in the psychological study of infants.]]\n[[File:Conservation2.jpeg|thumb|Piaget's test for [[Conservation (psychology)|Conservation]]. One of the many experiments used for children.]]\n'''Developmental psychology''' is the [[science|scientific]] study of how and why [[human]]s grow, change, and adapt across the course of their lives. Originally concerned with [[infants]] and [[child]]ren, the field has expanded to include [[adolescence]], [[adult development]], [[aging]], and the entire lifespan.<ref>{{Cite journal | vauthors = Graber JA, Brooks-Gunn J |date=1996 |title=Transitions and turning points: Navigating the passage from childhood through adolescence. |url=http://dx.doi.org/10.1037/0012-1649.32.4.768 |journal=Developmental Psychology |volume=32 |issue=4 |pages=768–776 |doi=10.1037/0012-1649.32.4.768 |issn=1939-0599}}</ref> Developmental psychologists aim to explain how thinking, feeling, and behaviors change throughout life. This field examines change<ref name=\":0\">{{Citation |last=Tau |first=Ramiro |title=Possible in Human Development |date=2022 |url=https://link.springer.com/10.1007/978-3-319-98390-5_252-1 |encyclopedia=The Palgrave Encyclopedia of the Possible |pages=1–8 |place=Cham |publisher=Springer International Publishing |language=en |doi=10.1007/978-3-319-98390-5_252-1 |isbn=978-3-319-98390-5 |access-date=2022-08-28}}</ref> across three major dimensions, which are [[physical development]], [[cognitive development]], and [[social emotional development]].<ref>{{Cite web|url=http://www.apa.org/action/science/developmental/index.aspx|title=Developmental Psychology Studies Human Development Across the Lifespan|work = American Psychological Association |language=en|archive-url=https://web.archive.org/web/20140709054242/http://www.apa.org/action/science/developmental/index.aspx|archive-date=2014-07-09|url-status=dead|access-date=2017-08-28}}</ref><ref>{{Cite book| vauthors = Burman E |title=Deconstructing Developmental Psychology|publisher=Routledge|year=2017|isbn=978-1-138-84695-1|location=New York, NY}}</ref> Within these three dimensions are a broad range of topics including [[motor skills]], [[executive functions]], [[morality|moral understanding]], [[language acquisition]], [[social change]], [[personality]], emotional development, [[self-concept]], and [[identity formation]].\n\nDevelopmental psychology examines the influences of nature ''and'' nurture on the process of human development, as well as processes of change in context across time. Many researchers are interested in the interactions among personal characteristics, the individual's behavior, and [[environmental factor]]s. This includes the [[social context]] and the [[built environment]]. Ongoing debates in regards to developmental psychology include biological [[essentialism]] vs. [[neuroplasticity]] and [[Developmental stage theories|stages of development]] vs. dynamic systems of development. Research in developmental psychology has some limitations but at the moment researchers are working to understand how transitioning through stages of life and biological factors may impact our behaviors and development''.''<ref>{{cite journal | vauthors = Kobak R, Abbott C, Zisk A, Bounoua N | title = Adapting to the changing needs of adolescents: parenting practices and challenges to sensitive attunement | journal = Current Opinion in Psychology | volume = 15 | pages = 137–142 | date = June 2017 | pmid = 28813254 | pmc = 5886742 | doi = 10.1016/j.copsyc.2017.02.018 }}</ref>\n\nDevelopmental psychology involves a range of fields,<ref name=\":0\" /> such as [[educational psychology]], [[child psychopathology]], [[forensic developmental psychology]], [[child development]], [[cognitive psychology]], [[ecological psychology]], and [[cultural psychology]]. Influential developmental psychologists from the 20th century include [[Urie Bronfenbrenner]], [[Erik Erikson]], [[Sigmund Freud]], [[Anna Freud]], [[Jean Piaget]], [[Barbara Rogoff]], [[Esther Thelen]], and [[Lev Vygotsky]].<ref>{{cite book | vauthors = Brown C |chapter=Developmental Psychology and Related Disciplines/Theories |title=Developmental Psychology |year=2008 |pages=7 |location=London |publisher=SAGE Publications Ltd |doi=10.4135/9781446214633.n3 |isbn=9781412934664 }}</ref>\n\n", "sections": [{"title": "Theories", "content": "===Psychosexual development===\n{{Main|Psychosexual development}}\n[[Sigmund Freud]] developed a theory that suggested that humans behave as they do because they are constantly seeking pleasure. This process of seeking pleasure changes through stages because people evolve. Each period of seeking pleasure that a person experiences is represented by a stage of psychosexual development. These stages symbolize the process of arriving to become a maturing adult.<ref>{{Citation| vauthors = Lantz SE, Ray S |title=Freud Developmental Theory |date=2022 |url=http://www.ncbi.nlm.nih.gov/books/NBK557526/ |work=StatPearls|place=Treasure Island (FL)|publisher=StatPearls Publishing|pmid=32491458|access-date=2022-02-12}}</ref>\n\nThe first is the ''oral stage'', which begins at birth and ends around a year and a half of age. During the oral stage, the child finds pleasure in behaviors like sucking or other behaviors with the mouth. The second is the ''anal stage'', from about a year or a year and a half to three years of age. During the anal stage, the child defecates from the anus and is often fascinated with its defecation. This period of development often occurs during the time when the child is being toilet trained. The child becomes interested with feces and urine. Children begin to see themselves as independent from their parents. They begin to desire assertiveness and autonomy.\n\nThe third is the ''[[phallic stage]]'', which occurs from three to five years of age (most of a person's personality forms by this age). During the phallic stage, the child becomes aware of its sexual organs. Pleasure comes from finding acceptance and love from the opposite sex. The fourth is the ''latency stage'', which occurs from age five until puberty. During the latency stage, the child's sexual interests are repressed.\n\nStage five is the ''[[genital stage]]'', which takes place from puberty until adulthood. During the genital stage, puberty begins to occur.<ref>{{cite web| vauthors = McLeod S |title=Psychosexual Stages|url=http://www.simplypsychology.org/psychosexual.html|url-status=dead|archive-url=https://web.archive.org/web/20141219093455/http://www.simplypsychology.org/psychosexual.html|archive-date=2014-12-19|access-date=2014-11-10|website=SimplyPsychology}}</ref> Children have now matured, and begin to think about other people instead of just themselves. Pleasure comes from feelings of affection from other people.\n\nFreud believed there is tension between the conscious and unconscious because the conscious tries to hold back what the unconscious tries to express. To explain this, he developed three personality structures: id, ego, and superego. The id, the most primitive of the three, functions according to the pleasure principle: seek pleasure and avoid pain.<ref name=\"Theories2\">{{cite book|title=Theories of personality: understanding persons| vauthors = Cloninger SC |date=29 June 2012|publisher=Pearson Education|isbn=978-0-205-25624-2|edition=6th|location=Boston|pages=19–101}}</ref> The superego plays the critical and moralizing role, while the ego is the organized, realistic part that mediates between the desires of the id and the superego.<ref name=\"Snowden2\">{{cite book|title=Teach Yourself Freud| vauthors = Snowden R |publisher=[[McGraw-Hill]]|year=2006|isbn=978-0-07-147274-6|pages=105–107}}</ref>\n\n===Theories of cognitive development===\n{{Main|Piaget's theory of cognitive development}}\n[[Jean Piaget]], a Swiss theorist, posited that children learn by actively constructing knowledge through their interactions with their physical and social environments.<ref name=\"WoodWoodBoyd2\">{{Cite book|title=Mastering the world of psychology|publisher=Allyn & Bacon|year=2006|edition=2| vauthors = Wood SE, Wood CE, Boyd D }}</ref> He suggested that the adult's role in helping the child learn was to provide appropriate materials. In his interview techniques with children that formed an empirical basis for his theories, he used something similar to [[Socratic questioning]] to get children to reveal their thinking. He argued that a principal source of development was through the child's inevitable generation of contradictions through their interactions with their physical and social worlds. The child's resolution of these contradictions led to more integrated and advanced forms of interaction, a developmental process that he called, \"equilibration.\" \n\nPiaget argued that intellectual development takes place through a series of stages generated through the equilibration process. Each stage consists of steps the child must master before moving to the next step. He believed that these stages are not separate from one another, but rather that each stage builds on the previous one in a continuous learning process. He proposed four stages: ''sensorimotor'', ''pre-operational'', ''concrete operational'', and ''formal operational''. Though he did not believe these stages occurred at any given age, many studies have determined when these cognitive abilities should take place.<ref name=\"Edpsych24\">{{cite book|title=Edpsych : modules| vauthors = Reese-Weber L, Bohlin CC, Durwin M |publisher=McGraw-Hill Humanities/Social Sciences/Languages|isbn=978-0-07-809786-7|edition=2nd|location=New York|pages=30–132|date=2011-12-06}}</ref>\n\n===Stages of moral development===\n{{Main|Lawrence Kohlberg's stages of moral development}}\nPiaget claimed that logic and morality develop through constructive stages.<ref name=\"higheststage2\">{{cite journal| vauthors = Kohlberg L |year=1973|title=The Claim to Moral Adequacy of a Highest Stage of Moral Judgment|journal=Journal of Philosophy|publisher=The Journal of Philosophy |volume=70|issue=18|pages=630–646|doi=10.2307/2025030|jstor=2025030}}</ref> Expanding on Piaget's work, [[Lawrence Kohlberg]] determined that the process of moral development was principally concerned with justice, and that it continued throughout the individual's lifetime.<ref name=\"dissertation2\">{{cite thesis| vauthors = Kohlberg L |year=1958 |title=The Development of Modes of Thinking and Choices in Years 10 to 16|degree = Ph.D. | publisher = University of Chicago}}</ref>\n\nHe suggested three levels of moral reasoning; pre-conventional moral reasoning, conventional moral reasoning, and post-conventional moral reasoning. The pre-conventional moral reasoning is typical of children and is characterized by reasoning that is based on rewards and punishments associated with different courses of action. Conventional moral reason occurs during late childhood and early adolescence and is characterized by reasoning based on rules and conventions of society. Lastly, post-conventional moral reasoning is a stage during which the individual sees society's rules and conventions as relative and subjective, rather than as authoritative.<ref name=\"Adolescence3\">{{cite book|title=Adolescence| vauthors = Steinberg L |publisher=McGraw-Hill Higher Education|year=2008|isbn=978-0-07-340548-3|edition=8th|location=Boston|pages=60–365|author-link=Laurence Steinberg}}</ref>\n\nKohlberg used the Heinz Dilemma to apply to his stages of moral development. The Heinz Dilemma involves Heinz's wife dying from cancer and Heinz having the dilemma to save his wife by stealing a drug. Preconventional morality, conventional morality, and post-conventional morality applies to Heinz's situation.<ref>{{cite journal |url=http://www.simplypsychology.org/kohlberg.html |title=Kohlberg | journal=SimplyPsychology | vauthors = McLeod S |year=2013 }}</ref>\n\n===Stages of psychosocial development===\n{{Main|Erikson's stages of psychosocial development}}German-American psychologist [[Erik Erikson]] and his collaborator and wife, [[Joan Erikson]], posits eight stages of individual human development influenced by biological, psychological, and social factors throughout the lifespan.''<ref name =Orenstein>{{Citation | vauthors = Orenstein GA, Lewis L |title=Eriksons Stages of Psychosocial Development |date=2022 |url=http://www.ncbi.nlm.nih.gov/books/NBK556096/ |work=StatPearls |place=Treasure Island (FL) |publisher=StatPearls Publishing |pmid=32310556 |access-date=2022-06-23 }}</ref>'' At each stage the person must resolve a challenge, or an existential dilemma. Successful resolution of the dilemma results in the person ingraining a positive virtue, but failure to resolve the fundamental challenge of that stage reinforces negative perceptions of the person or the world around them and the person's personal development is unable to progress.<ref name =\"Orenstein\"/>\nThe first stage, \"Trust vs. Mistrust\", takes place in infancy. The positive virtue for the first stage is hope, in the infant learning whom to trust and having hope for a supportive group of people to be there for him/her. The second stage is \"Autonomy vs. Shame and Doubt\" with the positive virtue being will. This takes place in early childhood when the child learns to become more independent by discovering what they are capable of whereas if the child is overly controlled, feelings of inadequacy are reinforced, which can lead to low self-esteem and doubt.\n\nThe third stage is \"Initiative vs. Guilt\". The virtue of being gained is a sense of purpose. This takes place primarily via play. This is the stage where the child will be curious and have many interactions with other kids. They will ask many questions as their curiosity grows. If too much guilt is present, the child may have a slower and harder time interacting with their world and other children in it.\n\nThe fourth stage is \"Industry (competence) vs. Inferiority\". The virtue for this stage is competency and is the result of the child's early experiences in school. This stage is when the child will try to win the approval of others and understand the value of their accomplishments.\n\nThe fifth stage is \"Identity vs. Role Confusion\". The virtue gained is fidelity and it takes place in adolescence. This is when the child ideally starts to identify their place in society, particularly in terms of their gender role.\n\nThe sixth stage is \"Intimacy vs. Isolation\", which happens in young adults and the virtue gained is love. This is when the person starts to share his/her life with someone else intimately and emotionally. Not doing so can reinforce feelings of isolation.\n\nThe seventh stage is \"Generativity vs. Stagnation\". This happens in adulthood and the virtue gained is care. A person becomes stable and starts to give back by raising a family and becoming involved in the community.\n\nThe eighth stage is \"Ego Integrity vs. Despair\". When one grows old, they look back on their life and contemplate their successes and failures. If they resolve this positively, the virtue of wisdom is gained. This is also the stage when one can gain a sense of closure and accept death without regret or fear.<ref>{{Cite web | vauthors = Mcleod S |date=2013 |title=[Erik Erikson's Stages of Psychosocial Development] |url=https://www.simplypsychology.org/Erik-Erikson.html |language=en}}</ref>\n\n===Stages based on the model of hierarchical complexity===\n{{Main|Model of hierarchical complexity}}\n[[Michael Commons]] enhanced and simplified [[Bärbel Inhelder]] and Piaget's developmental theory and offers a standard method of examining the universal pattern of development. The Model of Hierarchical Complexity (MHC) is not based on the assessment of domain-specific information, It divides the Order of Hierarchical Complexity of tasks to be addressed from the Stage performance on those tasks. A stage is the order hierarchical complexity of the tasks the participant's successfully addresses. He expanded Piaget's original eight stage (counting the half stages) to seventeen stages. The stages are:\n\n# [[Model of hierarchical complexity|Calculatory]]\n# [[Model of hierarchical complexity|Automatic]]\n# [[Model of hierarchical complexity|Sensory & Motor]]\n# [[Model of hierarchical complexity|Circular sensory-motor]]\n# [[Model of hierarchical complexity|Sensory-motor]]\n# [[Model of hierarchical complexity|Nominal]]\n# [[Model of hierarchical complexity|Sentential]]\n# [[Model of hierarchical complexity|Preoperational]]\n# [[Model of hierarchical complexity|Primary]]\n# [[Model of hierarchical complexity|Concrete]]\n# [[Model of hierarchical complexity|Abstract]]\n# [[Model of hierarchical complexity|Formal]]\n# [[Model of hierarchical complexity|Systematic]]\n# [[Model of hierarchical complexity|Metasystematic]]\n# [[Model of hierarchical complexity|Paradigmatic]]\n# [[Model of hierarchical complexity|Cross-paradigmatic]]\n# [[Model of hierarchical complexity|Meta-Cross-paradigmatic]]\n\nThe order of hierarchical complexity of tasks predicts how difficult the performance is with an R ranging from 0.9 to 0.98.\n\nIn the MHC, there are three main axioms for an order to meet in order for the higher order task to coordinate the next lower order task. Axioms are rules that are followed to determine how the MHC orders actions to form a hierarchy. These axioms are: a) defined in terms of tasks at the next lower order of hierarchical complexity task action; b) defined as the higher order task action that organizes two or more less complex actions; that is, the more complex action specifies the way in which the less complex actions combine; c) defined as the lower order task actions have to be carried out non-arbitrarily.<ref>{{Cite web |title=Hierarchical Complexity - an overview {{!}} ScienceDirect Topics |url=https://www.sciencedirect.com/topics/social-sciences/hierarchical-complexity#:~:text=The%20Model%20of%20Hierarchical%20Complexity%20%20%20,invertebrates,%20hone%20...%20%2013%20more%20rows |access-date=2022-07-27 |website=www.sciencedirect.com}}</ref>\n\n===Ecological systems theory===\n{{Main|Ecological systems theory}}\n[[File:Bronfenbrenner's_Ecological_Theory_of_Development_(English).jpg|thumb|{{center|Bronfenbrenner's ecological systems theory}}]]\nEcological systems theory, originally formulated by [[Urie Bronfenbrenner]], specifies four types of nested environmental systems, with bi-directional influences within and between the systems. The four systems are microsystem, mesosystem, exosystem, and macrosystem. Each system contains roles, norms and rules that can powerfully shape development. The microsystem is the direct environment in our lives such as our home and school. Mesosystem is how relationships connect to the microsystem. Exosystem is a larger social system where the child plays no role. Macrosystem refers to the cultural values, customs and laws of society.<ref>{{cite web|url=https://explorable.com/ecological-systems-theory|title=Ecological Systems Theory|website=Explorable Psychology Experiments| vauthors = Sincero SM }}</ref>\n\nThe microsystem is the immediate environment surrounding and influencing the individual (example: school or the home setting). The mesosystem is the combination of two microsystems and how they influence each other (example: sibling relationships at home vs. peer relationships at school). The exosystem is the interaction among two or more settings that are indirectly linked (example: a father's job requiring more overtime ends up influencing his daughter's performance in school because he can no longer help with her homework). The macrosystem is broader taking into account social economic status, culture, beliefs, customs and morals (example: a child from a wealthier family sees a peer from a less wealthy family as inferior for that reason). Lastly, the chronosystem refers to the chronological nature of life events and how they interact and change the individual and their circumstances through transition (example: a mother losing her own mother to illness and no longer having that support in her life).<ref name=\"Edpsych24\"/>\n\nSince its publication in 1979, Bronfenbrenner's major statement of this theory, ''The Ecology of Human Development'',<ref>{{cite book | vauthors = Bronfenbrenner U | date = 1979 | title = The Ecology of Human Development: Experiments by Nature and Design | location = Cambridge, MA | publisher = Harvard University Press | isbn = 0-674-22457-4}}</ref> has had widespread influence on the way psychologists and others approach the study of human beings and their environments. As a result of this conceptualization of development, these environments—from the family to economic and political structures—have come to be viewed as part of the life course from childhood through to adulthood.<ref name=\"Smith et al.2\">{{Cite book|title= Understanding Children's Development |url = https://archive.org/details/understandingchi00smit/mode/2up      |publisher=Blackwell|edition=4|series=Basic psychology|location=Oxford, England| year = 2003 |isbn = 9780631228233 | oclc = 963696734|vauthors = Smith PK, Cowie H, Blades M }}</ref>\n\n===Zone of proximal development===\n{{Main|Zone of proximal development}}\n[[Lev Vygotsky]] was a Russian theorist from the Soviet era, who posited that children learn through hands-on experience and social interactions with members of their culture.<ref>{{cite book | vauthors = Schacter DL, Gilbert DR, Wegner DM | title = Psychology | volume = 2 | location = New York, NY | publisher = Worth Publishers | date = 2011 }}</ref> Vygotsky believed that a child's development should be examined during problem-solving activities.<ref>{{Cite book |last=Yamagata-Lynch |first=Lisa C. |url=https://books.google.com/books?id=4nAFT-zyrtEC |title=Activity Systems Analysis Methods: Understanding Complex Learning Environments |date=2010-07-15 |publisher=Springer Science & Business Media |isbn=978-1-4419-6321-5 |language=en}}</ref> Unlike Piaget, he claimed that timely and sensitive intervention by adults when a child is on the edge of learning a new task (called the \"zone of proximal development\") could help children learn new tasks. Zone of proximal development is a tool used to explain the learning of children and collaborating problem solving activities with an adult or peer.<ref>{{Cite book |last=Yamagata-Lynch |first=Lisa C. |url=https://books.google.com/books?id=4nAFT-zyrtEC |title=Activity Systems Analysis Methods: Understanding Complex Learning Environments |date=2010-07-15 |publisher=Springer Science & Business Media |isbn=978-1-4419-6321-5 |language=en}}</ref> This adult role is often referred to as the skilled \"master\", whereas the child is considered the learning apprentice through an educational process often termed \"[[cognitive apprenticeship]]\" Martin Hill stated that \"The world of reality does not apply to the mind of a child.\" This technique is called \"scaffolding\", because it builds upon knowledge children already have with new knowledge that adults can help the child learn.<ref name=\"vygotsky782\">{{Cite book|title=Mind in society: the development of higher psychological processes |publisher=Harvard University Press|year=1978|location=Cambridge, MA | jstor = j.ctvjf9vz4 | oclc = 3517053 | isbn = 9780674576285       |vauthors = Vygotsky LS |doi=10.2307/j.ctvjf9vz4 | url = https://archive.org/details/mindinsocietydev0000vygo }}</ref> Vygotsky was strongly focused on the role of culture in determining the child's pattern of development, arguing that development moves from the social level to the individual level.<ref name=\"vygotsky782\" /> In other words, Vygotsky claimed that psychology should focus on the progress of human consciousness through the relationship of an individual and their environment.<ref name=\"vygotsky20102\">{{cite book | vauthors = Yamagata-Lynch LC |title=Activity Systems Analysis Methods: Understanding Complex Learning Environments |date=15 July 2010 |publisher=Springer Science & Business Media |isbn=978-1-4419-6321-5 |edition=illustrated |url=https://books.google.com/books?id=4nAFT-zyrtEC}}</ref> He felt that if scholars continued to disregard this connection, then this disregard would inhibit the full comprehension of the human consciousness.<ref name=\"vygotsky20102\" />\n\n===Constructivism===\n{{Main|Constructivism (psychological school)}}\nConstructivism is a paradigm in psychology that characterizes learning as a process of actively constructing knowledge. Individuals create meaning for themselves or make sense of new information by selecting, organizing, and integrating information with other knowledge, often in the context of social interactions. Constructivism can occur in two ways: individual and social. Individual constructivism is when a person constructs knowledge through cognitive processes of their own experiences rather than by memorizing facts provided by others. Social constructivism is when individuals construct knowledge through an interaction between the knowledge they bring to a situation and social or cultural exchanges within that content.<ref name=\"Edpsych24\"/> A foundational concept of constructivism is that the purpose of cognition is to organize one's experiential world, instead of the ontological world around them.<ref>{{Cite journal |date=1998-08-13 |editor-last=Larochelle |editor-first=Marie |editor2-last=Bednarz |editor2-first=Nadine |editor3-last=Garrison |editor3-first=Jim |title=Constructivism and Education |url=http://dx.doi.org/10.1017/cbo9780511752865 |journal=Cambridge University Press |doi=10.1017/cbo9780511752865|isbn=978-0-521-62135-9 }}</ref>\n\nJean Piaget, a Swiss developmental psychologist, proposed that learning is an active process because children learn through experience and make mistakes and solve problems. Piaget proposed that learning should be whole by helping students understand that meaning is constructed.<ref>{{cite web|url=http://viking.coe.uh.edu/~ichen/ebook/et-it/cognitiv.htm|title=Overview of Cognitive Constructivism|website=Cognitive Constructivist Theories|access-date=2014-11-13|archive-url=https://web.archive.org/web/20141215094725/http://viking.coe.uh.edu/~ichen/ebook/et-it/cognitiv.htm|archive-date=2014-12-15|url-status=dead}}</ref>\n\n===Evolutionary developmental psychology===\n{{Main|Evolutionary developmental psychology}}\nEvolutionary developmental psychology is a research paradigm that applies the basic principles of Darwinian [[evolution]], particularly [[natural selection]], to understand the development of human behavior and cognition. It involves the study of both the [[Genetics|genetic]] and environmental mechanisms that underlie the development of social and [[cognitive]] competencies, as well as the [[epigenetic]] ([[gene-environment interaction]]s) processes that adapt these competencies to local conditions.<ref name=\"Bjorklund et al. 20142\">{{cite book|title=The Handbook of Evolutionary Psychology | vauthors = Bjorklund DF, Blasi CH, Ellis BJ  |isbn=978-1-118-75580-8|volume=2|pages=905|chapter=Evolutionary Developmental Psychology| veditors = Buss DM |date=2015-10-26| publisher = John Wiley & Sons }}</ref>\n\nEDP considers both the reliably developing, species-typical features of ontogeny (developmental adaptations), as well as [[Differential psychology|individual differences]] in behavior, from an evolutionary perspective. While evolutionary views tend to regard most individual differences as the result of either random genetic noise (evolutionary byproducts)<ref>{{cite journal | vauthors = Tooby J, Cosmides L | title = On the universality of human nature and the uniqueness of the individual: the role of genetics and adaptation | journal = Journal of Personality | volume = 58 | issue = 1 | pages = 17–67 | date = March 1990 | pmid = 2198338 | doi = 10.1111/j.1467-6494.1990.tb00907.x | url = http://www.psych.ucsb.edu/research/cep/papers/jpersonality.pdf | access-date = 2017-10-24 | url-status = dead | archive-url = https://web.archive.org/web/20171025022656/https://www.psych.ucsb.edu/research/cep/papers/jpersonality.pdf | archive-date = 2017-10-25 }}</ref> and/or idiosyncrasies (for example, peer groups, education, neighborhoods, and chance encounters)<ref>{{Cite book|title=The blank slate| vauthors = Pinker S |publisher=Penguin Books|year=2002|location=New York|chapter=Chapter 19: Children}}</ref> rather than products of natural selection, EDP asserts that natural selection can favor the emergence of individual differences via \"adaptive developmental plasticity\".<ref name=\"Bjorklund et al. 20142\" /><ref name=\":1\">{{Cite book|title=Developmental plasticity and evolution| vauthors = West-Eberhard MJ |publisher=Oxford University Press|year=2003}}</ref> From this perspective, human development follows alternative life-history strategies in response to environmental variability, rather than following one species-typical pattern of development.<ref name=\"Bjorklund et al. 20142\" />\n\nEDP is closely linked to the theoretical framework of [[evolutionary psychology]] (EP), but is also distinct from EP in several domains, including research emphasis (EDP focuses on adaptations of ontogeny, as opposed to adaptations of adulthood) and consideration of proximate ontogenetic and environmental factors (i.e., how development happens) in addition to more ultimate factors (i.e., why development happens), which are the focus of mainstream evolutionary psychology.<ref name=\":32\">{{Cite journal| vauthors = Blasi CH, Bjorklund DF |date=2003|title=Evolutionary Developmental Psychology: A New Tool for Better Understanding Human Ontogeny|url=https://www.researchgate.net/publication/275042203|journal=Human Development|volume=46|issue=5|pages=259–281|doi=10.1159/000071935|s2cid=143721157|access-date=March 31, 2016}}</ref>\n\n===Attachment theory===\n{{Main|Attachment theory}}\nAttachment theory, originally developed by [[John Bowlby]], focuses on the importance of open, intimate, emotionally meaningful relationships.<ref>{{Cite book|url=https://books.google.com/books?id=x-Oki9MxalQC&pg=PA45|title=Attachment Theory: Social, Developmental, and Clinical Perspectives| vauthors = Goldberg S, Muir R, Kerr J |date=2013-04-15|publisher=Routledge|isbn=9781135890520}}</ref> Attachment is described as a biological system or powerful survival impulse that evolved to ensure the survival of the infant. A threatened or stressed child will move toward caregivers who create a sense of physical, emotional, and psychological safety for the individual. Attachment feeds on body contact and familiarity. Later [[Mary Ainsworth]] developed the [[Mary Ainsworth#Strange Situation|Strange Situation]] protocol and the concept of the secure base. This tool has been found to help understand attachment, such as the Strange Situation Test and the Adult Attachment Interview. Both of which help determine factors to certain attachment styles. The Strange Situation Test helps find \"disturbances in attachment\" and whether certain attributes are found to contribute to a certain attachment issue.<ref name=\":02\">{{Cite journal| vauthors = Kanieski MA |date=2010-08-01|title=Securing attachment: The shifting medicalisation of attachment and attachment disorders|url=https://doi.org/10.1080/13698571003789682|journal=Health, Risk & Society|volume=12|issue=4|pages=335–344|doi=10.1080/13698571003789682|s2cid=144583724|issn=1369-8575}}</ref> The Adult Attachment Interview is a tool that is similar to the Strange Situation Test but instead focuses attachment issues found in adults.<ref name=\":02\" /> Both tests have helped many researchers gain more information on the risks and how to identify them.<ref name=\":02\" />\n\nTheorists have proposed four types of attachment styles:<ref name=\"Schacter4402\">{{cite book|title=Psychology|url=https://archive.org/details/psychologysecond00dani|url-access=limited| vauthors = Schacter DL, Gilbert DT, Wegner DM |publisher=Worth|year=2011|pages=[https://archive.org/details/psychologysecond00dani/page/n471 440]|isbn=9781429237192}}</ref> secure, anxious-avoidant, anxious-resistant,<ref name=\"Adolescence3\"/> and disorganized.<ref name=\"Schacter4402\" /> Secure attachment is a healthy attachment between the infant and the caregiver. It is characterized by trust. Anxious-avoidant is an insecure attachment between an infant and a caregiver. This is characterized by the infant's indifference toward the caregiver. Anxious-resistant is an insecure attachment between the infant and the caregiver characterized by distress from the infant when separated and anger when reunited.<ref name=\"Adolescence3\" /> Disorganized is an attachment style without a consistent pattern of responses upon return of the parent.<ref name=\"Schacter4402\" />\n\nA child can be hindered in its natural tendency to form attachments. Some babies are raised without the stimulation and attention of a regular caregiver or locked away under conditions of abuse or extreme neglect. The possible short-term effects of this deprivation are anger, despair, detachment, and temporary delay in intellectual development. Long-term effects include increased aggression, clinging behavior, detachment, psychosomatic disorders, and an increased risk of depression as an adult.<ref>{{Cite book|title=Exploring Psychology| vauthors = Myers D |publisher=Worth Publishers|year=2008|isbn=978-1-57259-096-0}}</ref>{{page needed|date=August 2015}}<ref>{{Cite book|title=A Level Psychology Through Diagrams| vauthors = Hill G |publisher=Oxford University Press|year=2001|isbn=978-0-19-918094-3}}</ref>{{page needed|date=August 2015}}\\\n\nAccording to the theory, attachment is established in early childhood and attachment continues into adulthood. As such, proponents posit that the attachment style that individuals form in childhood impacts the way they manage stressors in intimate relationships as an adult.<ref name=\":13\">{{Cite journal |vauthors=Simpson JA |year=1990 |title=Influence of attachment styles on romantic relationships |url=https://doi.org/10.1037/0022-3514.59.5.971 |journal=Journal of Personality and Social Psychology |volume=59 |issue=5 |pages=971–980 |doi=10.1037/0022-3514.59.5.971 |via=APA PsycNet}}</ref>\n\n===Nature vs nurture===\n{{Main|Nature versus nurture}}\nA significant debate in developmental psychology is the relationship between innateness and environmental influence in regard to any particular aspect of development. This is often referred to as \"[[nature and nurture]]\" or [[psychological nativism|nativism]] versus [[empiricism]]. A nativist account of development would argue that the processes in question are innate, that is, they are specified by the organism's [[genes]].<ref>{{Cite journal| vauthors = Khalidi MA |date=2002|title=Nature and Nurture in Cognition|url=https://www.jstor.org/stable/3541766|journal=The British Journal for the Philosophy of Science|volume=53|issue=2|pages=251–272|doi=10.1093/bjps/53.2.251|jstor=3541766|issn=0007-0882}}</ref> What makes a person who they are? Is it their environment or their genetics? This is the debate of nature vs nurture.<ref>{{cite journal | vauthors = Collins WA, Maccoby EE, Steinberg L, Hetherington EM, Bornstein MH | title = Contemporary research on parenting. The case for nature and nurture | journal = The American Psychologist | volume = 55 | issue = 2 | pages = 218–232 | date = February 2000 | pmid = 10717969 | doi = 10.1037/0003-066x.55.2.218 }}</ref>\n\nAn empiricist perspective would argue that those processes are acquired in interaction with the environment. Today developmental psychologists rarely take such polarized positions with regard to most aspects of development; rather they investigate, among many other things, the relationship between innate and environmental influences. One of the ways this relationship has been explored in recent years is through the emerging field of [[evolutionary developmental psychology]].\n\nOne area where this innateness debate has been prominently portrayed is in research on [[language acquisition]]. A major question in this area is whether or not certain properties of human language are specified genetically or can be acquired through [[learning]]. The empiricist position on the issue of language acquisition suggests that the language input provides the necessary information required for learning the structure of language and that infants acquire language through a process of [[statistical learning in language acquisition|statistical learning]]. From this perspective, language can be acquired via general learning methods that also apply to other aspects of development, such as [[perceptual learning]].<ref>{{cite journal | vauthors = Sameroff A | title = A unified theory of development: a dialectic integration of nature and nurture | journal = Child Development | volume = 81 | issue = 1 | pages = 6–22 | date = January 2010 | pmid = 20331651 | doi = 10.1111/j.1467-8624.2009.01378.x }}</ref>\n\nThe nativist position argues that the input from language is too impoverished for infants and children to acquire the structure of language. Linguist [[Noam Chomsky]] asserts that, evidenced by the lack of sufficient information in the language input, there is a [[universal grammar]] that applies to all human languages and is pre-specified. This has led to the idea that there is a special cognitive [[modularity of mind|module]] suited for learning language, often called the [[language acquisition device]]. Chomsky's critique of the behaviorist model of language acquisition is regarded by many as a key turning point in the decline in the prominence of the theory of behaviorism generally.<ref name=\"Schlinger\">{{Cite journal | vauthors = Schlinger HD |year=2008 |title=The long good-bye: why B.F. Skinner's Verbal Behavior is alive and well on the 50th anniversary of its publication |journal=The Psychological Record |volume=58 |issue=3 |pages=329–337 |doi=10.1007/BF03395622 |s2cid=18114690 |url=https://opensiuc.lib.siu.edu/tpr/vol58/iss3/1 |access-date=2019-08-20 |archive-date=2020-01-17 |archive-url=https://web.archive.org/web/20200117074401/https://opensiuc.lib.siu.edu/tpr/vol58/iss3/1/ |url-status=dead }}</ref> But Skinner's conception of \"Verbal Behavior\" has not died, perhaps in part because it has generated successful practical applications.<ref name=\"Schlinger\" />\n\nMaybe there could be \"strong interactions of both nature and nurture\".<ref>{{cite journal | vauthors = McClearn GE | title = Nature and nurture: interaction and coaction | journal = American Journal of Medical Genetics. Part B, Neuropsychiatric Genetics | volume = 124B | issue = 1 | pages = 124–130 | date = January 2004 | pmid = 14681926 | doi = 10.1002/ajmg.b.20044 | s2cid = 21852683 }}</ref>\n\n===Continuity vs discontinuity===\nOne of the major discussions in developmental psychology includes whether development is discontinuous or continuous.\n\nContinuous development is quantifiable and quantitative, whereas discontinuous development is qualitative. Quantitative estimations of development can be measuring the stature of a child, and measuring their memory or consideration span. \"Particularly dramatic examples of qualitative changes are metamorphoses, such as the emergence of a caterpillar into a butterfly.\"<ref name=\"Crain, William C., 1943\">{{Cite book| vauthors = Crain WC |url=https://www.worldcat.org/oclc/918135643|title=Theories of development : concepts and applications|date=2 October 2015|isbn=978-1-317-34322-6|edition=Sixth|location=London|oclc=918135643 |publisher=Routledge, Taylor & Francis Group}}</ref>\n\nThose psychologists who bolster the continuous view of improvement propose that improvement includes slow and progressing changes all through the life span, with behavior within the prior stages of advancement giving the premise of abilities and capacities required for the other stages. \"To many, the concept of continuous, quantifiable measurement seems to be the essence of science\".<ref name=\" Crain, William C., 1943\"/>\n\nNot all psychologists, be that as it may, concur that advancement could be a continuous process. A few see advancement as a discontinuous process. They accept advancement includes unmistakable and partitioned stages with diverse sorts of behavior happening in each organization. This proposes that the development of certain capacities in each arrange, such as particular feelings or ways of considering, have a definite beginning and finishing point. Be that as it may, there's no correct time at which a capacity abruptly shows up or disappears. Although some sorts of considering, feeling or carrying on could seem to seem abruptly, it is more than likely that this has been developing gradually for some time.<ref>{{Cite book| vauthors = Carter L, Grivas J |url= https://www.worldcat.org/oclc/224074696 |title=Psychology for South Australia. Stage 1 |date=2004 |publisher=Jacaranda |isbn=0-7314-0094-1|location=Milton, Qld.|oclc=224074696}}</ref>\n\nStage theories of development rest on the suspicion that development may be a discontinuous process including particular stages which are characterized by subjective contrasts in behavior. They moreover assume that the structure of the stages is not variable concurring to each person, in any case, the time of each arrangement may shift separately. Stage theories can be differentiated with ceaseless hypotheses, which set that development is an incremental process.<ref>{{Cite book| vauthors = White FA, Hayes BK, Livesey DJ |author-link=Fiona A. White |url=https://www.worldcat.org/oclc/904034548|title=Developmental psychology: from infancy to adulthood|date=18 September 2015|isbn=978-1-4860-1827-7|edition=4th|location=Melbourne, Vic.|oclc=904034548}}</ref>\n\n===Stability vs change===\n<!-- Main article: Stability and [https://www.jstor.org/stable/42641912 Change] -->\nThis issue involves the degree to which one becomes older renditions of their early experience or whether they develop into something different from who they were at an earlier point in development.<ref>{{Cite journal |date=2019-05-24 |title=Aging, Personality, and Social Change: The Stability of Individual Differences Over the Adult Life Span |url=https://www.taylorfrancis.com/chapters/edit/10.4324/9781315789255-4/aging-personality-social-change-stability-individual-differences-adult-life-span-duane-alwin |journal=Life-Span Development and Behavior |language=en |pages=135–186 |doi=10.4324/9781315789255-4|last1=Alwin |first1=Duane F. |isbn=9781315789255 |s2cid=150225268 }}</ref> It considers the extent to which early experiences (especially infancy) or later experiences are the key determinants of a person's development. Stability is defined as the consistent ordering of individual differences with respect to some attribute.<ref>{{Cite journal |last=EMMERICH |first=WALTER |date=1966 |title=Stability and Change in Early Personality Development |url=https://www.jstor.org/stable/42641912 |journal=Young Children |volume=21 |issue=4 |pages=233–243 |jstor=42641912 |issn=0044-0728}}</ref> Change is altering someone/something.\n\nMost [[Development of the human body|'''''human development''''']] lifespan developmentalists recognize that extreme positions are unwise. Therefore, the key to a comprehensive understanding of development at any stage requires the interaction of different factors and not only one.<ref>{{Cite journal |last1=Orben |first1=Amy |last2=Tomova |first2=Livia |last3=Blakemore |first3=Sarah-Jayne |date=2020-08-01 |title=The effects of social deprivation on adolescent development and mental health |journal=The Lancet Child & Adolescent Health |language=en |volume=4 |issue=8 |pages=634–640 |doi=10.1016/S2352-4642(20)30186-3 |pmid=32540024 |pmc=7292584 |issn=2352-4642|doi-access=free }}</ref>\n\n===Theory of mind===\nTheory of mind is the ability to attribute mental states to ourselves and others.<ref>{{Cite journal |last1=Byom |first1=Lindsey J. |last2=Mutlu |first2=Bilge |date=2013-08-08 |title=Theory of mind: mechanisms, methods, and new directions |journal=Frontiers in Human Neuroscience |volume=7 |pages=413 |doi=10.3389/fnhum.2013.00413 |issn=1662-5161 |pmc=3737477 |pmid=23964218|doi-access=free }}</ref> It is a complex but vital process in which children begin to understand the emotions, motives, and feelings of not only themselves but also others. Theory of mind allows people to understand that others have unique beliefs and desires that are different from our own. This enables people to engage in daily social interactions as we explain the mental state around us. If a child does not fully develop theory of mind within this crucial 5-year period, they can suffer from communication barriers that follow them into adolescence and adulthood.<ref>{{Cite journal |last1=Nilsson |first1=Kristine Kahr |last2=de López |first2=Kristine Jensen |date=2016 |title=Theory of Mind in Children With Specific Language Impairment: A Systematic Review and Meta-Analysis |url=https://www.jstor.org/stable/24698538 |journal=Child Development |volume=87 |issue=1 |pages=143–153 |doi=10.1111/cdev.12462 |jstor=24698538 |pmid=26582261 |issn=0009-3920}}</ref> Exposure to more people and the availability of stimuli that encourages social-cognitive growth is a factor that relies heavily on family.<ref>{{Cite web |title=Theory of Mind {{!}} Simply Psychology |url=https://www.simplypsychology.org/theory-of-mind.html |access-date=2022-07-29 |website=www.simplypsychology.org}}</ref>\n\n", "goals": ["The student will be able to describe the developmental psychology theories and their implications on human development", "The student will be able to describe the developmental psychology theories and their implications on human development", "The student will be able to describe the developmental psychology theories and their implications on human development", "The student will be able to describe the developmental psychology theories and their implications on human development", "The student will be able to describe the developmental psychology theories and their implications on human development"]}, {"title": "Psychosexual development", "content": "{{Main|Psychosexual development}}\n[[Sigmund Freud]] developed a theory that suggested that humans behave as they do because they are constantly seeking pleasure. This process of seeking pleasure changes through stages because people evolve. Each period of seeking pleasure that a person experiences is represented by a stage of psychosexual development. These stages symbolize the process of arriving to become a maturing adult.<ref>{{Citation| vauthors = Lantz SE, Ray S |title=Freud Developmental Theory |date=2022 |url=http://www.ncbi.nlm.nih.gov/books/NBK557526/ |work=StatPearls|place=Treasure Island (FL)|publisher=StatPearls Publishing|pmid=32491458|access-date=2022-02-12}}</ref>\n\nThe first is the ''oral stage'', which begins at birth and ends around a year and a half of age. During the oral stage, the child finds pleasure in behaviors like sucking or other behaviors with the mouth. The second is the ''anal stage'', from about a year or a year and a half to three years of age. During the anal stage, the child defecates from the anus and is often fascinated with its defecation. This period of development often occurs during the time when the child is being toilet trained. The child becomes interested with feces and urine. Children begin to see themselves as independent from their parents. They begin to desire assertiveness and autonomy.\n\nThe third is the ''[[phallic stage]]'', which occurs from three to five years of age (most of a person's personality forms by this age). During the phallic stage, the child becomes aware of its sexual organs. Pleasure comes from finding acceptance and love from the opposite sex. The fourth is the ''latency stage'', which occurs from age five until puberty. During the latency stage, the child's sexual interests are repressed.\n\nStage five is the ''[[genital stage]]'', which takes place from puberty until adulthood. During the genital stage, puberty begins to occur.<ref>{{cite web| vauthors = McLeod S |title=Psychosexual Stages|url=http://www.simplypsychology.org/psychosexual.html|url-status=dead|archive-url=https://web.archive.org/web/20141219093455/http://www.simplypsychology.org/psychosexual.html|archive-date=2014-12-19|access-date=2014-11-10|website=SimplyPsychology}}</ref> Children have now matured, and begin to think about other people instead of just themselves. Pleasure comes from feelings of affection from other people.\n\nFreud believed there is tension between the conscious and unconscious because the conscious tries to hold back what the unconscious tries to express. To explain this, he developed three personality structures: id, ego, and superego. The id, the most primitive of the three, functions according to the pleasure principle: seek pleasure and avoid pain.<ref name=\"Theories2\">{{cite book|title=Theories of personality: understanding persons| vauthors = Cloninger SC |date=29 June 2012|publisher=Pearson Education|isbn=978-0-205-25624-2|edition=6th|location=Boston|pages=19–101}}</ref> The superego plays the critical and moralizing role, while the ego is the organized, realistic part that mediates between the desires of the id and the superego.<ref name=\"Snowden2\">{{cite book|title=Teach Yourself Freud| vauthors = Snowden R |publisher=[[McGraw-Hill]]|year=2006|isbn=978-0-07-147274-6|pages=105–107}}</ref>\n\n", "goals": ["The student will be able to identify the five stages of psychosexual development and understand the role of the id, ego, and superego in the development of personality", "The student will be able to identify the five stages of psychosexual development and understand the role of the id, ego, and superego in the development of personality", "The student will be able to identify the five stages of psychosexual development and understand the role of the id, ego, and superego in the development of personality", "The student will be able to identify the five stages of psychosexual development and understand the role of the id, ego, and superego in the development of personality", "The student will be able to identify the five stages of psychosexual development and understand the role of the id, ego, and superego in the development of personality"]}, {"title": "Theories of cognitive development", "content": "{{Main|Piaget's theory of cognitive development}}\n[[Jean Piaget]], a Swiss theorist, posited that children learn by actively constructing knowledge through their interactions with their physical and social environments.<ref name=\"WoodWoodBoyd2\">{{Cite book|title=Mastering the world of psychology|publisher=Allyn & Bacon|year=2006|edition=2| vauthors = Wood SE, Wood CE, Boyd D }}</ref> He suggested that the adult's role in helping the child learn was to provide appropriate materials. In his interview techniques with children that formed an empirical basis for his theories, he used something similar to [[Socratic questioning]] to get children to reveal their thinking. He argued that a principal source of development was through the child's inevitable generation of contradictions through their interactions with their physical and social worlds. The child's resolution of these contradictions led to more integrated and advanced forms of interaction, a developmental process that he called, \"equilibration.\" \n\nPiaget argued that intellectual development takes place through a series of stages generated through the equilibration process. Each stage consists of steps the child must master before moving to the next step. He believed that these stages are not separate from one another, but rather that each stage builds on the previous one in a continuous learning process. He proposed four stages: ''sensorimotor'', ''pre-operational'', ''concrete operational'', and ''formal operational''. Though he did not believe these stages occurred at any given age, many studies have determined when these cognitive abilities should take place.<ref name=\"Edpsych24\">{{cite book|title=Edpsych : modules| vauthors = Reese-Weber L, Bohlin CC, Durwin M |publisher=McGraw-Hill Humanities/Social Sciences/Languages|isbn=978-0-07-809786-7|edition=2nd|location=New York|pages=30–132|date=2011-12-06}}</ref>\n\n", "goals": ["The student will be able to identify and describe the four stages of cognitive development proposed by Piaget", "The student will be able to explain the concept of equilibration and its role in cognitive development", "The student will be able to distinguishthe differences between the sensorimotor, pre-operational, concrete operational, and formal operational stages of cognitive development", "The student will be able to explain the role of Socratic questioning in Piaget's theory of cognitive development", "The student will be able to identify and describe the role of contradictions in the cognitive development process"]}, {"title": "Nature vs nurture", "content": "{{Main|Nature versus nurture}}\nA significant debate in developmental psychology is the relationship between innateness and environmental influence in regard to any particular aspect of development. This is often referred to as \"[[nature and nurture]]\" or [[psychological nativism|nativism]] versus [[empiricism]]. A nativist account of development would argue that the processes in question are innate, that is, they are specified by the organism's [[genes]].<ref>{{Cite journal| vauthors = Khalidi MA |date=2002|title=Nature and Nurture in Cognition|url=https://www.jstor.org/stable/3541766|journal=The British Journal for the Philosophy of Science|volume=53|issue=2|pages=251–272|doi=10.1093/bjps/53.2.251|jstor=3541766|issn=0007-0882}}</ref> What makes a person who they are? Is it their environment or their genetics? This is the debate of nature vs nurture.<ref>{{cite journal | vauthors = Collins WA, Maccoby EE, Steinberg L, Hetherington EM, Bornstein MH | title = Contemporary research on parenting. The case for nature and nurture | journal = The American Psychologist | volume = 55 | issue = 2 | pages = 218–232 | date = February 2000 | pmid = 10717969 | doi = 10.1037/0003-066x.55.2.218 }}</ref>\n\nAn empiricist perspective would argue that those processes are acquired in interaction with the environment. Today developmental psychologists rarely take such polarized positions with regard to most aspects of development; rather they investigate, among many other things, the relationship between innate and environmental influences. One of the ways this relationship has been explored in recent years is through the emerging field of [[evolutionary developmental psychology]].\n\nOne area where this innateness debate has been prominently portrayed is in research on [[language acquisition]]. A major question in this area is whether or not certain properties of human language are specified genetically or can be acquired through [[learning]]. The empiricist position on the issue of language acquisition suggests that the language input provides the necessary information required for learning the structure of language and that infants acquire language through a process of [[statistical learning in language acquisition|statistical learning]]. From this perspective, language can be acquired via general learning methods that also apply to other aspects of development, such as [[perceptual learning]].<ref>{{cite journal | vauthors = Sameroff A | title = A unified theory of development: a dialectic integration of nature and nurture | journal = Child Development | volume = 81 | issue = 1 | pages = 6–22 | date = January 2010 | pmid = 20331651 | doi = 10.1111/j.1467-8624.2009.01378.x }}</ref>\n\nThe nativist position argues that the input from language is too impoverished for infants and children to acquire the structure of language. Linguist [[Noam Chomsky]] asserts that, evidenced by the lack of sufficient information in the language input, there is a [[universal grammar]] that applies to all human languages and is pre-specified. This has led to the idea that there is a special cognitive [[modularity of mind|module]] suited for learning language, often called the [[language acquisition device]]. Chomsky's critique of the behaviorist model of language acquisition is regarded by many as a key turning point in the decline in the prominence of the theory of behaviorism generally.<ref name=\"Schlinger\">{{Cite journal | vauthors = Schlinger HD |year=2008 |title=The long good-bye: why B.F. Skinner's Verbal Behavior is alive and well on the 50th anniversary of its publication |journal=The Psychological Record |volume=58 |issue=3 |pages=329–337 |doi=10.1007/BF03395622 |s2cid=18114690 |url=https://opensiuc.lib.siu.edu/tpr/vol58/iss3/1 |access-date=2019-08-20 |archive-date=2020-01-17 |archive-url=https://web.archive.org/web/20200117074401/https://opensiuc.lib.siu.edu/tpr/vol58/iss3/1/ |url-status=dead }}</ref> But Skinner's conception of \"Verbal Behavior\" has not died, perhaps in part because it has generated successful practical applications.<ref name=\"Schlinger\" />\n\nMaybe there could be \"strong interactions of both nature and nurture\".<ref>{{cite journal | vauthors = McClearn GE | title = Nature and nurture: interaction and coaction | journal = American Journal of Medical Genetics. Part B, Neuropsychiatric Genetics | volume = 124B | issue = 1 | pages = 124–130 | date = January 2004 | pmid = 14681926 | doi = 10.1002/ajmg.b.20044 | s2cid = 21852683 }}</ref>\n\n", "goals": ["The student will be able to describe the nature versus nurture debate in developmental psychology", "The student will be able to describe the role of genetics and environment in development", "The student will be able to describe the role of genes and environment in language acquisition", "The student will be able to describe the role of nature and nurture in the development of cognitive modules", "The student will be able to describe the role of nature and nurture in the development of language acquisition device"]}, {"title": "Continuity vs discontinuity", "content": "One of the major discussions in developmental psychology includes whether development is discontinuous or continuous.\n\nContinuous development is quantifiable and quantitative, whereas discontinuous development is qualitative. Quantitative estimations of development can be measuring the stature of a child, and measuring their memory or consideration span. \"Particularly dramatic examples of qualitative changes are metamorphoses, such as the emergence of a caterpillar into a butterfly.\"<ref name=\"Crain, William C., 1943\">{{Cite book| vauthors = Crain WC |url=https://www.worldcat.org/oclc/918135643|title=Theories of development : concepts and applications|date=2 October 2015|isbn=978-1-317-34322-6|edition=Sixth|location=London|oclc=918135643 |publisher=Routledge, Taylor & Francis Group}}</ref>\n\nThose psychologists who bolster the continuous view of improvement propose that improvement includes slow and progressing changes all through the life span, with behavior within the prior stages of advancement giving the premise of abilities and capacities required for the other stages. \"To many, the concept of continuous, quantifiable measurement seems to be the essence of science\".<ref name=\" Crain, William C., 1943\"/>\n\nNot all psychologists, be that as it may, concur that advancement could be a continuous process. A few see advancement as a discontinuous process. They accept advancement includes unmistakable and partitioned stages with diverse sorts of behavior happening in each organization. This proposes that the development of certain capacities in each arrange, such as particular feelings or ways of considering, have a definite beginning and finishing point. Be that as it may, there's no correct time at which a capacity abruptly shows up or disappears. Although some sorts of considering, feeling or carrying on could seem to seem abruptly, it is more than likely that this has been developing gradually for some time.<ref>{{Cite book| vauthors = Carter L, Grivas J |url= https://www.worldcat.org/oclc/224074696 |title=Psychology for South Australia. Stage 1 |date=2004 |publisher=Jacaranda |isbn=0-7314-0094-1|location=Milton, Qld.|oclc=224074696}}</ref>\n\nStage theories of development rest on the suspicion that development may be a discontinuous process including particular stages which are characterized by subjective contrasts in behavior. They moreover assume that the structure of the stages is not variable concurring to each person, in any case, the time of each arrangement may shift separately. Stage theories can be differentiated with ceaseless hypotheses, which set that development is an incremental process.<ref>{{Cite book| vauthors = White FA, Hayes BK, Livesey DJ |author-link=Fiona A. White |url=https://www.worldcat.org/oclc/904034548|title=Developmental psychology: from infancy to adulthood|date=18 September 2015|isbn=978-1-4860-1827-7|edition=4th|location=Melbourne, Vic.|oclc=904034548}}</ref>\n\n", "goals": ["The student will be able to describe the difference between continuous and discontinuous development in developmental psychology", "The student will be able to describe the quantitative and qualitative aspects of development in developmental psychology", "The student will be able to describe the role of stage theories in developmental psychology", "The student will be able to describe the role of continuous and discontinuous development in the development of specific capacities and abilities in developmental psychology", "The student will be able to describe the role of stage theories in the development of specific capacities and abilities in developmental psychology"]}, {"title": "Stability vs change", "content": "<!-- Main article: Stability and [https://www.jstor.org/stable/42641912 Change] -->\nThis issue involves the degree to which one becomes older renditions of their early experience or whether they develop into something different from who they were at an earlier point in development.<ref>{{Cite journal |date=2019-05-24 |title=Aging, Personality, and Social Change: The Stability of Individual Differences Over the Adult Life Span |url=https://www.taylorfrancis.com/chapters/edit/10.4324/9781315789255-4/aging-personality-social-change-stability-individual-differences-adult-life-span-duane-alwin |journal=Life-Span Development and Behavior |language=en |pages=135–186 |doi=10.4324/9781315789255-4|last1=Alwin |first1=Duane F. |isbn=9781315789255 |s2cid=150225268 }}</ref> It considers the extent to which early experiences (especially infancy) or later experiences are the key determinants of a person's development. Stability is defined as the consistent ordering of individual differences with respect to some attribute.<ref>{{Cite journal |last=EMMERICH |first=WALTER |date=1966 |title=Stability and Change in Early Personality Development |url=https://www.jstor.org/stable/42641912 |journal=Young Children |volume=21 |issue=4 |pages=233–243 |jstor=42641912 |issn=0044-0728}}</ref> Change is altering someone/something.\n\nMost [[Development of the human body|'''''human development''''']] lifespan developmentalists recognize that extreme positions are unwise. Therefore, the key to a comprehensive understanding of development at any stage requires the interaction of different factors and not only one.<ref>{{Cite journal |last1=Orben |first1=Amy |last2=Tomova |first2=Livia |last3=Blakemore |first3=Sarah-Jayne |date=2020-08-01 |title=The effects of social deprivation on adolescent development and mental health |journal=The Lancet Child & Adolescent Health |language=en |volume=4 |issue=8 |pages=634–640 |doi=10.1016/S2352-4642(20)30186-3 |pmid=32540024 |pmc=7292584 |issn=2352-4642|doi-access=free }}</ref>\n\n", "goals": ["The student will be able to describe the concept of stability and change in human development", "The student will be able to describe the concept of stability and change in human development", "The student will be able to describe the concept of stability and change in human development", "The student will be able to describe the concept of stability and change in human development", "The student will be able to describe the concept of stability and change in human development"]}, {"title": "Mathematical models", "content": "Developmental psychology is concerned not only with describing the characteristics of psychological change over time but also seeks to explain the principles and internal workings underlying these changes. Psychologists have attempted to better understand these factors by using [[model (abstract)|models]]. A model must simply account for the means by which a process takes place. This is sometimes done in reference to changes in the [[human brain|brain]] that may correspond to changes in behavior over the course of the development.\n\nMathematical modeling is useful in developmental psychology for implementing theory in a precise and easy-to-study manner, allowing generation, explanation, integration, and prediction of diverse phenomena. Several modeling techniques are applied to development: [[symbol]]ic, [[connectionist]] ([[neural net]]work), or [[Cognitive model#Dynamical systems|dynamical systems]] models.\n\nDynamic systems models illustrate how many different features of a complex system may interact to yield emergent behaviors and abilities. Nonlinear dynamics has been applied to human systems specifically to address issues that require attention to temporality such as life transitions, human development, and behavioral or emotional change over time. Nonlinear dynamic systems is currently being explored as a way to explain discrete phenomena of human development such as affect,<ref>{{Cite book|title=Computational social psychology| vauthors = Vallacher RR |publisher=Routledge|year=2017|isbn=978-1138951655}}</ref> second language acquisition,<ref>{{cite journal | vauthors = de Bot K |title=A dynamic systems theory approach to second language acquisition|journal=Bilingualism: Language and Cognition |volume=10 |pages=7–21 |doi=10.1017/S1366728906002732|year=2007|s2cid=33567516}}</ref> and locomotion.<ref>{{cite journal | vauthors = Rhea CK, Kiefer AW, D'Andrea SE, Warren WH, Aaron RK | title = Entrainment to a real time fractal visual stimulus modulates fractal gait dynamics | journal = Human Movement Science | volume = 36 | pages = 20–34 | date = August 2014 | pmid = 24911782 | doi = 10.1016/j.humov.2014.04.006 | url = http://libres.uncg.edu/ir/uncg/f/C_Rhea_Entrainment_2014.pdf }}</ref>\n\n", "goals": ["The student will be able to identify and describe the different types of models used in developmental psychology, including symbolic, connectionist, and dynamical systems models", "The student will be able to explain how mathematical modeling is useful in developmental psychology for implementing theory in a precise and easy-to-study manner, allowing generation, explanation, integration, and prediction of diverse phenomena", "The student will be able to distinguishe between the different types of models used in developmental psychology, including symbolic, connectionist, and dynamical systems models, and understand how each type of model is used to account for the means by which a process takes place", "The student will be able to explain how dynamic systems models illustrate how many different features of a complex system may interact to yield emergent behaviors and abilities, and understand how nonlinear dynamics has been applied to human systems specifically to address issues that require attention to temporality such as life", "The student will be able to identify and describe the different features of a complex system that may interact to yield emergent behaviors and abilities, and understand how nonlinear dynamics has been applied to human systems specifically to address issues that require attention to temporality such as life transitions, human development,"]}, {"title": "Research areas", "content": "===Neural Development===\nOne critical aspect of developmental psychology is the study of neural development, which investigates how the brain changes and develops during different stages of life. Neural development focuses on how the brain changes and develops during different stages of life. Studies have shown that the human brain undergoes rapid changes during prenatal and early postnatal periods. These changes include the formation of neurons, the development of neural networks, and the establishment of synaptic connections.<ref>{{Cite journal |title=Regional differences in synaptogenesis in human cerebral cortex |journal=The Journal of Comparative Neurology | year=1997 |doi=10.1002/(sici)1096-9861(19971020)387:2<167::aid-cne1>3.0.co;2-z| pmid=9336221 | last1=Huttenlocher | first1=P. R. | last2=Dabholkar | first2=A. S. | volume=387 | issue=2 | pages=167–178 | s2cid=7751299 | doi-access=free }}</ref> The formation of neurons and the establishment of basic neural circuits in the developing brain are crucial for laying the foundation of the brain's structure and function, and disruptions during this period can have long-term effects on cognitive and emotional development.<ref>{{Cite journal |last=Johnson |first=Mark H. |date=July 2001 |title=Functional brain development in humans |url=https://www.nature.com/articles/35081509 |journal=Nature Reviews Neuroscience |language=en |volume=2 |issue=7 |pages=475–483 |doi=10.1038/35081509 |pmid=11433372 |s2cid=188729 |issn=1471-0048}}</ref>\n\nExperiences and environmental factors play a crucial role in shaping neural development. Early sensory experiences, such as exposure to language and visual stimuli, can influence the development of neural pathways related to perception and language processing.<ref>{{Cite journal |last1=Werker |first1=Janet F. |last2=Hensch |first2=Takao K. |date=2015-01-03 |title=Critical Periods in Speech Perception: New Directions |journal=Annual Review of Psychology |language=en |volume=66 |issue=1 |pages=173–196 |doi=10.1146/annurev-psych-010814-015104 |pmid=25251488 |s2cid=27047922 |issn=0066-4308|doi-access=free }}</ref>\n\nGenetic factors play a huge roll in neural development. Genetic factors can influence the timing and pattern of neural development, as well as the susceptibility to certain developmental disorders, such as autism spectrum disorder and attention-deficit/hyperactivity disorder.<ref>{{Cite journal |last1=Geschwind |first1=Daniel H. |last2=Rakic |first2=Pasko |date=2013-10-30 |title=Cortical Evolution: Judge the Brain by Its Cover |journal=Neuron |language=English |volume=80 |issue=3 |pages=633–647 |doi=10.1016/j.neuron.2013.10.045 |issn=0896-6273 |pmc=3922239 |pmid=24183016}}</ref>\n\nResearch finds that the adolescent brain undergoes significant changes in neural connectivity and plasticity. During this period, there is a pruning process where certain neural connections are strengthened while others are eliminated, resulting in more efficient neural networks and increased cognitive abilities, such as decision-making and impulse control.<ref>{{Cite journal |last1=Blakemore |first1=Sarah-Jayne |last2=Choudhury |first2=Suparna |date=March 2006 |title=Development of the adolescent brain: implications for executive function and social cognition |journal=Journal of Child Psychology and Psychiatry |language=en |volume=47 |issue=3–4 |pages=296–312 |doi=10.1111/j.1469-7610.2006.01611.x |pmid=16492261 |s2cid=145456431 |issn=0021-9630|doi-access=free }}</ref>\n\nThe study of neural development provides crucial insights into the complex interplay between genetics, environment, and experiences in shaping the developing brain. By understanding the neural processes underlying developmental changes, researchers gain a better understanding of cognitive, emotional, and social development in humans.\n\n===Cognitive development===\n{{Main|Cognitive development|Theory of cognitive development|Neo-Piagetian theories of cognitive development}}\nCognitive development is primarily concerned with the ways that infants and children acquire, develop, and use internal mental capabilities such as: problem-solving, memory, and language. Major topics in cognitive development are the study of language acquisition and the development of perceptual and motor skills. Piaget was one of the influential early psychologists to study the development of cognitive abilities. His theory suggests that development proceeds through a set of stages from infancy to adulthood and that there is an end point or goal.\n\nOther accounts, such as that of [[Lev Vygotsky]], have suggested that development does not progress through stages, but rather that the developmental process that begins at birth and continues until death is too complex for such structure and finality. Rather, from this viewpoint, developmental processes proceed more continuously. Thus, development should be analyzed, instead of treated as a product to obtain.\n\n[[K. Warner Schaie]] has expanded the study of cognitive development into adulthood. Rather than being stable from adolescence, Schaie sees adults as progressing in the application of their cognitive abilities.<ref>{{cite book | vauthors = Schaie KW | date = 1990 | chapter = Intellectual development in adulthood. | veditors = Birren JE, Schaie KW | title = Handbook of the psychology of aging | edition = 3rd | pages = 291–309 | location = New York | publisher = Academic Press }}</ref>\n\nModern cognitive development has integrated the considerations of [[cognitive psychology]] and the psychology of [[individual differences]] into the interpretation and modeling of development.<ref name=\"demetriou\">{{cite book | vauthors = Demetriou A | date = 1998 | chapter = Cognitive development. | veditors = Demetriou A, Doise W, van Lieshout KF | title = Life-span developmental psychology | pages = 179–269 | location = London | publisher =  Wiley }}</ref> Specifically, [[the neo-Piagetian theories of cognitive development]] showed that the successive levels or stages of cognitive development are associated with increasing processing efficiency and [[working memory]] capacity. These increases explain differences between stages, progression to higher stages, and individual differences of children who are the same-age and of the same grade-level. However, other theories have moved away from Piagetian stage theories, and are influenced by accounts of [[domain-specific]] information processing, which posit that development is guided by innate evolutionarily-specified and content-specific information processing mechanisms.\n\n===Social and emotional development===\n{{Main|Social-emotional development in childhood|Social psychology}}\nDevelopmental psychologists who are interested in social development examine how individuals develop social and emotional competencies. For example, they study how children form friendships, how they understand and deal with emotions, and how identity develops. Research in this area may involve study of the relationship between cognition or cognitive development and social behavior.\n\n[[Emotional self-regulation|Emotional regulation]] or ER refers to an individual's ability to modulate emotional responses across a variety of contexts. In young children, this modulation is in part controlled externally, by parents and other authority figures. As children develop, they take on more and more responsibility for their internal state. Studies have shown that the development of ER is affected by the emotional regulation children observe in parents and caretakers, the emotional climate in the home, and the reaction of parents and caretakers to the child's emotions.<ref name=\"pmid19756175\">{{cite journal | vauthors = Morris AS, Silk JS, Steinberg L, Myers SS, Robinson LR | title = The Role of the Family Context in the Development of Emotion Regulation | journal = Social Development (Oxford, England) | volume = 16 | issue = 2 | pages = 361–388 | date = May 2007 | pmid = 19756175 | pmc = 2743505 | doi = 10.1111/j.1467-9507.2007.00389.x | url = http://www.saylor.org/site/wp-content/uploads/2012/01/PSYCH305-11.2.pdf }}</ref>\n\nMusic also has an influence on stimulating and enhancing the senses of a child through self-expression.<ref>{{cite book | vauthors = Oaklander V |title=Hidden Treasure: A Map to the Child's Inner Self |date=November 2006 |publisher=Routledge |isbn=978-1-85575-490-4}}</ref>\n\nA child's social and emotional development can be disrupted by motor coordination problems, evidenced by the environmental stress hypothesis. The environmental hypothesis explains how children with coordination problems and [[developmental coordination disorder]] are exposed to several psychosocial consequences which act as secondary stressors, leading to an increase in [[Internalizing disorder|internalizing symptoms]] such as depression and anxiety.<ref name=\"ReferenceA\">{{cite journal | vauthors = Cairney J, Veldhuizen S, Szatmari P | title = Motor coordination and emotional-behavioral problems in children | journal = Current Opinion in Psychiatry | volume = 23 | issue = 4 | pages = 324–329 | date = July 2010 | pmid = 20520549 | doi = 10.1097/YCO.0b013e32833aa0aa | s2cid = 8992773 }}</ref> Motor coordination problems affect fine and gross motor movement as well as perceptual-motor skills. Secondary stressors commonly identified include the tendency for children with poor motor skills to be less likely to participate in organized play with other children and more likely to feel socially [[isolates|isolated]].<ref name=\"ReferenceA\" />\n\nSocial and emotional development focuses on five keys areas: Self-Awareness, Self Management, Social Awareness, Relationship Skills and Responsible Decision Making.<ref>{{Cite web|title = SEL Competencies|url = http://www.casel.org/social-and-emotional-learning/core-competencies|website = CASEL|access-date = 2015-10-22|archive-date = 2015-09-19|archive-url = https://web.archive.org/web/20150919011115/http://www.casel.org/social-and-emotional-learning/core-competencies/|url-status = dead}}</ref>\n\n===Physical development===\nPhysical development concerns the physical maturation of an individual's body until it reaches the adult stature. Although physical growth is a highly regular process, all children differ tremendously in the timing of their growth spurts.<ref name=\"Eaton\">{{cite book | vauthors = Eaton WO | title = Physical Maturation | publisher = University of Manitoba | location = Winnipeg, Canada <!-- | access-date = 16 March 2012 --> }}</ref> Studies are being done to analyze how the differences in these timings affect and are related to other variables of developmental psychology such as information processing speed. Traditional measures of physical maturity using x-rays are less in practice nowadays, compared to simple measurements of body parts such as height, weight, head circumference, and arm span.<ref name=\"Eaton\" />\n\nA few other studies and practices with physical developmental psychology are the phonological abilities of mature 5- to 11-year-olds, and the controversial hypotheses of left-handers being maturationally delayed compared to right-handers. A study by Eaton, Chipperfield, Ritchot, and Kostiuk in 1996 found in three different samples that there was no difference between right- and left-handers.<ref name=\"Eaton\" />\n\n===Memory development===\nResearchers interested in memory development look at the way our memory develops from childhood and onward. According to [[fuzzy-trace theory]], a theory of [[cognition]] originally proposed by [[Valerie F. Reyna]] and [[Charles Brainerd]], people have two separate memory processes: verbatim and gist. These two traces begin to develop at different times as well as at a different pace. Children as young as four years old have verbatim memory, memory for surface information, which increases up to early adulthood, at which point it begins to decline. On the other hand, our capacity for gist memory, memory for semantic information, increases up to early adulthood, at which point it is consistent through old age. Furthermore, one's reliance on gist memory traces increases as one ages.<ref name=\"Fuzzy-trace theory and children's false memories\">{{cite journal | vauthors = Brainerd CJ, Reyna VF | title = Fuzzy-trace theory and children's false memories | journal = Journal of Experimental Child Psychology | volume = 71 | issue = 2 | pages = 81–129 | date = November 1998 | pmid = 9843617 | doi = 10.1006/jecp.1998.2464 | s2cid = 12290995 }}</ref>\n\n", "goals": ["The student will be able to describe the development of the brain and its neural networks, and the role of genetics, environment, and experiences in shaping this development", "The student will be able to describe the development of cognitive abilities, such as problem-solving, memory, and language, and the role of genetics, environment, and experiences in shaping this development", "The student will be able to describe the development of social and emotional competencies, such as self-awareness, self-management, social awareness, relationship skills, and responsible decision-making, and the role of genetics, environment, and experiences in shaping this development", "The student will be able to describe the development of physical maturation, and the role of genetics, environment, and experiences in shaping this development", "The student will be able to describe the development of memory, and the role of genetics, environment, and experiences in shaping this development"]}, {"title": "Neural Development", "content": "One critical aspect of developmental psychology is the study of neural development, which investigates how the brain changes and develops during different stages of life. Neural development focuses on how the brain changes and develops during different stages of life. Studies have shown that the human brain undergoes rapid changes during prenatal and early postnatal periods. These changes include the formation of neurons, the development of neural networks, and the establishment of synaptic connections.<ref>{{Cite journal |title=Regional differences in synaptogenesis in human cerebral cortex |journal=The Journal of Comparative Neurology | year=1997 |doi=10.1002/(sici)1096-9861(19971020)387:2<167::aid-cne1>3.0.co;2-z| pmid=9336221 | last1=Huttenlocher | first1=P. R. | last2=Dabholkar | first2=A. S. | volume=387 | issue=2 | pages=167–178 | s2cid=7751299 | doi-access=free }}</ref> The formation of neurons and the establishment of basic neural circuits in the developing brain are crucial for laying the foundation of the brain's structure and function, and disruptions during this period can have long-term effects on cognitive and emotional development.<ref>{{Cite journal |last=Johnson |first=Mark H. |date=July 2001 |title=Functional brain development in humans |url=https://www.nature.com/articles/35081509 |journal=Nature Reviews Neuroscience |language=en |volume=2 |issue=7 |pages=475–483 |doi=10.1038/35081509 |pmid=11433372 |s2cid=188729 |issn=1471-0048}}</ref>\n\nExperiences and environmental factors play a crucial role in shaping neural development. Early sensory experiences, such as exposure to language and visual stimuli, can influence the development of neural pathways related to perception and language processing.<ref>{{Cite journal |last1=Werker |first1=Janet F. |last2=Hensch |first2=Takao K. |date=2015-01-03 |title=Critical Periods in Speech Perception: New Directions |journal=Annual Review of Psychology |language=en |volume=66 |issue=1 |pages=173–196 |doi=10.1146/annurev-psych-010814-015104 |pmid=25251488 |s2cid=27047922 |issn=0066-4308|doi-access=free }}</ref>\n\nGenetic factors play a huge roll in neural development. Genetic factors can influence the timing and pattern of neural development, as well as the susceptibility to certain developmental disorders, such as autism spectrum disorder and attention-deficit/hyperactivity disorder.<ref>{{Cite journal |last1=Geschwind |first1=Daniel H. |last2=Rakic |first2=Pasko |date=2013-10-30 |title=Cortical Evolution: Judge the Brain by Its Cover |journal=Neuron |language=English |volume=80 |issue=3 |pages=633–647 |doi=10.1016/j.neuron.2013.10.045 |issn=0896-6273 |pmc=3922239 |pmid=24183016}}</ref>\n\nResearch finds that the adolescent brain undergoes significant changes in neural connectivity and plasticity. During this period, there is a pruning process where certain neural connections are strengthened while others are eliminated, resulting in more efficient neural networks and increased cognitive abilities, such as decision-making and impulse control.<ref>{{Cite journal |last1=Blakemore |first1=Sarah-Jayne |last2=Choudhury |first2=Suparna |date=March 2006 |title=Development of the adolescent brain: implications for executive function and social cognition |journal=Journal of Child Psychology and Psychiatry |language=en |volume=47 |issue=3–4 |pages=296–312 |doi=10.1111/j.1469-7610.2006.01611.x |pmid=16492261 |s2cid=145456431 |issn=0021-9630|doi-access=free }}</ref>\n\nThe study of neural development provides crucial insights into the complex interplay between genetics, environment, and experiences in shaping the developing brain. By understanding the neural processes underlying developmental changes, researchers gain a better understanding of cognitive, emotional, and social development in humans.\n\n", "goals": ["The student will be able to identify the role of genetics, environment, and experiences in shaping neural development", "The student will be able to explain the process of neural development and the role of neural networks in cognitive and emotional development", "The student will be able to describe the changes in neural development during prenatal and early postnatal periods, and the role of sensory experiences in shaping neural pathways related to perception and language processing", "The student will be able to distinguishthe role of genetic factors in neural development and the susceptibility to certain developmental disorders, such as autism spectrum disorder and attention-deficit/hyperactivity disorder", "The student will be able to explain the changes in neural development during adolescence, the pruning process, and the role of neural networks in increasing cognitive abilities, such as decision-making and impulse control"]}, {"title": "Cognitive development", "content": "{{Main|Cognitive development|Theory of cognitive development|Neo-Piagetian theories of cognitive development}}\nCognitive development is primarily concerned with the ways that infants and children acquire, develop, and use internal mental capabilities such as: problem-solving, memory, and language. Major topics in cognitive development are the study of language acquisition and the development of perceptual and motor skills. Piaget was one of the influential early psychologists to study the development of cognitive abilities. His theory suggests that development proceeds through a set of stages from infancy to adulthood and that there is an end point or goal.\n\nOther accounts, such as that of [[Lev Vygotsky]], have suggested that development does not progress through stages, but rather that the developmental process that begins at birth and continues until death is too complex for such structure and finality. Rather, from this viewpoint, developmental processes proceed more continuously. Thus, development should be analyzed, instead of treated as a product to obtain.\n\n[[K. Warner Schaie]] has expanded the study of cognitive development into adulthood. Rather than being stable from adolescence, Schaie sees adults as progressing in the application of their cognitive abilities.<ref>{{cite book | vauthors = Schaie KW | date = 1990 | chapter = Intellectual development in adulthood. | veditors = Birren JE, Schaie KW | title = Handbook of the psychology of aging | edition = 3rd | pages = 291–309 | location = New York | publisher = Academic Press }}</ref>\n\nModern cognitive development has integrated the considerations of [[cognitive psychology]] and the psychology of [[individual differences]] into the interpretation and modeling of development.<ref name=\"demetriou\">{{cite book | vauthors = Demetriou A | date = 1998 | chapter = Cognitive development. | veditors = Demetriou A, Doise W, van Lieshout KF | title = Life-span developmental psychology | pages = 179–269 | location = London | publisher =  Wiley }}</ref> Specifically, [[the neo-Piagetian theories of cognitive development]] showed that the successive levels or stages of cognitive development are associated with increasing processing efficiency and [[working memory]] capacity. These increases explain differences between stages, progression to higher stages, and individual differences of children who are the same-age and of the same grade-level. However, other theories have moved away from Piagetian stage theories, and are influenced by accounts of [[domain-specific]] information processing, which posit that development is guided by innate evolutionarily-specified and content-specific information processing mechanisms.\n\n", "goals": ["The student will be able to identify and describe the different theories of cognitive development, including those of Piaget, Vygotsky, and Schaie", "The student will be able to identify and describe the different stages of cognitive development, including those of Piaget, Vygotsky, and Schaie", "The student will be able to identify and describe the different factors that influence cognitive development, including genetics, environment, and culture", "The student will be able to identify and describe the different ways in which cognitive development is measured, including through cognitive tests, observational studies, and interviews", "The student will be able to identify and describe the different ways in which cognitive development can be enhanced, including through cognitive training, cognitive stimulation, and cognitive enrichment"]}, {"title": "Physical development", "content": "Physical development concerns the physical maturation of an individual's body until it reaches the adult stature. Although physical growth is a highly regular process, all children differ tremendously in the timing of their growth spurts.<ref name=\"Eaton\">{{cite book | vauthors = Eaton WO | title = Physical Maturation | publisher = University of Manitoba | location = Winnipeg, Canada <!-- | access-date = 16 March 2012 --> }}</ref> Studies are being done to analyze how the differences in these timings affect and are related to other variables of developmental psychology such as information processing speed. Traditional measures of physical maturity using x-rays are less in practice nowadays, compared to simple measurements of body parts such as height, weight, head circumference, and arm span.<ref name=\"Eaton\" />\n\nA few other studies and practices with physical developmental psychology are the phonological abilities of mature 5- to 11-year-olds, and the controversial hypotheses of left-handers being maturationally delayed compared to right-handers. A study by Eaton, Chipperfield, Ritchot, and Kostiuk in 1996 found in three different samples that there was no difference between right- and left-handers.<ref name=\"Eaton\" />\n\n", "goals": ["The student will be able to identify the physical development of an individual and its relation to other variables of developmental psychology", "The student will be able to explain the importance of physical maturity in the development of an individual", "The student will be able to describe the differences in physical growth spurts and how they affect other variables of developmental psychology", "The student will be able to compare the traditional measures of physical maturity using x-rays and the simple measurements of body parts such as height, weight, head circumference, and arm span", "The student will be able to distinguishthe phonological abilities of mature 5- to 11-year-olds and the hypotheses of left-handers being maturationally delayed compared to right-handers"]}, {"title": "Memory development", "content": "Researchers interested in memory development look at the way our memory develops from childhood and onward. According to [[fuzzy-trace theory]], a theory of [[cognition]] originally proposed by [[Valerie F. Reyna]] and [[Charles Brainerd]], people have two separate memory processes: verbatim and gist. These two traces begin to develop at different times as well as at a different pace. Children as young as four years old have verbatim memory, memory for surface information, which increases up to early adulthood, at which point it begins to decline. On the other hand, our capacity for gist memory, memory for semantic information, increases up to early adulthood, at which point it is consistent through old age. Furthermore, one's reliance on gist memory traces increases as one ages.<ref name=\"Fuzzy-trace theory and children's false memories\">{{cite journal | vauthors = Brainerd CJ, Reyna VF | title = Fuzzy-trace theory and children's false memories | journal = Journal of Experimental Child Psychology | volume = 71 | issue = 2 | pages = 81–129 | date = November 1998 | pmid = 9843617 | doi = 10.1006/jecp.1998.2464 | s2cid = 12290995 }}</ref>\n\n", "goals": ["The student will be able to describe the development of memory from childhood to old age, and understand the difference between verbatim and gist memory", "The student will be able to describe the development of memory from childhood to old age, and understand the difference between verbatim and gist memory", "The student will be able to describe the development of memory from childhood to old age, and understand the difference between verbatim and gist memory", "The student will be able to describe the development of memory from childhood to old age, and understand the difference between verbatim and gist memory", "The student will be able to describe the development of memory from childhood to old age, and understand the difference between verbatim and gist memory"]}, {"title": "Research methods and designs", "content": "===Main research methods===\nDevelopmental psychology employs many of the [[psychological research methods|research methods]] used in other areas of psychology. However, infants and children cannot be tested in the same ways as adults, so different methods are often used to study their development.\n\nDevelopmental psychologists have a number of methods to study changes in individuals over time. Common research methods include systematic observation, including [[naturalistic observation]] or structured observation; self-reports, which could be clinical interviews or [[structured interviews]]; clinical or [[case study]] method; and [[ethnography]] or participant observation.<ref name=Berk>{{cite book |title=Infants and children: Prenatal through middle childhood | vauthors = Berk LE |edition=7 |year=2012 |publisher=Allyn & Bacon }}</ref>{{rp|31–35}} These methods differ in the extent of control researchers impose on study conditions, and how they construct ideas about which variables to study.<ref name=Bruning>{{cite book| vauthors = Moshman D, Glover JA, Bruning RH |title=Developmental psychology : a topical approach|year=1987|publisher=Little, Brown|location=Boston|isbn=978-0-316-58561-3|pages=82–96}}</ref> Every developmental investigation can be characterized in terms of whether its underlying strategy involves the ''experimental'', ''correlational'', or ''case study'' approach.<ref name=Achenbach>{{cite book| vauthors = Achenbach TM |title=Research in development psychology.|year=1978|publisher=Free Pr. [usw.]|location=New York [usw.]|isbn=978-0-02-900180-6|pages=74–104}}</ref><ref name=Prentice-Hall>{{cite book| vauthors = Marmor RM, Liebert R, Wicks P, Gloria S |title=Developmental psychology|year=1977|publisher=Prentice-Hall|location=Englewood Cliffs, N.J.|isbn=978-0-13-208231-0|pages=20–37|edition=2d}}</ref> The [[experimental method]] involves \"actual manipulation of various treatments, circumstances, or events to which the participant or subject is exposed;<ref name=Prentice-Hall /> the ''experimental design'' points to [[Causality|cause-and-effect relationships]].<ref name=Shaffer>{{cite book| vauthors = Shaffer DR |title=Social and personality development|year=2009|publisher=Wadsworth|location=Australia|isbn=978-0-495-60038-1|pages=21–36|edition=6th}}</ref> This method allows for strong inferences to be made of causal relationships between the manipulation of one or more [[independent variables]] and subsequent behavior, as measured by the [[dependent variable]].<ref name=Prentice-Hall /> The advantage of using this research method is that it permits determination of cause-and-effect relationships among variables.<ref name=Shaffer /> On the other hand, the limitation is that data obtained in an artificial environment may lack generalizability.<ref name=Shaffer /> The correlational method explores the relationship between two or more events by gathering information about these variables without researcher intervention.<ref name=Prentice-Hall /><ref name=Shaffer /> The advantage of using a correlational design is that it estimates the strength and direction of relationships among variables in the natural environment;<ref name=Shaffer /> however, the limitation is that it does not permit determination of cause-and-effect relationships among variables.<ref name=Shaffer /> The [[case study]] approach allows investigations to obtain an in-depth understanding of an individual participant by collecting data based on [[interviews]], structured questionnaires, observations, and test scores.<ref name=Shaffer /> Each of these methods have its strengths and weaknesses but the experimental method when appropriate is the preferred method of developmental scientists because it provides a controlled situation and conclusions to be drawn about cause-and-effect relationships.<ref name=Prentice-Hall />\n\n===Research designs===\nMost developmental studies, regardless of whether they employ the experimental, correlational, or case study method, can also be constructed using research designs.<ref name=Bruning /> Research designs are logical frameworks used to make key comparisons within research studies such as:\n* [[cross-sectional design]]\n* [[longitudinal design]]\n* [[cohort study|sequential design]]\n* [[microgenetic design]]\n\nIn a [[longitudinal study]], a researcher observes many individuals born at or around the same time (a [[cohort (statistics)|cohort]]) and carries out new observations as members of the cohort age. This method can be used to draw conclusions about which types of development are universal (or [[norm (sociology)|normative]]) and occur in most members of a cohort. As an example a longitudinal study of early literacy development examined in detail the early literacy experiences of one child in each of 30 families.<ref>[http://www.jweducation.com/PhDabstractsummary.html A Longitudinal Study of Early Literacy Development and the Changing Perceptions of Parents and Teachers] {{Webarchive|url=https://web.archive.org/web/20110429145255/http://www.jweducation.com/PhDabstractsummary.html |date=2011-04-29 }}, John Worthington, 2001</ref>\n\nResearchers may also observe ways that development varies between individuals, and hypothesize about the causes of variation in their data. Longitudinal studies often require large amounts of time and funding, making them unfeasible in some situations. Also, because members of a cohort all experience historical events unique to their generation, apparently normative developmental trends may, in fact, be universal only to their cohort.<ref name=Berk />{{rp|40}}\n\nIn a [[cross-sectional study]], a researcher observes differences between individuals of different ages at the same time. This generally requires fewer resources than the longitudinal method, and because the individuals come from different cohorts, shared historical events are not so much of a [[lurking variable|confounding factor]]. By the same token, however, cross-sectional research may not be the most effective way to study differences between participants, as these differences may result not from their different ages but from their exposure to ''different'' historical events.<ref name=Berk />{{rp|41}}\n\nA third study design, the [[cohort study|sequential design]], combines both methodologies. Here, a researcher observes members of different birth cohorts at the same time, and then tracks all participants over time, charting changes in the groups. While much more resource-intensive, the format aids in a clearer distinction between what changes can be attributed to an individual or historical environment from those that are truly universal.<ref name=Berk />{{rp|42}}\n\nBecause every method has some weaknesses, developmental psychologists rarely rely on one study or even one method to reach conclusions by finding consistent evidence from as many converging sources as possible.<ref name=Prentice-Hall />\n\n", "goals": ["The student will be able to identify and describe the different research methods used in developmental psychology, including systematic observation, self-reports, clinical or case study method, and ethnography or participant observation", "The student will be able to identify and describe the different research designs used in developmental psychology, including cross-sectional design, longitudinal design, and cohort study or sequential design", "The student will be able to identify and describe the different types of research designs used in developmental psychology, including cross-sectional design, longitudinal design, and cohort study or sequential design", "The student will be able to identify and describe the different types of research methods used in developmental psychology, including systematic observation, self-reports, clinical or case study method, and ethnography or participant observation", "The student will be able to identify and describe the different types of research methods used in developmental psychology, including systematic observation, self-reports, clinical or case study method, and ethnography or participant observation"]}, {"title": "Main research methods", "content": "Developmental psychology employs many of the [[psychological research methods|research methods]] used in other areas of psychology. However, infants and children cannot be tested in the same ways as adults, so different methods are often used to study their development.\n\nDevelopmental psychologists have a number of methods to study changes in individuals over time. Common research methods include systematic observation, including [[naturalistic observation]] or structured observation; self-reports, which could be clinical interviews or [[structured interviews]]; clinical or [[case study]] method; and [[ethnography]] or participant observation.<ref name=Berk>{{cite book |title=Infants and children: Prenatal through middle childhood | vauthors = Berk LE |edition=7 |year=2012 |publisher=Allyn & Bacon }}</ref>{{rp|31–35}} These methods differ in the extent of control researchers impose on study conditions, and how they construct ideas about which variables to study.<ref name=Bruning>{{cite book| vauthors = Moshman D, Glover JA, Bruning RH |title=Developmental psychology : a topical approach|year=1987|publisher=Little, Brown|location=Boston|isbn=978-0-316-58561-3|pages=82–96}}</ref> Every developmental investigation can be characterized in terms of whether its underlying strategy involves the ''experimental'', ''correlational'', or ''case study'' approach.<ref name=Achenbach>{{cite book| vauthors = Achenbach TM |title=Research in development psychology.|year=1978|publisher=Free Pr. [usw.]|location=New York [usw.]|isbn=978-0-02-900180-6|pages=74–104}}</ref><ref name=Prentice-Hall>{{cite book| vauthors = Marmor RM, Liebert R, Wicks P, Gloria S |title=Developmental psychology|year=1977|publisher=Prentice-Hall|location=Englewood Cliffs, N.J.|isbn=978-0-13-208231-0|pages=20–37|edition=2d}}</ref> The [[experimental method]] involves \"actual manipulation of various treatments, circumstances, or events to which the participant or subject is exposed;<ref name=Prentice-Hall /> the ''experimental design'' points to [[Causality|cause-and-effect relationships]].<ref name=Shaffer>{{cite book| vauthors = Shaffer DR |title=Social and personality development|year=2009|publisher=Wadsworth|location=Australia|isbn=978-0-495-60038-1|pages=21–36|edition=6th}}</ref> This method allows for strong inferences to be made of causal relationships between the manipulation of one or more [[independent variables]] and subsequent behavior, as measured by the [[dependent variable]].<ref name=Prentice-Hall /> The advantage of using this research method is that it permits determination of cause-and-effect relationships among variables.<ref name=Shaffer /> On the other hand, the limitation is that data obtained in an artificial environment may lack generalizability.<ref name=Shaffer /> The correlational method explores the relationship between two or more events by gathering information about these variables without researcher intervention.<ref name=Prentice-Hall /><ref name=Shaffer /> The advantage of using a correlational design is that it estimates the strength and direction of relationships among variables in the natural environment;<ref name=Shaffer /> however, the limitation is that it does not permit determination of cause-and-effect relationships among variables.<ref name=Shaffer /> The [[case study]] approach allows investigations to obtain an in-depth understanding of an individual participant by collecting data based on [[interviews]], structured questionnaires, observations, and test scores.<ref name=Shaffer /> Each of these methods have its strengths and weaknesses but the experimental method when appropriate is the preferred method of developmental scientists because it provides a controlled situation and conclusions to be drawn about cause-and-effect relationships.<ref name=Prentice-Hall />\n\n", "goals": ["The student will be able to identify and describe the different research methods used in developmental psychology, including systematic observation, self-reports, clinical or case study method, and ethnography or participant observation", "The student will be able to identify and describe the different types of strategies used in developmental psychology, including the experimental method, the correlational method, and the case study approach", "The student will be able to identify and describe the advantages and limitations of using the experimental method, the correlational method, and the case study approach in developmental psychology", "The student will be able to identify and describe the different types of variables used in developmental psychology, including independent variables and dependent variables", "The student will be able to identify and describe the different types of inferences that can be made using the experimental method, the correlational method, and the case study approach in developmental psychology"]}, {"title": "Life stages of psychological development", "content": "<!--THIS SECTION NEEDS WORK!-->\n{{See also|Child development stages}}\n===Prenatal development===\n{{Main|Prenatal development}}\n{{See also|Fetal psychology}}\nPrenatal development is of interest to psychologists investigating the context of early psychological development. The whole prenatal development involves three main stages: germinal stage, embryonic stage and fetal stage. Germinal stage begins at conception until 2 weeks; embryonic stage means the development from 2 weeks to 8 weeks; fetal stage represents 9 weeks until birth of the baby.<ref>{{Cite book| vauthors = Berk LE |url=https://www.worldcat.org/oclc/946161390|title=Development Through the Lifespan|publisher=Pearson Education|year=2018|isbn=978-0-13-441969-5|edition=Seventh|location=Hoboken, NJ|pages=76–81|oclc=946161390}}</ref> The senses develop in the womb itself: a fetus can both see and hear by the second trimester (13 to 24 weeks of age). The sense of touch develops in the embryonic stage (5 to 8 weeks).<ref name=Berk />{{rp|97}} Most of the brain's billions of neurons also are developed by the second trimester.<ref name=Berk />{{rp|100}} Babies are hence born with some odor, taste and sound preferences, largely related to the mother's environment.<ref name=Berk />{{rp|101}}\n\nSome [[primitive reflexes]] too arise before birth and are still present in newborns. One hypothesis is that these reflexes are vestigial and have limited use in early human life. [[Piaget's theory of cognitive development]] suggested that some early reflexes are building blocks for infant sensorimotor development. For example, the [[tonic neck reflex]] may help development by bringing objects into the infant's field of view.<ref name=\"butterworth\">{{Cite book | vauthors = Butterworth G, Harris M |title=Principles of Developmental Psychology |year=1994 |publisher=Lawrence Erlbaum Associates |isbn=978-0-86377-280-1 |url-access=registration |url=https://archive.org/details/principlesofdeve0000butt }}</ref>\n\nOther reflexes, such as the [[walking reflex]], appear to be replaced by more sophisticated voluntary control later in infancy. This may be because the infant gains too much weight after birth to be strong enough to use the reflex, or because the reflex and subsequent development are functionally different.<ref name=\"bremner\">{{Cite book | vauthors = Bremner JG |title=Infancy |year=1994 |publisher=Blackwell |edition=2 |isbn=978-0-631-18466-9 |url=https://archive.org/details/infancy0000brem_s1x4 }}</ref> It has also been suggested that some reflexes (for example the [[moro reflex|moro]] and [[walking reflex]]es) are predominantly adaptations to life in the womb with little connection to early infant development.<ref name=\"butterworth\" /> Primitive reflexes reappear in adults under certain conditions, such as neurological conditions like [[dementia]] or traumatic lesions.\n\n[[Ultrasound|Ultrasounds]] have shown that infants are capable of a range of movements in the womb, many of which appear to be more than simple reflexes.<ref name=\"bremner\" /> By the time they are born, infants can recognize and have a preference for their mother's voice suggesting some prenatal development of auditory perception.<ref name=\"bremner\" /> Prenatal development and birth complications may also be connected to neurodevelopmental disorders, for example in [[schizophrenia]]. With the advent of [[cognitive neuroscience]], [[embryology]] and the neuroscience of prenatal development is of increasing interest to developmental psychology research.\n\nSeveral environmental agents—[[teratogens]]—can cause damage during the prenatal period. These include prescription and nonprescription drugs, illegal drugs, tobacco, alcohol, environmental pollutants, infectious disease agents such as the [[rubella]] virus and the [[toxoplasmosis]] parasite, maternal malnutrition, maternal emotional stress, and Rh factor blood incompatibility between mother and child.<ref name=Berk />{{rp|102–115}} There are many statistics which prove the effects of the aforementioned substances. A leading example of this would be that at least 100,000 \"cocaine babies\" were born in the United States annually in the late 1980s.  \"Cocaine babies\" are proven to have quite severe and lasting difficulties which persist throughout infancy and right throughout childhood. The drug also encourages behavioural problems in the affected children and defects of various vital organs.<ref>{{Cite news|title=One of five expectant mothers use cocaine, U.S. study finds|agency = Associated Press |work=Toronto star |issn=0319-0781 |date=1989-01-20 }}</ref>\n\n===Infancy===\n{{Main|Infant and child psychology|Infant cognitive development}}\nFrom birth until the first year, children are referred to as [[infant|infants]]. As they grow, children respond to their environment in unique ways.<ref name=Berk /> Developmental psychologists vary widely in their assessment of infant psychology, and the influence the outside world has upon it.\n\nThe majority of a newborn infant's time is spent sleeping.<ref>{{Cite journal |last1=Hirshkowitz |first1=Max |last2=Whiton |first2=Kaitlyn |last3=Albert |first3=Steven M. |last4=Alessi |first4=Cathy |last5=Bruni |first5=Oliviero |last6=DonCarlos |first6=Lydia |last7=Hazen |first7=Nancy |last8=Herman |first8=John |last9=Katz |first9=Eliot S. |last10=Kheirandish-Gozal |first10=Leila |last11=Neubauer |first11=David N. |last12=O’Donnell |first12=Anne E. |last13=Ohayon |first13=Maurice |last14=Peever |first14=John |last15=Rawding |first15=Robert |date=2015-03-01 |title=National Sleep Foundation's sleep time duration recommendations: methodology and results summary |url=https://www.sleephealthjournal.org/article/S2352-7218%252815%252900015-7/fulltext |journal=Sleep Health: Journal of the National Sleep Foundation |language=English |volume=1 |issue=1 |pages=40–43 |doi=10.1016/j.sleh.2014.12.010 |issn=2352-7218 |pmid=29073412|s2cid=205190733 }}</ref> At first, their sleep cycles are evenly spread throughout the day and night, but after a couple of months, infants generally become [[diurnal animal|diurnal]].<ref name=\":2\">{{Citation |last1=Patel |first1=Aakash K. |title=Physiology, Sleep Stages |date=2023 |url=http://www.ncbi.nlm.nih.gov/books/NBK526132/ |work=StatPearls |access-date=2023-12-28 |place=Treasure Island (FL) |publisher=StatPearls Publishing |pmid=30252388 |last2=Reddy |first2=Vamsi |last3=Shumway |first3=Karlie R. |last4=Araujo |first4=John F.}}</ref> In human or rodent infants, there is always the observation of a diurnal cortisol rhythm, which is sometimes entrained with a maternal substance.<ref name=\":3\">{{Cite journal |last1=Iwata |first1=Osuke |last2=Okamura |first2=Hisayoshi |last3=Saitsu |first3=Hiroki |last4=Saikusa |first4=Mamoru |last5=Kanda |first5=Hiroshi |last6=Eshima |first6=Nobuoki |last7=Iwata |first7=Sachiko |last8=Maeno |first8=Yasuki |last9=Matsuishi |first9=Toyojiro |date=Jan 2013 |title=Diurnal cortisol changes in newborn infants suggesting entrainment of peripheral circadian clock in utero and at birth |journal=The Journal of Clinical Endocrinology and Metabolism |volume=98 |issue=1 |pages=E25–32 |doi=10.1210/jc.2012-2750 |issn=1945-7197 |pmid=23150686|doi-access=free }}</ref> Nevertheless the circadian rhythm starts to take shape, and a 24-hour rhythm is observed in just some few months after birth.<ref name=\":2\" /><ref name=\":3\" />\n\nInfants can be seen to have six states, grouped into pairs:\n* quiet sleep and active sleep ([[dream]]ing, when [[REM sleep]] occurs). Generally, there are various reasons as to why infants dream. Some argue that it is just a psychotherapy, which usually occurs normally in the brain. Dreaming is a form of processing and consolidating information that has been obtained during the day. Freud argues that dreams are a way of representing unconscious desires.<ref>{{cite journal |last1=Zhang |first1=Wei |last2=Guo |first2=Benyu |title=Freud's Dream Interpretation: A Different Perspective Based on the Self-Organization Theory of Dreaming |journal=Frontiers in Psychology |date=2018 |volume=9 |page=1553 |doi=10.3389/fpsyg.2018.01553 |pmid=30190698 |pmc=6115518 |doi-access=free }}</ref>\n* quiet waking, and active waking\n* fussing and [[crying]]. In a normal set up, infants have different reasons as to why they cry. Mostly, infants cry due to physical discomfort, hunger, or to receive attention or stimulation from their caregiver.<ref>{{Cite web |date=2020-12-07 |title=Soothing a crying baby |url=https://www.nhs.uk/conditions/baby/caring-for-a-newborn/soothing-a-crying-baby/ |access-date=2023-12-28 |website=nhs.uk |language=en}}</ref>\n\n====Infant perception====\nInfant perception is what a newborn can see, hear, smell, taste, and touch. These five features are considered as the \"five senses\".<ref>{{cite book | vauthors = Bee D, Boyd H |title=The developing child |publisher=Pearson Education |location=Upper Saddle River, N.J. |isbn=978-0-205-25602-0 |page=36 |edition=13th|date=2011-12-12 }}</ref> Because of these different senses, infants respond to stimuli differently.<ref name=\"bremner\" />\n\n* [[Visual perception|Vision]] is significantly worse in infants than in older children. Infant sight tends to be blurry in early stages but improves over time. Color perception, similar to that seen in adults, has been demonstrated in infants as young as four months using habituation methods.<ref name=\"butterworth\" /> Infants attain adult-like vision at about six months.<ref name=\"Berk\" />{{rp|191}}\n* [[Hearing (sense)|Hearing]] is well-developed prior to birth. Newborns prefer complex sounds to pure tones, human speech to other sounds, mother's voice to other voices, and the native language to other languages. Scientist believe these features are probably learned in the womb.<ref name=\"Berk\" />{{rp|151}} Infants are fairly good at detecting the direction a sound comes from, and by 18 months their hearing ability is approximately equal to an adult's.\n* [[Olfaction|Smell]] and [[taste]] are present, with infants showing different expressions of disgust or pleasure when presented with pleasant odors (honey, milk, etc.) or unpleasant odors (rotten egg) and tastes (e.g. sour taste). Newborns are born with odor and taste preferences acquired in the womb from the smell and taste of amniotic fluid, in turn influenced by what the mother eats. Both breast- and bottle-fed babies around three days old prefer the smell of human milk to that of formula, indicating an innate preference.<ref name=\"Berk\" />{{rp|150}} Older infants also prefer the smell of their mother to that of others.<ref name=\"butterworth\" />\n* [[Haptic perception|Touch and feel]] is one of the better-developed senses at birth as it is one of the first senses to develop inside the womb.<ref>{{cite book | vauthors = Feldman RD, Papalia DE |title=A child's world: infancy through adolescence |year=2010 |publisher=McGraw-Hill |location=New York |isbn=978-0-07-353204-2 |page=57 |edition=12th}}</ref>  This is evidenced by the [[primitive reflexes]] described above, and the relatively advanced development of the [[somatosensory cortex]].<ref name=\"Slater\">{{cite book |title=Introduction to Infant Development | vauthors = Slater A, Lewis M |isbn=978-0-19-928305-7 |publisher=OUP |location=Oxford |year=2006}}</ref>\n* [[Pain]]: Infants feel pain similarly, if not more strongly than older children, but pain relief in infants has not received so much attention as an area of research.<ref name=\"MatthewMatthew\">{{cite journal | vauthors = Mathew PJ, Mathew JL | title = Assessment and management of pain in infants | journal = Postgraduate Medical Journal | volume = 79 | issue = 934 | pages = 438–443 | date = August 2003 | pmid = 12954954 | pmc = 1742785 | doi = 10.1136/pmj.79.934.438 }}</ref> Glucose is known to relieve pain in newborns.<ref name=\"DilenElseviers\">{{cite journal | vauthors = Dilen B, Elseviers M | title = Oral glucose solution as pain relief in newborns: results of a clinical trial | journal = Birth | volume = 37 | issue = 2 | pages = 98–105 | date = June 2010 | pmid = 20557532 | doi = 10.1111/j.1523-536X.2010.00389.x }}</ref>\n\n====Language====\n{{Main|Language development}}\nBabies are born with the ability to discriminate virtually all sounds of all human languages.<ref name=Berk />{{rp|189}} Infants of around six months can differentiate between [[phoneme]]s in their own language, but not between similar phonemes in another language. Notably, infants are able to differentiate between various durations and sound levels and can easily differentiate all the languages they have encountered, hence easy for infants to understand a certain language compared to an adult.<ref>{{Cite journal |last=Deuchar |first=Margaret |date=March 1998 |title=Paul Fletcher & Brian MacWhinney (eds.), ''The Handbook of Child Language''. Oxford: Blackwell, 1995. Pp. x+786. |url=http://dx.doi.org/10.1017/s0022226797256896 |journal=Journal of Linguistics |volume=34 |issue=1 |pages=227–297 |doi=10.1017/s0022226797256896 |issn=0022-2267}}</ref>\n\nAt this stage infants also start to [[Babbling|babble]], whereby they start making vowel consonant sound as they try to understand the true meaning of language and copy whatever they are hearing in their surrounding producing their own phonemes.\n\nIn various cultures, a distinct form of speech called \"babytalk\" is used when communicating with newborns and young children. This register consists of simplified terms for common topics such as family members, food, hygiene, and familiar animals. It also exhibits specific phonological patterns, such as substituting alveolar sounds with initial velar sounds, especially in languages like English. Furthermore, babytalk often involves morphological simplifications, such as regularizing verb conjugations (for instance, saying \"corned\" instead of \"cornered\" or \"goed\" instead of \"went\"). This language is typically taught to children and is perceived as their natural way of communication. Interestingly, in mythology and popular culture, certain characters, such as the \"Hausa trickster\" or the Warner Bros cartoon character \"Tweety Pie\", are portrayed as speaking in a babytalk-like manner.<ref>{{Cite journal |last1=Menn |first1=Lise |last2=Stoel-Gammon |first2=Carol |date=2017-08-18 |title=Phonological Development |url=http://dx.doi.org/10.1111/b.9780631203124.1996.00014.x |journal=The Handbook of Child Language |pages=335–360 |doi=10.1111/b.9780631203124.1996.00014.x|isbn=978-0-631-20312-4 }}</ref>\n\n===Infant cognition: the Piagetian era===\nPiaget suggested that an infant's perception and understanding of the world depended on their motor development, which was required for the infant to link visual, tactile and motor representations of objects.<ref>Lefmann, T. & Combs-Orme, T. 2013, \"Early Brain Development for Social Work Practice: Integrating Neuroscience with Piaget's Theory of Cognitive Development\", Journal of Human Behavior in the Social Environment, vol. 23, no. 5, pp. 640-647.</ref> According to this theory, infants develop [[object permanence]] through touching and handling objects. Infants start to understanding that objects continue to exist when out of sight.<ref name=\"bremner\" />\n\nPiaget's sensorimotor stage comprised six sub-stages (see [[Theory of cognitive development#Sensorimotor stage|sensorimotor stages]] for more detail). In the early stages, development arises out of movements caused by [[primitive reflexes]].<ref name=\"Gruber\">{{Cite book | vauthors = Piaget J |year=1977 |title=The essential Piaget \\| veditors = Gruber HE, Voneche JJ |location=New York |publisher=Basic Books |isbn=978-0-7100-8778-2}}</ref> Discovery of new behaviors results from [[classical conditioning|classical]] and [[operant conditioning]], and the formation of [[habit (psychology)|habits]].<ref name=\"Gruber\" /> From eight months the infant is able to uncover a hidden object but will persevere when the object is moved.\n\nPiaget concluded that infants lacked object permanence before 18 months when infants' before this age failed to look for an object where it had last been seen. Instead, infants continued to look for an object where it was first seen, committing the \"[[A-not-B error]]\". Some researchers have suggested that before the age of 8-9 months, infants' inability to understand object permanence extends to people, which explains why infants at this age do not cry when their mothers are gone (\"Out of sight, out of mind\").\n\n====Recent findings in infant cognition====\nIn the 1980s and 1990s, researchers developed new methods of assessing infants' understanding of the world with far more precision and subtlety than Piaget was able to do in his time. Since then, many studies based on these methods suggest that young infants understand far more about the world than first thought.\n\nBased on recent findings, some researchers (such as [[Elizabeth Spelke]] and [[Renee Baillargeon]]) have proposed that an understanding of object permanence is not learned at all, but rather comprises part of the innate cognitive capacities of our species.\n\nAccording to Jean Piaget's developmental psychology, object permanence, or the awareness that objects exist even when they are no longer visible, was thought to emerge gradually between the ages of 8 and 12 months. However, experts such as Elizabeth Spelke and Renee Baillargeon have questioned this notion. They studied infants' comprehension of object permanence at a young age using novel experimental approaches such as violation-of-expectation paradigms. These findings imply that children as young as 3 to 4 months old may have an innate awareness of object permanence. Baillargeon's \"drawbridge\" experiment, for example, showed that infants were surprised when they saw occurrences that contradicted object permanence expectations. This proposition has important consequences for our understanding of infant cognition, implying that infants may be born with core cognitive abilities rather than developing them via experience and learning.<ref>{{Citation |last1=Meltzoff |first1=Andrew N. |title=Learning about the mind from evidence |date=2013-08-22 |work=Understanding Other Minds |pages=19–34 |url=http://dx.doi.org/10.1093/acprof:oso/9780199692972.003.0002 |access-date=2024-04-02 |publisher=Oxford University Press |last2=Gopnik |first2=Alison|doi=10.1093/acprof:oso/9780199692972.003.0002 |isbn=978-0-19-969297-2 }}</ref>\n\nOther research has suggested that young infants in their first six months of life may possess an understanding of numerous aspects of the world around them, including:\n* an early [[numerical cognition]], that is, an ability to represent number and even compute the outcomes of addition and subtraction operations;<ref>{{cite journal | vauthors = Wynn K | title = Addition and subtraction by human infants | journal = Nature | volume = 358 | issue = 6389 | pages = 749–750 | date = August 1992 | pmid = 1508269 | doi = 10.1038/358749a0 | s2cid = 4348056 | bibcode = 1992Natur.358..749W | author-link1 = Karen Wynn }}</ref>\n* an ability to infer the goals of people in their environment;<ref>{{cite journal | vauthors = Woodward AL | title = Infants selectively encode the goal object of an actor's reach | journal = Cognition | volume = 69 | issue = 1 | pages = 1–34 | date = November 1998 | pmid = 9871370 | doi = 10.1016/S0010-0277(98)00058-4 | s2cid = 3081461 }}</ref>\n* an ability to engage in simple causal reasoning.<ref>{{cite journal | vauthors = Leslie AM, Keeble S | title = Do six-month-old infants perceive causality? | journal = Cognition | volume = 25 | issue = 3 | pages = 265–288 | date = April 1987 | pmid = 3581732 | doi = 10.1016/S0010-0277(87)80006-9 | s2cid = 29558332 }}</ref>\n\n===Critical periods of development===\nThere are [[critical period]]s in infancy and childhood during which development of certain perceptual, sensorimotor, social and language systems depends crucially on environmental stimulation.<ref name=\"Siegler\">{{Cite book | vauthors = Siegler R |year=2006 |title=How Children Develop, Exploring Child Development Student Media Tool Kit & Scientific American Reader to Accompany How Children Develop |location=New York |publisher=Worth Publishers |isbn=978-0-7167-6113-6}}</ref> [[Feral child]]ren such as [[Genie (feral child)|Genie]], deprived of adequate stimulation, fail to acquire important skills and are unable to learn in later childhood. In this case, Genie is used to represent the case of a feral child because she was socially neglected and abused while she was just a young girl. She underwent abnormal child psychology which involved problems with her linguistics. This happened because she was neglected while she was very young with no one to care about her and had less human contact. The concept of critical periods is also well-established in [[neurophysiology]], from the work of [[David H. Hubel|Hubel]] and [[Torsten Wiesel|Wiesel]] among others. Neurophysiology in infants generally provides correlating details that exists between neurophysiological details and clinical features and also focuses on vital information on rare and common neurological disorders that affect infants'''''.''''' \n\n====Developmental delays====\nStudies have been done to look at the differences in children who have developmental delays versus typical development. Normally when being compared to one another, mental age (MA) is not taken into consideration. There still may be differences in developmentally delayed (DD) children vs. typical development (TD) behavioral, emotional and other mental disorders. When compared to MA children there is a bigger difference between normal developmental behaviors overall. DDs can cause lower MA, so comparing DDs with TDs may not be as accurate. Pairing DDs specifically with TD children at similar MA can be more accurate. There are levels of behavioral differences that are considered as normal at certain ages. When evaluating DDs and MA in children, consider whether those with DDs have a larger amount of behavior that is not typical for their MA group. Developmental delays tend to contribute to other disorders or difficulties than their TD counterparts.<ref>{{cite journal | vauthors = Caplan B, Neece CL, Baker BL | title = Developmental level and psychopathology: comparing children with developmental delays to chronological and mental age matched controls | journal = Research in Developmental Disabilities | volume = 37 | pages = 143–151 | date = February 2015 | pmid = 25498740 | pmc = 4314378 | doi = 10.1016/j.ridd.2014.10.045 }}</ref>\n\n===Toddlerhood===\n{{Main|Toddler}}\nInfants shift between ages of one and two to a developmental stage known as toddlerhood. In this stage, an infant's transition into toddlerhood is highlighted through self-awareness, developing maturity in language use, and presence of memory and imagination.\n\nDuring toddlerhood, babies begin learning how to walk, talk, and make decisions for themselves. An important characteristic of this age period is the [[Language development|development of language]], where children are learning how to communicate and express their emotions and desires through the use of vocal sounds, babbling, and eventually words.<ref name=Upton>{{cite book| vauthors = Upton P |title=Developmental Psychology: Critical Thinking in Psychology|year=2011|publisher=Learning Matters|location=Exeter|isbn=978-0-85725-276-0|page=62}}</ref> Self-control also begins to develop. At this age, children take initiative to explore, experiment and learn from making mistakes. Caretakers who encourage toddlers to try new things and test their limits, help the child become autonomous, self-reliant, and confident.<ref name=ToddlerPlay>{{cite book| vauthors = Massi WS |title=Toddler Play|year=2001|publisher=Creative Pub. international|isbn=978-0-86573-435-7|url=https://archive.org/details/toddlerplaygymbo00wend}}</ref> If the caretaker is overprotective or disapproving of independent actions, the toddler may begin to doubt their abilities and feel ashamed of the desire for independence. The child's autonomic development is inhibited, leaving them less prepared to deal with the world in the future. Toddlers also begin to identify themselves in [[gender role]]s, acting according to their perception of what a man or woman should do.<ref name=UPton>{{cite book| vauthors = Upton P |title=Developmental Psychology: Critical Thinking in Psychology|year=2011|publisher=Learning Matters|location=Exeter|isbn=978-0-85725-276-0|page=84}}</ref>\n\nSocially, the period of toddler-hood is commonly called the \"terrible twos\".<ref name=Newman>{{cite book| vauthors = Newman BM, Newman PR |title=Development Through Life : A Psychosocial Approach|year=2011|publisher=Wadsworth Cengage Learning|location=Belmont, CA|isbn=978-1-111-34468-9|pages=215–217 }}</ref> Toddlers often use their new-found language abilities to voice their desires, but are often misunderstood by parents due to their language skills just beginning to develop. A person at this stage testing their independence is another reason behind the stage's infamous label. Tantrums in a fit of frustration are also common.\n\n===Childhood===\n{{See also|Early childhood}}\n[[Erik Erikson]] divides childhood into four stages, each with its distinct social crisis:<ref name=\"Bernardo J. Carducci 2009\">{{cite book | vauthors = Carducci BJ | title = The Psychology of Personality: Viewpoints, Research, and Applications | publisher = John Wiley & Sons | date = 2009 | page = 189 }}</ref>\n:* Stage 1: [[Infancy]] (0 to 1½) in which the psychosocial crisis is Trust vs. Mistrust\n:* Stage 2: Early childhood (2½ to 3) in which the psychosocial crisis is Autonomy vs. Shame and doubt\n:* Stage 3: Play age (3 to 5) in which the psychosocial crisis is Initiative vs. Guilt. (This stage is also called the \"pre-school age\", \"exploratory age\" and \"toy age\".)<ref>{{Cite web|url=http://www.vardhamaniqtoys.com/vision.aspx|archive-url=https://web.archive.org/web/20160304122300/http://www.vardhamaniqtoys.com/vision.aspx|url-status=dead|title=Vardhaman I.Q. Toys, \"Vision\"|archive-date=March 4, 2016}}</ref>\n:* Stage 4: School age (5 to 12) in which the psychosocial crisis is Industry vs. Inferiority\n'''Infancy'''\n\nAs stated, the psychosocial crisis for Erikson is Trust versus Mistrust. Needs are the foundation for gaining or losing trust in the infant. If the needs are met, trust in the guardian and the world forms. If the needs are not met, or the infant is neglected, mistrust forms alongside feelings of anxiety and fear.<ref>{{Cite journal |last1=Miller |first1=Sonja Ann |last2=College |first2=OpenStax |last3=Lang |first3=Diana |date=2022-08-01 |title=Psychosocial Theory: Erikson |url=https://iastate.pressbooks.pub/individualfamilydevelopment/chapter/erikson-and-psychosocial-theory/ |language=en}}</ref>\n\n'''Early Childhood'''\n\nAutonomy versus shame follows trust in infancy. The child begins to explore their world in this stage and discovers preferences in what they like. If autonomy is allowed, the child grows in independence and their abilities. If freedom of exploration is hindered, it leads to feelings of shame and low self-esteem.<ref>{{Cite journal |last1=Miller |first1=Sonja Ann |last2=College |first2=OpenStax |last3=Lang |first3=Diana |date=2022-08-01 |title=Psychosocial Theory: Erikson |url=https://iastate.pressbooks.pub/individualfamilydevelopment/chapter/erikson-and-psychosocial-theory/ |language=en}}</ref>  \n\n'''Play (or preschool) ages 3–5.'''<br />\nIn the earliest years, children are \"completely dependent on the care of others\". Therefore, they develop a \"social relationship\" with their care givers and, later, with family members. During their preschool years (3-5), they \"enlarge their social horizons\" to include people outside the family.<ref>{{cite book | vauthors = Thornton A | title = The Well-being of Children and Families: Research and Data Needs | publisher = University of Michigan Press | date = 2001 | pages = 73–74 }}</ref>\n\n[[Cognitive development#Preoperational stage|Preoperational]] and then [[Cognitive development#Concrete operational stage|operational]] thinking develops, which means actions are reversible, and egocentric thought diminishes.<ref>{{cite book | vauthors = Lightfoot C, Cole M, Cole SR | title = The Development of Children | publisher = Macmillan | date = 2008 | pages = 275–277 }}</ref>\n\nThe motor skills of preschoolers increase so they can do more things for themselves. They become more independent. No longer completely dependent on the care of others, the world of this age group expands. More people have a role in shaping their individual personalities. Preschoolers explore and question their world.<ref>{{cite web | publisher = Centers for Disease Control | title = Child Development: Preschoolers (3-5 years of age) | date = 11 February 2021 | url = https://www.cdc.gov/ncbddd/childdevelopment/positiveparenting/preschoolers.html }}</ref> For [[Jean Piaget]], the child is \"''a little scientist'' exploring and reflecting on these explorations to increase competence\" and this is done in \"a very independent way\".<ref name = \"Halpenny_2013\">{{cite book | vauthors = Halpenny AM, Pettersen J | title = Introducing Piaget: A Guide for Practitioners and Students in Early Years Education | publisher = Routledge | date = 2013 | pages = 7, 9 }}</ref>{{rp|7,9}}\n\nPlay is a major activity for ages 3–5. For Piaget, through play \"a child reaches higher levels of cognitive development.\"<ref name = \"Halpenny_2013\" />{{rp|14}}\n\nIn their expanded world, children in the 3–5 age group attempt to find their own way. If this is done in a socially acceptable way, the child develops the initiative. If not, the child develops guilt.<ref>{{cite book | vauthors = O'Connor B, Wells C, Applegate T | title = Health: You and Your World | volume =  1: Brief Edition | publisher = CreateSpace Independent Publishing Platform | date = 2015 | pages = 28 }}</ref> Children who develop \"guilt\" rather than \"initiative\" have failed Erikson's psychosocial crisis for the 3–5 age group.\n\n'''Middle and Late childhood ages 6–12.'''<br />\nFor Erik Erikson, the psychosocial crisis during middle childhood is Industry vs. Inferiority which, if successfully met, instills a sense of Competency in the child.<ref name=\"Bernardo J. Carducci 2009\" />\n\nIn all cultures, middle childhood is a time for developing \"skills that will be needed in their society.\"<ref name=\"Barbara Engler 2013\">{{cite book | vauthors = Engler B | title = Personality Theories | edition = 9th | publisher = Cengage Learning | date = 2013 | page = 142 }}</ref> School offers an arena in which children can gain a view of themselves as \"industrious (and worthy)\". They are \"graded for their school work and often for their industry\". They can also develop industry outside of school in sports, games, and doing volunteer work.<ref name=\"Marc H. Bornstein 2010\">{{cite book | vauthors = Bornstein MH, Vandell DL, Rook KS | title = Lifespan Development: Infancy Through Adulthood | publisher = Cengage Learning | date = 2010 | page = 299 }}</ref> Children who achieve \"success in school or games might develop a feeling of competence.\"\n\nThe \"peril during this period is that feelings of inadequacy and inferiority will develop.<ref name=\"Barbara Engler 2013\" /> Parents and teachers can \"undermine\" a child's development by failing to recognize accomplishments or being overly critical of a child's efforts.<ref name=\"Marc H. Bornstein 2010\" />\nChildren who are \"encouraged and praised\" develop a belief in their competence. Lack of encouragement or ability to excel lead to \"feelings of inadequacy and inferiority\".<ref>{{cite web | url = http://behavioralchild.com/milestones/ | vauthors = Broutian M | publisher = Milestones | title = Your child: early school years (7 to 11 years) stage of development | work = Your Child's Development | archive-url = https://web.archive.org/web/20151115170628/http://behavioralchild.com/milestones/ | archive-date= 15 November 2015 | access-date = 13 October 2015 }}</ref>\n\nThe [[Centers for Disease Control]] (CDC) divides Middle Childhood into two stages, 6–8 years and 9–11 years, and gives \"developmental milestones for each stage\".<ref name = \"CDC_CD_6-8\">{{cite web | work = Centers for Disease Control | title = Child Development: Middle Childhood (6-8 years of age) | date = 4 February 2021 | url = https://www.cdc.gov/ncbddd/childdevelopment/positiveparenting/middle.html }}</ref><ref name = \"CDC_CD_9-11\">{{cite web | work = Centers for Disease Control | title = Child Development: Middle Childhood (9-11 years of age) | url = https://www.cdc.gov/ncbddd/childdevelopment/positiveparenting/middle2.html | access-date = 15 October 2015 }}</ref>\n\n''Middle Childhood (6–8).''<br />\nEntering elementary school, children in this age group begin to thinks about the future and their \"place in the world\". Working with other students and wanting their friendship and acceptance become more important. This leads to \"more independence from parents and family\". As students, they develop the mental and verbal skills \"to describe experiences and talk about thoughts and feelings\". They become less self-centered and show \"more concern for others\".<ref name = \"CDC_CD_6-8\" />\n\n''Late Childhood (9–12).''<br />\nFor children ages 9–11 \"friendships and peer relationships\" increase in strength, complexity, and importance. This results in greater \"peer pressure\". They grow even less dependent on their families and they are challenged academically. To meet this challenge, they increase their attention span and learn to see other points of view.<ref name = \"CDC_CD_9-11\" />\n\n===Adolescence===\n{{Main|Adolescent psychology}}\nAdolescence is the period of life between the onset of puberty and the full commitment to an adult social role, such as worker, parent, and/or citizen. It is the period known for the formation of personal and social identity (see [[Erik Erikson]]) and the discovery of moral purpose (see [[William Damon]]). Intelligence is demonstrated through the logical use of symbols related to abstract concepts and formal reasoning. A return to [[egocentric]] thought often occurs early in the period. Only 35% develop the capacity to reason formally during adolescence or adulthood. (Huitt, W. and Hummel, J. January 1998)<ref>{{Cite web|url=https://pages.uoregon.edu/moursund/Math/developmental_theory.htm|title=Developmental Theory|website=pages.uoregon.edu|access-date=2021-05-07|archive-date=2021-05-16|archive-url=https://web.archive.org/web/20210516005242/https://pages.uoregon.edu/moursund/Math/developmental_theory.htm|url-status=dead}}</ref>\n\nErik Erikson labels this stage identity versus role confusion. Erikson emphasizes the importance of developing a sense of identity in adolescence because it affects the individual throughout their life. Identity is a lifelong process and is related with curiosity and active engagement. Role confusion is often considered the current state of identity of the individual. Identity exploration is the process of changing from role confusion to resolution.<ref>{{Cite journal |last=Syed |first=Moin |date=July 2013 |title=Identity exploration, identity confusion, and openness as predictors of multicultural ideology |url=https://www.sciencedirect.com/science/article/pii/S0147176713000576 |journal=International Journal of Intercultural Relations |volume=37 |issue=4 |pages=491–496 |doi=10.1016/j.ijintrel.2013.04.005 |via=ELSEVIER}}</ref>\n\nDuring Erik Erikson's identity versus role uncertainty stage, which occurs in adolescence, people struggle to form a cohesive sense of self while exploring many social roles and prospective life routes. This time is characterized by deep introspection, self-examination, and the pursuit of self-understanding. Adolescents are confronted with questions regarding their identity, beliefs, and future goals. The major problem is building a strong sense of identity in the face of society standards, peer pressure, and personal preferences. Adolescents participate in identity exploration, commitment, and synthesis, actively seeking out new experiences, embracing ideals and aspirations, and merging their changing sense of self into a coherent identity. Successfully navigating this stage builds the groundwork for good psychological development in adulthood, allowing people to pursue meaningful relationships, make positive contributions to society, and handle life's adversities with perseverance and purpose.<ref name=\":4\" />  \n\nIt is divided into three parts, namely:\n# Early Adolescence: 9 to 13 years \n# Mid Adolescence: 13 to 15 years and\n# Late Adolescence: 15 to 18 years\n\nThe adolescent unconsciously explores questions such as \"Who am I? Who do I want to be?\" Like toddlers, adolescents must explore, test limits, become [[autonomous]], and commit to an [[identity (social science)|identity]], or [[sense of self]]. Different roles, behaviors and [[ideologies]] must be tried out to select an identity. Role confusion and inability to choose vocation can result from a failure to achieve a sense of identity through, for example, friends.<ref>{{Cite journal |last=Kemph |first=John P. |date=March 1969 |title=Erik H. Erikson. Identity, youth and crisis. New York: W. W. Norton Company, 1968 |url=http://dx.doi.org/10.1002/bs.3830140209 |journal=Behavioral Science |volume=14 |issue=2 |pages=154–159 |doi=10.1002/bs.3830140209 |issn=0005-7940}}</ref>\n\n===Early adulthood===\n{{Main|Young adult (psychology)}}\nEarly adulthood generally refers to the period between ages 18 to 39,<ref>{{cite journal | vauthors = Arnett JJ, Žukauskienė R, Sugimura K | title = The new life stage of emerging adulthood at ages 18-29 years: implications for mental health | journal = The Lancet. Psychiatry | volume = 1 | issue = 7 | pages = 569–576 | date = December 2014 | pmid = 26361316 | doi = 10.1016/s2215-0366(14)00080-7 }}</ref> and according to theorists such as Erik Erikson, is a stage where development is mainly focused on [[Interpersonal relationship|maintaining relationships]].<ref>{{cite book| vauthors = Kastenbaum R |title=Encyclopedia of Adult Development|year=1993|publisher=Oryx Press|isbn=978-0-89774-669-4|page=14}}</ref> Erikson shows the importance of relationships by labeling this stage ''intimacy'' vs ''isolation''. Intimacy suggests a process of becoming part of something larger than oneself by sacrificing in romantic relationships and working for both life and career goals.<ref>{{Cite book |last=Žukauskienė |first=Rita |url=https://books.google.com/books?id=rYs0CwAAQBAJ&dq=%22early+adulthood%22+development&pg=PA17 |title=Emerging Adulthood in a European Context |date=2015-12-07 |publisher=Psychology Press |isbn=978-1-317-61271-1 |language=en}}</ref> Other examples include creating bonds of intimacy, sustaining friendships, and starting a family. Some theorists state that development of intimacy skills rely on the resolution of previous developmental stages. A sense of identity gained in the previous stages is also necessary for intimacy to develop. If this skill is not learned the alternative is alienation, isolation, a fear of commitment, and the inability to depend on others.\n\n''Isolation,'' on the other hand, suggests something different than most might expect. Erikson defined it as a delay of commitment in order to maintain freedom. Yet, this decision does not come without consequences. Erikson explained that choosing isolation may affect one's chances of getting married, progressing in a career, and overall development.<ref>{{Cite book |last=Žukauskienė |first=Rita |url=https://books.google.com/books?id=rYs0CwAAQBAJ&dq=%22early+adulthood%22+development&pg=PA17 |title=Emerging Adulthood in a European Context |date=2015-12-07 |publisher=Psychology Press |isbn=978-1-317-61271-1 |language=en}}</ref> \n\nA related framework for studying this part of the lifespan is that of [[emerging adulthood]]. Scholars of emerging adulthood, such as Jeffrey Arnett, are not necessarily interested in relationship development. Instead, this concept suggests that people transition after their teenage years into a period, not characterized as relationship building and an overall sense of constancy with life, but with years of living with parents, phases of self-discovery, and experimentation.<ref name=\"Twenge\">{{cite journal| vauthors = Twenge JM |title=Review of emerging adulthood: The winding road from the late teens through the twenties|journal=American Journal of Psychology|year=2008|volume=121|issue=4|pages=682–687|doi=10.2307/20445494|jstor=20445494}}</ref>\n\n===Middle adulthood===\n{{Main|Middle age}}\nMiddle adulthood generally refers to the period between ages 40 to 64. During this period, middle-aged adults experience a conflict between generativity and stagnation. Generativity is the sense of contributing to society, the next generation, or their immediate community. On the other hand, stagnation results in a lack of purpose.<ref>{{cite journal | vauthors = Helson R, Soto CJ | title = Up and down in middle age: monotonic and nonmonotonic changes in roles, status, and personality | journal = Journal of Personality and Social Psychology | volume = 89 | issue = 2 | pages = 194–204 | date = August 2005 | pmid = 16162053 | doi = 10.1037/0022-3514.89.2.194 }}</ref> The adult's identity continues to develop in middle-adulthood. Middle-aged adults often adopt opposite gender characeristics. The adult realizes they are half-way through their life and often reevaluate vocational and social roles. Life circumstances can also cause a reexamination of identity.<ref>{{Cite journal |last=Sokol |first=Justin |date=2009 |title=Identity Development Throughout the Lifetime: An Examination of Eriksonian Theory |url=https://epublications.marquette.edu/cgi/viewcontent.cgi?article=1030&context=gjcp |journal=Graduate Journal of Counseling Psychology |volume=1 |issue=2 |pages=12 |via=e-Publications@Marquette}}</ref>  \n\nPhysically, the middle-aged experience a decline in muscular strength, reaction time, sensory keenness, and cardiac output. Also, women experience [[menopause]] at an average age of 48.8 and a sharp drop in the hormone [[estrogen]].<ref>{{cite journal | vauthors = Schoenaker DA, Jackson CA, Rowlands JV, Mishra GD | title = Socioeconomic position, lifestyle factors and age at natural menopause: a systematic review and meta-analyses of studies across six continents | journal = International Journal of Epidemiology | volume = 43 | issue = 5 | pages = 1542–1562 | date = October 2014 | pmid = 24771324 | pmc = 4190515 | doi = 10.1093/ije/dyu094 }}</ref> Men experience an equivalent endocrine system event to menopause. [[Andropause]] in males is a hormone fluctuation with physical and psychological effects that can be similar to those seen in menopausal females. As men age lowered testosterone levels can contribute to mood swings and a decline in [[spermatozoa|sperm]] count. Sexual responsiveness can also be affected, including delays in [[erection]] and longer periods of [[penile stimulation]] required to achieve [[ejaculation]].\n\nThe important influence of biological and social changes experienced by women and men in middle adulthood is reflected in the fact that depression is highest at age 48.5 around the world.<ref>{{cite journal | vauthors = Blanchflower DG, Oswald AJ | title = Is well-being U-shaped over the life cycle? | journal = Social Science & Medicine | volume = 66 | issue = 8 | pages = 1733–1749 | date = April 2008 | pmid = 18316146 | doi = 10.1016/j.socscimed.2008.01.030 | url = http://www.nber.org/papers/w12935.pdf }}</ref>\n\n===Old age===\n{{Main|Old age}}\nThe [[World Health Organization]] finds \"no general agreement on the age at which a person becomes old.\" Most [[Developed country|\"developed countries\"]] set the age as 65 or 70. However, in [[Developing country|developing countries]] inability to make \"active contribution\" to society, not chronological age, marks the beginning of old age.<ref>{{cite web | title = Definition of an older or elderly person | work = World Health Organization | url = http://www.who.int/healthinfo/survey/ageingdefnolder/en/ | access-date = 11 October 2015 }}</ref> According to [[Erikson's stages of psychosocial development]], old age is the stage in which individuals assess the quality of their lives.<ref name=\"Miller2003\">{{cite book |url=https://books.google.com/books?id=rPcwuEe9MBQC&pg=PA242 |title=Encyclopedia of Human Ecology: I-Z |vauthors=Miller JR |publisher=ABC-CLIO |year=2003 |isbn=978-1-57607-852-5 |pages=242– |access-date=4 December 2012}}</ref> \n\nErikson labels this stage as integrity versus despair. For integrated persons, there is a sense of fulfillment in life. They have become self-aware and optimistic due to life's commitments and connection to others. While reflecting on life, people in this stage develop feelings of contentment with their experiences. If a person falls into despair, they are often disapointed about failures or missed chances in life. They may feel that the time left in life is an insufficient amount to turn things around.<ref>{{Cite journal |last1=Hearn |first1=Simon |last2=Saulnier |first2=Gary |last3=Strayer |first3=Janet |last4=Glenham |first4=Margarete |last5=Koopman |first5=Ray |last6=Marcia |first6=James E. |date=2012-03-01 |title=Between Integrity and Despair: Toward Construct Validation of Erikson's Eighth Stage |url=https://doi.org/10.1007/s10804-011-9126-y |journal=Journal of Adult Development |language=en |volume=19 |issue=1 |pages=1–20 |doi=10.1007/s10804-011-9126-y |issn=1573-3440}}</ref>   \n\nPhysically, older people experience a decline in muscular strength, reaction time, stamina, hearing, distance perception, and the sense of smell.<ref name=\"Deary2011\">{{cite journal | vauthors = Deary IJ, Johnson W, Gow AJ, Pattie A, Brett CE, Bates TC, Starr JM | title = Losing one's grip: a bivariate growth curve model of grip strength and nonverbal reasoning from age 79 to 87 years in the Lothian Birth Cohort 1921 | journal = The Journals of Gerontology. Series B, Psychological Sciences and Social Sciences | volume = 66 | issue = 6 | pages = 699–707 | date = November 2011 | pmid = 21743039 | doi = 10.1093/geronb/gbr059 | doi-access = free | hdl = 20.500.11820/a59dc7c1-af60-4f02-a8be-37987b26f9a4 | hdl-access = free }}</ref> They also are more susceptible to diseases such as cancer and pneumonia due to a weakened immune system.<ref>{{cite news | title = The Immune System in the Elderly: A Fair Fight Against Diseases? | newspaper = Medscape | url = http://www.medscape.com/viewarticle/780507_2 | archive-url = https://web.archive.org/web/20130619221724/http://www.medscape.com/viewarticle/780507_2 | url-status = live | archive-date = June 19, 2013 | access-date = November 8, 2013 }}</ref> Programs aimed at balance, muscle strength, and mobility have been shown to reduce disability among mildly (but not more severely) disabled elderly.<ref name=\"Gill2002\">{{cite journal | vauthors = Gill TM, Baker DI, Gottschalk M, Peduzzi PN, Allore H, Byers A | title = A program to prevent functional decline in physically frail, elderly persons who live at home | journal = The New England Journal of Medicine | volume = 347 | issue = 14 | pages = 1068–1074 | date = October 2002 | pmid = 12362007 | doi = 10.1056/NEJMoa020423 | doi-access = free }}</ref>\n\nSexual expression depends in large part upon the emotional and physical health of the individual. Many older adults continue to be sexually active and satisfied with their sexual activity.<ref>{{cite book| vauthors = Cavanaugh JC, Blanchard-Fields F | author-link2=Fredda Blanchard-Fields | name-list-style = vanc |title=Adult development and aging|year=2009|publisher=Wadsworth/Cengage Learning|location=Australia|isbn=978-0-495-60174-6|pages=89–90|edition=6th}}</ref>\n\nMental [[wikt:disintegration|disintegration]] may also occur, leading to [[dementia]] or ailments such as [[Alzheimer's disease]]. The average age of onset for dementia in males is 78.8 and 81.9 for women.<ref>{{cite journal | vauthors = Brinks R, Landwehr S, Waldeyer R | title = Age of onset in chronic diseases: new method and application to dementia in Germany | journal = Population Health Metrics | volume = 11 | issue = 1 | pages = 6 | year = 2013 | pmid = 23638981 | pmc = 3665482 | doi = 10.1186/1478-7954-11-6 | doi-access = free }}</ref> It is generally believed that [[crystallized intelligence]] increases up to old age, while [[fluid intelligence]] decreases with age.<ref>[https://web.archive.org/web/20000525173324/http://www.webster.edu/~woolflm/cognitions.html Woolf, Linda M. \"Theoretical Perspectives Relevant to Developmental Psychology\", Webster, 1998.]  Retrieved on 2012-03-16.</ref> Whether or not normal intelligence increases or decreases with age depends on the measure and study. [[Longitudinal study|Longitudinal studies]] show that perceptual speed, inductive reasoning, and spatial orientation decline.<ref name=\"What Can We Learn From Longitudinal\">{{cite journal | vauthors = Schaie KW | title = What Can We Learn From Longitudinal Studies of Adult Development? | journal = Research in Human Development | volume = 2 | issue = 3 | pages = 133–158 | year = 2005 | pmid = 16467912 | pmc = 1350981 | doi = 10.1207/s15427617rhd0203_4 }}</ref> An article on adult cognitive development reports that [[Cross-sectional study|cross-sectional studies]] show that \"some abilities remained stable into early old age\".<ref name=\"What Can We Learn From Longitudinal\"/>\n\n", "goals": ["The student will be able to describe the development of the individual from infancy through old age, including the development of cognitive, emotional, and social abilities", "The student will be able to describe the development of the individual from infancy through old age, including the development of cognitive, emotional, and social abilities", "The student will be able to describe the development of the individual from infancy through old age, including the development of cognitive, emotional, and social abilities", "The student will be able to describe the development of the individual from infancy through old age, including the development of cognitive, emotional, and social abilities", "The student will be able to describe the development of the individual from infancy through old age, including the development of cognitive, emotional, and social abilities"]}, {"title": "Prenatal development", "content": "{{Main|Prenatal development}}\n{{See also|Fetal psychology}}\nPrenatal development is of interest to psychologists investigating the context of early psychological development. The whole prenatal development involves three main stages: germinal stage, embryonic stage and fetal stage. Germinal stage begins at conception until 2 weeks; embryonic stage means the development from 2 weeks to 8 weeks; fetal stage represents 9 weeks until birth of the baby.<ref>{{Cite book| vauthors = Berk LE |url=https://www.worldcat.org/oclc/946161390|title=Development Through the Lifespan|publisher=Pearson Education|year=2018|isbn=978-0-13-441969-5|edition=Seventh|location=Hoboken, NJ|pages=76–81|oclc=946161390}}</ref> The senses develop in the womb itself: a fetus can both see and hear by the second trimester (13 to 24 weeks of age). The sense of touch develops in the embryonic stage (5 to 8 weeks).<ref name=Berk />{{rp|97}} Most of the brain's billions of neurons also are developed by the second trimester.<ref name=Berk />{{rp|100}} Babies are hence born with some odor, taste and sound preferences, largely related to the mother's environment.<ref name=Berk />{{rp|101}}\n\nSome [[primitive reflexes]] too arise before birth and are still present in newborns. One hypothesis is that these reflexes are vestigial and have limited use in early human life. [[Piaget's theory of cognitive development]] suggested that some early reflexes are building blocks for infant sensorimotor development. For example, the [[tonic neck reflex]] may help development by bringing objects into the infant's field of view.<ref name=\"butterworth\">{{Cite book | vauthors = Butterworth G, Harris M |title=Principles of Developmental Psychology |year=1994 |publisher=Lawrence Erlbaum Associates |isbn=978-0-86377-280-1 |url-access=registration |url=https://archive.org/details/principlesofdeve0000butt }}</ref>\n\nOther reflexes, such as the [[walking reflex]], appear to be replaced by more sophisticated voluntary control later in infancy. This may be because the infant gains too much weight after birth to be strong enough to use the reflex, or because the reflex and subsequent development are functionally different.<ref name=\"bremner\">{{Cite book | vauthors = Bremner JG |title=Infancy |year=1994 |publisher=Blackwell |edition=2 |isbn=978-0-631-18466-9 |url=https://archive.org/details/infancy0000brem_s1x4 }}</ref> It has also been suggested that some reflexes (for example the [[moro reflex|moro]] and [[walking reflex]]es) are predominantly adaptations to life in the womb with little connection to early infant development.<ref name=\"butterworth\" /> Primitive reflexes reappear in adults under certain conditions, such as neurological conditions like [[dementia]] or traumatic lesions.\n\n[[Ultrasound|Ultrasounds]] have shown that infants are capable of a range of movements in the womb, many of which appear to be more than simple reflexes.<ref name=\"bremner\" /> By the time they are born, infants can recognize and have a preference for their mother's voice suggesting some prenatal development of auditory perception.<ref name=\"bremner\" /> Prenatal development and birth complications may also be connected to neurodevelopmental disorders, for example in [[schizophrenia]]. With the advent of [[cognitive neuroscience]], [[embryology]] and the neuroscience of prenatal development is of increasing interest to developmental psychology research.\n\nSeveral environmental agents—[[teratogens]]—can cause damage during the prenatal period. These include prescription and nonprescription drugs, illegal drugs, tobacco, alcohol, environmental pollutants, infectious disease agents such as the [[rubella]] virus and the [[toxoplasmosis]] parasite, maternal malnutrition, maternal emotional stress, and Rh factor blood incompatibility between mother and child.<ref name=Berk />{{rp|102–115}} There are many statistics which prove the effects of the aforementioned substances. A leading example of this would be that at least 100,000 \"cocaine babies\" were born in the United States annually in the late 1980s.  \"Cocaine babies\" are proven to have quite severe and lasting difficulties which persist throughout infancy and right throughout childhood. The drug also encourages behavioural problems in the affected children and defects of various vital organs.<ref>{{Cite news|title=One of five expectant mothers use cocaine, U.S. study finds|agency = Associated Press |work=Toronto star |issn=0319-0781 |date=1989-01-20 }}</ref>\n\n", "goals": ["The student will be able to identify the three main stages of prenatal development and describe the development of the senses during this time", "The student will be able to identify the primitive reflexes that arise before birth and describe how they may be related to infant development", "The student will be able to identify the environmental agents that can cause damage during the prenatal period and describe the effects of these substances on the developing fetus", "The student will be able to identify the neurodevelopmental disorders that may be connected to prenatal development and describe the effects of these disorders on the developing fetus", "The student will be able to identify the environmental agents that can cause damage during the prenatal period and describe the effects of these substances on the developing fetus"]}, {"title": "Infancy", "content": "{{Main|Infant and child psychology|Infant cognitive development}}\nFrom birth until the first year, children are referred to as [[infant|infants]]. As they grow, children respond to their environment in unique ways.<ref name=Berk /> Developmental psychologists vary widely in their assessment of infant psychology, and the influence the outside world has upon it.\n\nThe majority of a newborn infant's time is spent sleeping.<ref>{{Cite journal |last1=Hirshkowitz |first1=Max |last2=Whiton |first2=Kaitlyn |last3=Albert |first3=Steven M. |last4=Alessi |first4=Cathy |last5=Bruni |first5=Oliviero |last6=DonCarlos |first6=Lydia |last7=Hazen |first7=Nancy |last8=Herman |first8=John |last9=Katz |first9=Eliot S. |last10=Kheirandish-Gozal |first10=Leila |last11=Neubauer |first11=David N. |last12=O’Donnell |first12=Anne E. |last13=Ohayon |first13=Maurice |last14=Peever |first14=John |last15=Rawding |first15=Robert |date=2015-03-01 |title=National Sleep Foundation's sleep time duration recommendations: methodology and results summary |url=https://www.sleephealthjournal.org/article/S2352-7218%252815%252900015-7/fulltext |journal=Sleep Health: Journal of the National Sleep Foundation |language=English |volume=1 |issue=1 |pages=40–43 |doi=10.1016/j.sleh.2014.12.010 |issn=2352-7218 |pmid=29073412|s2cid=205190733 }}</ref> At first, their sleep cycles are evenly spread throughout the day and night, but after a couple of months, infants generally become [[diurnal animal|diurnal]].<ref name=\":2\">{{Citation |last1=Patel |first1=Aakash K. |title=Physiology, Sleep Stages |date=2023 |url=http://www.ncbi.nlm.nih.gov/books/NBK526132/ |work=StatPearls |access-date=2023-12-28 |place=Treasure Island (FL) |publisher=StatPearls Publishing |pmid=30252388 |last2=Reddy |first2=Vamsi |last3=Shumway |first3=Karlie R. |last4=Araujo |first4=John F.}}</ref> In human or rodent infants, there is always the observation of a diurnal cortisol rhythm, which is sometimes entrained with a maternal substance.<ref name=\":3\">{{Cite journal |last1=Iwata |first1=Osuke |last2=Okamura |first2=Hisayoshi |last3=Saitsu |first3=Hiroki |last4=Saikusa |first4=Mamoru |last5=Kanda |first5=Hiroshi |last6=Eshima |first6=Nobuoki |last7=Iwata |first7=Sachiko |last8=Maeno |first8=Yasuki |last9=Matsuishi |first9=Toyojiro |date=Jan 2013 |title=Diurnal cortisol changes in newborn infants suggesting entrainment of peripheral circadian clock in utero and at birth |journal=The Journal of Clinical Endocrinology and Metabolism |volume=98 |issue=1 |pages=E25–32 |doi=10.1210/jc.2012-2750 |issn=1945-7197 |pmid=23150686|doi-access=free }}</ref> Nevertheless the circadian rhythm starts to take shape, and a 24-hour rhythm is observed in just some few months after birth.<ref name=\":2\" /><ref name=\":3\" />\n\nInfants can be seen to have six states, grouped into pairs:\n* quiet sleep and active sleep ([[dream]]ing, when [[REM sleep]] occurs). Generally, there are various reasons as to why infants dream. Some argue that it is just a psychotherapy, which usually occurs normally in the brain. Dreaming is a form of processing and consolidating information that has been obtained during the day. Freud argues that dreams are a way of representing unconscious desires.<ref>{{cite journal |last1=Zhang |first1=Wei |last2=Guo |first2=Benyu |title=Freud's Dream Interpretation: A Different Perspective Based on the Self-Organization Theory of Dreaming |journal=Frontiers in Psychology |date=2018 |volume=9 |page=1553 |doi=10.3389/fpsyg.2018.01553 |pmid=30190698 |pmc=6115518 |doi-access=free }}</ref>\n* quiet waking, and active waking\n* fussing and [[crying]]. In a normal set up, infants have different reasons as to why they cry. Mostly, infants cry due to physical discomfort, hunger, or to receive attention or stimulation from their caregiver.<ref>{{Cite web |date=2020-12-07 |title=Soothing a crying baby |url=https://www.nhs.uk/conditions/baby/caring-for-a-newborn/soothing-a-crying-baby/ |access-date=2023-12-28 |website=nhs.uk |language=en}}</ref>\n\n====Infant perception====\nInfant perception is what a newborn can see, hear, smell, taste, and touch. These five features are considered as the \"five senses\".<ref>{{cite book | vauthors = Bee D, Boyd H |title=The developing child |publisher=Pearson Education |location=Upper Saddle River, N.J. |isbn=978-0-205-25602-0 |page=36 |edition=13th|date=2011-12-12 }}</ref> Because of these different senses, infants respond to stimuli differently.<ref name=\"bremner\" />\n\n* [[Visual perception|Vision]] is significantly worse in infants than in older children. Infant sight tends to be blurry in early stages but improves over time. Color perception, similar to that seen in adults, has been demonstrated in infants as young as four months using habituation methods.<ref name=\"butterworth\" /> Infants attain adult-like vision at about six months.<ref name=\"Berk\" />{{rp|191}}\n* [[Hearing (sense)|Hearing]] is well-developed prior to birth. Newborns prefer complex sounds to pure tones, human speech to other sounds, mother's voice to other voices, and the native language to other languages. Scientist believe these features are probably learned in the womb.<ref name=\"Berk\" />{{rp|151}} Infants are fairly good at detecting the direction a sound comes from, and by 18 months their hearing ability is approximately equal to an adult's.\n* [[Olfaction|Smell]] and [[taste]] are present, with infants showing different expressions of disgust or pleasure when presented with pleasant odors (honey, milk, etc.) or unpleasant odors (rotten egg) and tastes (e.g. sour taste). Newborns are born with odor and taste preferences acquired in the womb from the smell and taste of amniotic fluid, in turn influenced by what the mother eats. Both breast- and bottle-fed babies around three days old prefer the smell of human milk to that of formula, indicating an innate preference.<ref name=\"Berk\" />{{rp|150}} Older infants also prefer the smell of their mother to that of others.<ref name=\"butterworth\" />\n* [[Haptic perception|Touch and feel]] is one of the better-developed senses at birth as it is one of the first senses to develop inside the womb.<ref>{{cite book | vauthors = Feldman RD, Papalia DE |title=A child's world: infancy through adolescence |year=2010 |publisher=McGraw-Hill |location=New York |isbn=978-0-07-353204-2 |page=57 |edition=12th}}</ref>  This is evidenced by the [[primitive reflexes]] described above, and the relatively advanced development of the [[somatosensory cortex]].<ref name=\"Slater\">{{cite book |title=Introduction to Infant Development | vauthors = Slater A, Lewis M |isbn=978-0-19-928305-7 |publisher=OUP |location=Oxford |year=2006}}</ref>\n* [[Pain]]: Infants feel pain similarly, if not more strongly than older children, but pain relief in infants has not received so much attention as an area of research.<ref name=\"MatthewMatthew\">{{cite journal | vauthors = Mathew PJ, Mathew JL | title = Assessment and management of pain in infants | journal = Postgraduate Medical Journal | volume = 79 | issue = 934 | pages = 438–443 | date = August 2003 | pmid = 12954954 | pmc = 1742785 | doi = 10.1136/pmj.79.934.438 }}</ref> Glucose is known to relieve pain in newborns.<ref name=\"DilenElseviers\">{{cite journal | vauthors = Dilen B, Elseviers M | title = Oral glucose solution as pain relief in newborns: results of a clinical trial | journal = Birth | volume = 37 | issue = 2 | pages = 98–105 | date = June 2010 | pmid = 20557532 | doi = 10.1111/j.1523-536X.2010.00389.x }}</ref>\n\n====Language====\n{{Main|Language development}}\nBabies are born with the ability to discriminate virtually all sounds of all human languages.<ref name=Berk />{{rp|189}} Infants of around six months can differentiate between [[phoneme]]s in their own language, but not between similar phonemes in another language. Notably, infants are able to differentiate between various durations and sound levels and can easily differentiate all the languages they have encountered, hence easy for infants to understand a certain language compared to an adult.<ref>{{Cite journal |last=Deuchar |first=Margaret |date=March 1998 |title=Paul Fletcher & Brian MacWhinney (eds.), ''The Handbook of Child Language''. Oxford: Blackwell, 1995. Pp. x+786. |url=http://dx.doi.org/10.1017/s0022226797256896 |journal=Journal of Linguistics |volume=34 |issue=1 |pages=227–297 |doi=10.1017/s0022226797256896 |issn=0022-2267}}</ref>\n\nAt this stage infants also start to [[Babbling|babble]], whereby they start making vowel consonant sound as they try to understand the true meaning of language and copy whatever they are hearing in their surrounding producing their own phonemes.\n\nIn various cultures, a distinct form of speech called \"babytalk\" is used when communicating with newborns and young children. This register consists of simplified terms for common topics such as family members, food, hygiene, and familiar animals. It also exhibits specific phonological patterns, such as substituting alveolar sounds with initial velar sounds, especially in languages like English. Furthermore, babytalk often involves morphological simplifications, such as regularizing verb conjugations (for instance, saying \"corned\" instead of \"cornered\" or \"goed\" instead of \"went\"). This language is typically taught to children and is perceived as their natural way of communication. Interestingly, in mythology and popular culture, certain characters, such as the \"Hausa trickster\" or the Warner Bros cartoon character \"Tweety Pie\", are portrayed as speaking in a babytalk-like manner.<ref>{{Cite journal |last1=Menn |first1=Lise |last2=Stoel-Gammon |first2=Carol |date=2017-08-18 |title=Phonological Development |url=http://dx.doi.org/10.1111/b.9780631203124.1996.00014.x |journal=The Handbook of Child Language |pages=335–360 |doi=10.1111/b.9780631203124.1996.00014.x|isbn=978-0-631-20312-4 }}</ref>\n\n", "goals": ["The student will be able to identify the different states of infants and their perception of the world", "The student will be able to identify the different sounds that infants prefer and the different languages they can understand", "The student will be able to identify the different ways infants communicate and the different ways they feel pain", "The student will be able to identify the different ways infants perceive the world and the different ways they learn to communicate", "The student will be able to identify the different ways infants perceive the world and the different ways they learn to communicate"]}, {"title": "Infant perception", "content": "Infant perception is what a newborn can see, hear, smell, taste, and touch. These five features are considered as the \"five senses\".<ref>{{cite book | vauthors = Bee D, Boyd H |title=The developing child |publisher=Pearson Education |location=Upper Saddle River, N.J. |isbn=978-0-205-25602-0 |page=36 |edition=13th|date=2011-12-12 }}</ref> Because of these different senses, infants respond to stimuli differently.<ref name=\"bremner\" />\n\n* [[Visual perception|Vision]] is significantly worse in infants than in older children. Infant sight tends to be blurry in early stages but improves over time. Color perception, similar to that seen in adults, has been demonstrated in infants as young as four months using habituation methods.<ref name=\"butterworth\" /> Infants attain adult-like vision at about six months.<ref name=\"Berk\" />{{rp|191}}\n* [[Hearing (sense)|Hearing]] is well-developed prior to birth. Newborns prefer complex sounds to pure tones, human speech to other sounds, mother's voice to other voices, and the native language to other languages. Scientist believe these features are probably learned in the womb.<ref name=\"Berk\" />{{rp|151}} Infants are fairly good at detecting the direction a sound comes from, and by 18 months their hearing ability is approximately equal to an adult's.\n* [[Olfaction|Smell]] and [[taste]] are present, with infants showing different expressions of disgust or pleasure when presented with pleasant odors (honey, milk, etc.) or unpleasant odors (rotten egg) and tastes (e.g. sour taste). Newborns are born with odor and taste preferences acquired in the womb from the smell and taste of amniotic fluid, in turn influenced by what the mother eats. Both breast- and bottle-fed babies around three days old prefer the smell of human milk to that of formula, indicating an innate preference.<ref name=\"Berk\" />{{rp|150}} Older infants also prefer the smell of their mother to that of others.<ref name=\"butterworth\" />\n* [[Haptic perception|Touch and feel]] is one of the better-developed senses at birth as it is one of the first senses to develop inside the womb.<ref>{{cite book | vauthors = Feldman RD, Papalia DE |title=A child's world: infancy through adolescence |year=2010 |publisher=McGraw-Hill |location=New York |isbn=978-0-07-353204-2 |page=57 |edition=12th}}</ref>  This is evidenced by the [[primitive reflexes]] described above, and the relatively advanced development of the [[somatosensory cortex]].<ref name=\"Slater\">{{cite book |title=Introduction to Infant Development | vauthors = Slater A, Lewis M |isbn=978-0-19-928305-7 |publisher=OUP |location=Oxford |year=2006}}</ref>\n* [[Pain]]: Infants feel pain similarly, if not more strongly than older children, but pain relief in infants has not received so much attention as an area of research.<ref name=\"MatthewMatthew\">{{cite journal | vauthors = Mathew PJ, Mathew JL | title = Assessment and management of pain in infants | journal = Postgraduate Medical Journal | volume = 79 | issue = 934 | pages = 438–443 | date = August 2003 | pmid = 12954954 | pmc = 1742785 | doi = 10.1136/pmj.79.934.438 }}</ref> Glucose is known to relieve pain in newborns.<ref name=\"DilenElseviers\">{{cite journal | vauthors = Dilen B, Elseviers M | title = Oral glucose solution as pain relief in newborns: results of a clinical trial | journal = Birth | volume = 37 | issue = 2 | pages = 98–105 | date = June 2010 | pmid = 20557532 | doi = 10.1111/j.1523-536X.2010.00389.x }}</ref>\n\n", "goals": ["The student will be able to identify the five senses and understand how they develop in infants", "The student will be able to identify the different stages of development in the five senses and understand how they improve over time", "The student will be able to identify the different preferences in infants and understand how they are influenced by the womb", "The student will be able to identify the different stages of development in the five senses and understand how they are influenced by the womb", "The student will be able to identify the different stages of development in the five senses and understand how they are influenced by the womb"]}, {"title": "Language", "content": "{{Main|Language development}}\nBabies are born with the ability to discriminate virtually all sounds of all human languages.<ref name=Berk />{{rp|189}} Infants of around six months can differentiate between [[phoneme]]s in their own language, but not between similar phonemes in another language. Notably, infants are able to differentiate between various durations and sound levels and can easily differentiate all the languages they have encountered, hence easy for infants to understand a certain language compared to an adult.<ref>{{Cite journal |last=Deuchar |first=Margaret |date=March 1998 |title=Paul Fletcher & Brian MacWhinney (eds.), ''The Handbook of Child Language''. Oxford: Blackwell, 1995. Pp. x+786. |url=http://dx.doi.org/10.1017/s0022226797256896 |journal=Journal of Linguistics |volume=34 |issue=1 |pages=227–297 |doi=10.1017/s0022226797256896 |issn=0022-2267}}</ref>\n\nAt this stage infants also start to [[Babbling|babble]], whereby they start making vowel consonant sound as they try to understand the true meaning of language and copy whatever they are hearing in their surrounding producing their own phonemes.\n\nIn various cultures, a distinct form of speech called \"babytalk\" is used when communicating with newborns and young children. This register consists of simplified terms for common topics such as family members, food, hygiene, and familiar animals. It also exhibits specific phonological patterns, such as substituting alveolar sounds with initial velar sounds, especially in languages like English. Furthermore, babytalk often involves morphological simplifications, such as regularizing verb conjugations (for instance, saying \"corned\" instead of \"cornered\" or \"goed\" instead of \"went\"). This language is typically taught to children and is perceived as their natural way of communication. Interestingly, in mythology and popular culture, certain characters, such as the \"Hausa trickster\" or the Warner Bros cartoon character \"Tweety Pie\", are portrayed as speaking in a babytalk-like manner.<ref>{{Cite journal |last1=Menn |first1=Lise |last2=Stoel-Gammon |first2=Carol |date=2017-08-18 |title=Phonological Development |url=http://dx.doi.org/10.1111/b.9780631203124.1996.00014.x |journal=The Handbook of Child Language |pages=335–360 |doi=10.1111/b.9780631203124.1996.00014.x|isbn=978-0-631-20312-4 }}</ref>\n\n", "goals": ["The student will be able to identify the development of language in infants and children, and understand the role of babytalk in language development", "The student will be able to explain the role of phonemes and phonological patterns in language development, and understand the role of babytalk in language development", "The student will be able to explain the role of morphological simplifications in language development, and understand the role of babytalk in language development", "The student will be able to identify the role of popular culture and mythology in shaping language development, and understand the role of babytalk in language development", "The student will be able to identify the role of language development in shaping popular culture and mythology, and understand the role of babytalk in language development"]}, {"title": "Infant cognition: the Piagetian era", "content": "Piaget suggested that an infant's perception and understanding of the world depended on their motor development, which was required for the infant to link visual, tactile and motor representations of objects.<ref>Lefmann, T. & Combs-Orme, T. 2013, \"Early Brain Development for Social Work Practice: Integrating Neuroscience with Piaget's Theory of Cognitive Development\", Journal of Human Behavior in the Social Environment, vol. 23, no. 5, pp. 640-647.</ref> According to this theory, infants develop [[object permanence]] through touching and handling objects. Infants start to understanding that objects continue to exist when out of sight.<ref name=\"bremner\" />\n\nPiaget's sensorimotor stage comprised six sub-stages (see [[Theory of cognitive development#Sensorimotor stage|sensorimotor stages]] for more detail). In the early stages, development arises out of movements caused by [[primitive reflexes]].<ref name=\"Gruber\">{{Cite book | vauthors = Piaget J |year=1977 |title=The essential Piaget \\| veditors = Gruber HE, Voneche JJ |location=New York |publisher=Basic Books |isbn=978-0-7100-8778-2}}</ref> Discovery of new behaviors results from [[classical conditioning|classical]] and [[operant conditioning]], and the formation of [[habit (psychology)|habits]].<ref name=\"Gruber\" /> From eight months the infant is able to uncover a hidden object but will persevere when the object is moved.\n\nPiaget concluded that infants lacked object permanence before 18 months when infants' before this age failed to look for an object where it had last been seen. Instead, infants continued to look for an object where it was first seen, committing the \"[[A-not-B error]]\". Some researchers have suggested that before the age of 8-9 months, infants' inability to understand object permanence extends to people, which explains why infants at this age do not cry when their mothers are gone (\"Out of sight, out of mind\").\n\n====Recent findings in infant cognition====\nIn the 1980s and 1990s, researchers developed new methods of assessing infants' understanding of the world with far more precision and subtlety than Piaget was able to do in his time. Since then, many studies based on these methods suggest that young infants understand far more about the world than first thought.\n\nBased on recent findings, some researchers (such as [[Elizabeth Spelke]] and [[Renee Baillargeon]]) have proposed that an understanding of object permanence is not learned at all, but rather comprises part of the innate cognitive capacities of our species.\n\nAccording to Jean Piaget's developmental psychology, object permanence, or the awareness that objects exist even when they are no longer visible, was thought to emerge gradually between the ages of 8 and 12 months. However, experts such as Elizabeth Spelke and Renee Baillargeon have questioned this notion. They studied infants' comprehension of object permanence at a young age using novel experimental approaches such as violation-of-expectation paradigms. These findings imply that children as young as 3 to 4 months old may have an innate awareness of object permanence. Baillargeon's \"drawbridge\" experiment, for example, showed that infants were surprised when they saw occurrences that contradicted object permanence expectations. This proposition has important consequences for our understanding of infant cognition, implying that infants may be born with core cognitive abilities rather than developing them via experience and learning.<ref>{{Citation |last1=Meltzoff |first1=Andrew N. |title=Learning about the mind from evidence |date=2013-08-22 |work=Understanding Other Minds |pages=19–34 |url=http://dx.doi.org/10.1093/acprof:oso/9780199692972.003.0002 |access-date=2024-04-02 |publisher=Oxford University Press |last2=Gopnik |first2=Alison|doi=10.1093/acprof:oso/9780199692972.003.0002 |isbn=978-0-19-969297-2 }}</ref>\n\nOther research has suggested that young infants in their first six months of life may possess an understanding of numerous aspects of the world around them, including:\n* an early [[numerical cognition]], that is, an ability to represent number and even compute the outcomes of addition and subtraction operations;<ref>{{cite journal | vauthors = Wynn K | title = Addition and subtraction by human infants | journal = Nature | volume = 358 | issue = 6389 | pages = 749–750 | date = August 1992 | pmid = 1508269 | doi = 10.1038/358749a0 | s2cid = 4348056 | bibcode = 1992Natur.358..749W | author-link1 = Karen Wynn }}</ref>\n* an ability to infer the goals of people in their environment;<ref>{{cite journal | vauthors = Woodward AL | title = Infants selectively encode the goal object of an actor's reach | journal = Cognition | volume = 69 | issue = 1 | pages = 1–34 | date = November 1998 | pmid = 9871370 | doi = 10.1016/S0010-0277(98)00058-4 | s2cid = 3081461 }}</ref>\n* an ability to engage in simple causal reasoning.<ref>{{cite journal | vauthors = Leslie AM, Keeble S | title = Do six-month-old infants perceive causality? | journal = Cognition | volume = 25 | issue = 3 | pages = 265–288 | date = April 1987 | pmid = 3581732 | doi = 10.1016/S0010-0277(87)80006-9 | s2cid = 29558332 }}</ref>\n\n", "goals": ["The student will be able to describe the development of object permanence in infants", "The student will be able to describe the development of object permanence in infants", "The student will be able to describe the development of object permanence in infants", "The student will be able to describe the development of object permanence in infants", "The student will be able to describe the development of object permanence in infants"]}, {"title": "Recent findings in infant cognition", "content": "In the 1980s and 1990s, researchers developed new methods of assessing infants' understanding of the world with far more precision and subtlety than Piaget was able to do in his time. Since then, many studies based on these methods suggest that young infants understand far more about the world than first thought.\n\nBased on recent findings, some researchers (such as [[Elizabeth Spelke]] and [[Renee Baillargeon]]) have proposed that an understanding of object permanence is not learned at all, but rather comprises part of the innate cognitive capacities of our species.\n\nAccording to Jean Piaget's developmental psychology, object permanence, or the awareness that objects exist even when they are no longer visible, was thought to emerge gradually between the ages of 8 and 12 months. However, experts such as Elizabeth Spelke and Renee Baillargeon have questioned this notion. They studied infants' comprehension of object permanence at a young age using novel experimental approaches such as violation-of-expectation paradigms. These findings imply that children as young as 3 to 4 months old may have an innate awareness of object permanence. Baillargeon's \"drawbridge\" experiment, for example, showed that infants were surprised when they saw occurrences that contradicted object permanence expectations. This proposition has important consequences for our understanding of infant cognition, implying that infants may be born with core cognitive abilities rather than developing them via experience and learning.<ref>{{Citation |last1=Meltzoff |first1=Andrew N. |title=Learning about the mind from evidence |date=2013-08-22 |work=Understanding Other Minds |pages=19–34 |url=http://dx.doi.org/10.1093/acprof:oso/9780199692972.003.0002 |access-date=2024-04-02 |publisher=Oxford University Press |last2=Gopnik |first2=Alison|doi=10.1093/acprof:oso/9780199692972.003.0002 |isbn=978-0-19-969297-2 }}</ref>\n\nOther research has suggested that young infants in their first six months of life may possess an understanding of numerous aspects of the world around them, including:\n* an early [[numerical cognition]], that is, an ability to represent number and even compute the outcomes of addition and subtraction operations;<ref>{{cite journal | vauthors = Wynn K | title = Addition and subtraction by human infants | journal = Nature | volume = 358 | issue = 6389 | pages = 749–750 | date = August 1992 | pmid = 1508269 | doi = 10.1038/358749a0 | s2cid = 4348056 | bibcode = 1992Natur.358..749W | author-link1 = Karen Wynn }}</ref>\n* an ability to infer the goals of people in their environment;<ref>{{cite journal | vauthors = Woodward AL | title = Infants selectively encode the goal object of an actor's reach | journal = Cognition | volume = 69 | issue = 1 | pages = 1–34 | date = November 1998 | pmid = 9871370 | doi = 10.1016/S0010-0277(98)00058-4 | s2cid = 3081461 }}</ref>\n* an ability to engage in simple causal reasoning.<ref>{{cite journal | vauthors = Leslie AM, Keeble S | title = Do six-month-old infants perceive causality? | journal = Cognition | volume = 25 | issue = 3 | pages = 265–288 | date = April 1987 | pmid = 3581732 | doi = 10.1016/S0010-0277(87)80006-9 | s2cid = 29558332 }}</ref>\n\n", "goals": ["The student will be able to describe the development of object permanence in infants and the role of Piaget's theory in this development", "The student will be able to explain the methods used by researchers to assess infants' understanding of the world and the implications of these findings for our understanding of infant cognition", "The student will be able to distinguishe between the different aspects of infant cognition that have been discovered, such as numerical cognition, the ability to infer the goals of people, and the ability to engage in simple causal reasoning, and describe the evidence for these abilities in infants", "The student will be able to compare and contrast the different theories of infant cognition, such as Piaget's theory and the theories of researchers such as Elizabeth Spelke and Renee Baillargeon, and evaluate the strengths and weaknesses of each theory in explaining", "The student will be able to evaluate the implications of these findings for our understanding of infant cognition and the development of cognitive abilities in general, and discuss the potential for the development of early interventions to support the development of cognitive abilities in infants"]}, {"title": "Critical periods of development", "content": "There are [[critical period]]s in infancy and childhood during which development of certain perceptual, sensorimotor, social and language systems depends crucially on environmental stimulation.<ref name=\"Siegler\">{{Cite book | vauthors = Siegler R |year=2006 |title=How Children Develop, Exploring Child Development Student Media Tool Kit & Scientific American Reader to Accompany How Children Develop |location=New York |publisher=Worth Publishers |isbn=978-0-7167-6113-6}}</ref> [[Feral child]]ren such as [[Genie (feral child)|Genie]], deprived of adequate stimulation, fail to acquire important skills and are unable to learn in later childhood. In this case, Genie is used to represent the case of a feral child because she was socially neglected and abused while she was just a young girl. She underwent abnormal child psychology which involved problems with her linguistics. This happened because she was neglected while she was very young with no one to care about her and had less human contact. The concept of critical periods is also well-established in [[neurophysiology]], from the work of [[David H. Hubel|Hubel]] and [[Torsten Wiesel|Wiesel]] among others. Neurophysiology in infants generally provides correlating details that exists between neurophysiological details and clinical features and also focuses on vital information on rare and common neurological disorders that affect infants'''''.''''' \n\n====Developmental delays====\nStudies have been done to look at the differences in children who have developmental delays versus typical development. Normally when being compared to one another, mental age (MA) is not taken into consideration. There still may be differences in developmentally delayed (DD) children vs. typical development (TD) behavioral, emotional and other mental disorders. When compared to MA children there is a bigger difference between normal developmental behaviors overall. DDs can cause lower MA, so comparing DDs with TDs may not be as accurate. Pairing DDs specifically with TD children at similar MA can be more accurate. There are levels of behavioral differences that are considered as normal at certain ages. When evaluating DDs and MA in children, consider whether those with DDs have a larger amount of behavior that is not typical for their MA group. Developmental delays tend to contribute to other disorders or difficulties than their TD counterparts.<ref>{{cite journal | vauthors = Caplan B, Neece CL, Baker BL | title = Developmental level and psychopathology: comparing children with developmental delays to chronological and mental age matched controls | journal = Research in Developmental Disabilities | volume = 37 | pages = 143–151 | date = February 2015 | pmid = 25498740 | pmc = 4314378 | doi = 10.1016/j.ridd.2014.10.045 }}</ref>\n\n", "goals": ["The student will be able to identify the differences in children who have developmental delays versus typical development", "The student will be able to explain how developmental delays can contribute to other disorders or difficulties than their typical development counterparts", "The student will be able to describe the concept of critical periods in infancy and childhood during which development of certain perceptual, sensorimotor, social and language systems depends crucially on environmental stimulation", "The student will be able to distinguishe between the concept of critical periods and the concept of neurophysiology in infants", "The student will be able to explain the concept of feral children and how it relates to the concept of developmental delays"]}, {"title": "Developmental delays", "content": "Studies have been done to look at the differences in children who have developmental delays versus typical development. Normally when being compared to one another, mental age (MA) is not taken into consideration. There still may be differences in developmentally delayed (DD) children vs. typical development (TD) behavioral, emotional and other mental disorders. When compared to MA children there is a bigger difference between normal developmental behaviors overall. DDs can cause lower MA, so comparing DDs with TDs may not be as accurate. Pairing DDs specifically with TD children at similar MA can be more accurate. There are levels of behavioral differences that are considered as normal at certain ages. When evaluating DDs and MA in children, consider whether those with DDs have a larger amount of behavior that is not typical for their MA group. Developmental delays tend to contribute to other disorders or difficulties than their TD counterparts.<ref>{{cite journal | vauthors = Caplan B, Neece CL, Baker BL | title = Developmental level and psychopathology: comparing children with developmental delays to chronological and mental age matched controls | journal = Research in Developmental Disabilities | volume = 37 | pages = 143–151 | date = February 2015 | pmid = 25498740 | pmc = 4314378 | doi = 10.1016/j.ridd.2014.10.045 }}</ref>\n\n", "goals": ["The student will be able to identify the differences in behavior, emotional and other mental disorders in children with developmental delays compared to those with typical development", "The student will be able to evaluate the differences in behavior, emotional and other mental disorders in children with developmental delays compared to those with typical development by considering whether those with developmental delays have a larger amount of behavior that is not typical for their mental age group", "The student will be able to identify the relationship between developmental delays and other disorders or difficulties in children with developmental delays compared to those with typical development", "The student will be able to evaluate the relationship between developmental delays and other disorders or difficulties in children with developmental delays compared to those with typical development by comparing DDs specifically with TD children at similar mental age", "The student will be able to identify the differences in behavior, emotional and other mental disorders in children with developmental delays compared to those with typical development by comparing DDs specifically with TD children at similar mental age"]}, {"title": "Toddlerhood", "content": "{{Main|Toddler}}\nInfants shift between ages of one and two to a developmental stage known as toddlerhood. In this stage, an infant's transition into toddlerhood is highlighted through self-awareness, developing maturity in language use, and presence of memory and imagination.\n\nDuring toddlerhood, babies begin learning how to walk, talk, and make decisions for themselves. An important characteristic of this age period is the [[Language development|development of language]], where children are learning how to communicate and express their emotions and desires through the use of vocal sounds, babbling, and eventually words.<ref name=Upton>{{cite book| vauthors = Upton P |title=Developmental Psychology: Critical Thinking in Psychology|year=2011|publisher=Learning Matters|location=Exeter|isbn=978-0-85725-276-0|page=62}}</ref> Self-control also begins to develop. At this age, children take initiative to explore, experiment and learn from making mistakes. Caretakers who encourage toddlers to try new things and test their limits, help the child become autonomous, self-reliant, and confident.<ref name=ToddlerPlay>{{cite book| vauthors = Massi WS |title=Toddler Play|year=2001|publisher=Creative Pub. international|isbn=978-0-86573-435-7|url=https://archive.org/details/toddlerplaygymbo00wend}}</ref> If the caretaker is overprotective or disapproving of independent actions, the toddler may begin to doubt their abilities and feel ashamed of the desire for independence. The child's autonomic development is inhibited, leaving them less prepared to deal with the world in the future. Toddlers also begin to identify themselves in [[gender role]]s, acting according to their perception of what a man or woman should do.<ref name=UPton>{{cite book| vauthors = Upton P |title=Developmental Psychology: Critical Thinking in Psychology|year=2011|publisher=Learning Matters|location=Exeter|isbn=978-0-85725-276-0|page=84}}</ref>\n\nSocially, the period of toddler-hood is commonly called the \"terrible twos\".<ref name=Newman>{{cite book| vauthors = Newman BM, Newman PR |title=Development Through Life : A Psychosocial Approach|year=2011|publisher=Wadsworth Cengage Learning|location=Belmont, CA|isbn=978-1-111-34468-9|pages=215–217 }}</ref> Toddlers often use their new-found language abilities to voice their desires, but are often misunderstood by parents due to their language skills just beginning to develop. A person at this stage testing their independence is another reason behind the stage's infamous label. Tantrums in a fit of frustration are also common.\n\n", "goals": ["The student will be able to identify the developmental stage of toddlerhood and its characteristics, including language development, self-control, and the development of gender roles", "The student will be able to explain the importance of caretaker's role in the development of a toddler's autonomy and self-reliance", "The student will be able to describe the ", "The student will be able to describe the social aspect of toddlerhood, including the ", "The student will be able to describe the importance of the caretaker's role in the development of a toddler's autonomy and self-reliance"]}, {"title": "Childhood", "content": "{{See also|Early childhood}}\n[[Erik Erikson]] divides childhood into four stages, each with its distinct social crisis:<ref name=\"Bernardo J. Carducci 2009\">{{cite book | vauthors = Carducci BJ | title = The Psychology of Personality: Viewpoints, Research, and Applications | publisher = John Wiley & Sons | date = 2009 | page = 189 }}</ref>\n:* Stage 1: [[Infancy]] (0 to 1½) in which the psychosocial crisis is Trust vs. Mistrust\n:* Stage 2: Early childhood (2½ to 3) in which the psychosocial crisis is Autonomy vs. Shame and doubt\n:* Stage 3: Play age (3 to 5) in which the psychosocial crisis is Initiative vs. Guilt. (This stage is also called the \"pre-school age\", \"exploratory age\" and \"toy age\".)<ref>{{Cite web|url=http://www.vardhamaniqtoys.com/vision.aspx|archive-url=https://web.archive.org/web/20160304122300/http://www.vardhamaniqtoys.com/vision.aspx|url-status=dead|title=Vardhaman I.Q. Toys, \"Vision\"|archive-date=March 4, 2016}}</ref>\n:* Stage 4: School age (5 to 12) in which the psychosocial crisis is Industry vs. Inferiority\n'''Infancy'''\n\nAs stated, the psychosocial crisis for Erikson is Trust versus Mistrust. Needs are the foundation for gaining or losing trust in the infant. If the needs are met, trust in the guardian and the world forms. If the needs are not met, or the infant is neglected, mistrust forms alongside feelings of anxiety and fear.<ref>{{Cite journal |last1=Miller |first1=Sonja Ann |last2=College |first2=OpenStax |last3=Lang |first3=Diana |date=2022-08-01 |title=Psychosocial Theory: Erikson |url=https://iastate.pressbooks.pub/individualfamilydevelopment/chapter/erikson-and-psychosocial-theory/ |language=en}}</ref>\n\n'''Early Childhood'''\n\nAutonomy versus shame follows trust in infancy. The child begins to explore their world in this stage and discovers preferences in what they like. If autonomy is allowed, the child grows in independence and their abilities. If freedom of exploration is hindered, it leads to feelings of shame and low self-esteem.<ref>{{Cite journal |last1=Miller |first1=Sonja Ann |last2=College |first2=OpenStax |last3=Lang |first3=Diana |date=2022-08-01 |title=Psychosocial Theory: Erikson |url=https://iastate.pressbooks.pub/individualfamilydevelopment/chapter/erikson-and-psychosocial-theory/ |language=en}}</ref>  \n\n'''Play (or preschool) ages 3–5.'''<br />\nIn the earliest years, children are \"completely dependent on the care of others\". Therefore, they develop a \"social relationship\" with their care givers and, later, with family members. During their preschool years (3-5), they \"enlarge their social horizons\" to include people outside the family.<ref>{{cite book | vauthors = Thornton A | title = The Well-being of Children and Families: Research and Data Needs | publisher = University of Michigan Press | date = 2001 | pages = 73–74 }}</ref>\n\n[[Cognitive development#Preoperational stage|Preoperational]] and then [[Cognitive development#Concrete operational stage|operational]] thinking develops, which means actions are reversible, and egocentric thought diminishes.<ref>{{cite book | vauthors = Lightfoot C, Cole M, Cole SR | title = The Development of Children | publisher = Macmillan | date = 2008 | pages = 275–277 }}</ref>\n\nThe motor skills of preschoolers increase so they can do more things for themselves. They become more independent. No longer completely dependent on the care of others, the world of this age group expands. More people have a role in shaping their individual personalities. Preschoolers explore and question their world.<ref>{{cite web | publisher = Centers for Disease Control | title = Child Development: Preschoolers (3-5 years of age) | date = 11 February 2021 | url = https://www.cdc.gov/ncbddd/childdevelopment/positiveparenting/preschoolers.html }}</ref> For [[Jean Piaget]], the child is \"''a little scientist'' exploring and reflecting on these explorations to increase competence\" and this is done in \"a very independent way\".<ref name = \"Halpenny_2013\">{{cite book | vauthors = Halpenny AM, Pettersen J | title = Introducing Piaget: A Guide for Practitioners and Students in Early Years Education | publisher = Routledge | date = 2013 | pages = 7, 9 }}</ref>{{rp|7,9}}\n\nPlay is a major activity for ages 3–5. For Piaget, through play \"a child reaches higher levels of cognitive development.\"<ref name = \"Halpenny_2013\" />{{rp|14}}\n\nIn their expanded world, children in the 3–5 age group attempt to find their own way. If this is done in a socially acceptable way, the child develops the initiative. If not, the child develops guilt.<ref>{{cite book | vauthors = O'Connor B, Wells C, Applegate T | title = Health: You and Your World | volume =  1: Brief Edition | publisher = CreateSpace Independent Publishing Platform | date = 2015 | pages = 28 }}</ref> Children who develop \"guilt\" rather than \"initiative\" have failed Erikson's psychosocial crisis for the 3–5 age group.\n\n'''Middle and Late childhood ages 6–12.'''<br />\nFor Erik Erikson, the psychosocial crisis during middle childhood is Industry vs. Inferiority which, if successfully met, instills a sense of Competency in the child.<ref name=\"Bernardo J. Carducci 2009\" />\n\nIn all cultures, middle childhood is a time for developing \"skills that will be needed in their society.\"<ref name=\"Barbara Engler 2013\">{{cite book | vauthors = Engler B | title = Personality Theories | edition = 9th | publisher = Cengage Learning | date = 2013 | page = 142 }}</ref> School offers an arena in which children can gain a view of themselves as \"industrious (and worthy)\". They are \"graded for their school work and often for their industry\". They can also develop industry outside of school in sports, games, and doing volunteer work.<ref name=\"Marc H. Bornstein 2010\">{{cite book | vauthors = Bornstein MH, Vandell DL, Rook KS | title = Lifespan Development: Infancy Through Adulthood | publisher = Cengage Learning | date = 2010 | page = 299 }}</ref> Children who achieve \"success in school or games might develop a feeling of competence.\"\n\nThe \"peril during this period is that feelings of inadequacy and inferiority will develop.<ref name=\"Barbara Engler 2013\" /> Parents and teachers can \"undermine\" a child's development by failing to recognize accomplishments or being overly critical of a child's efforts.<ref name=\"Marc H. Bornstein 2010\" />\nChildren who are \"encouraged and praised\" develop a belief in their competence. Lack of encouragement or ability to excel lead to \"feelings of inadequacy and inferiority\".<ref>{{cite web | url = http://behavioralchild.com/milestones/ | vauthors = Broutian M | publisher = Milestones | title = Your child: early school years (7 to 11 years) stage of development | work = Your Child's Development | archive-url = https://web.archive.org/web/20151115170628/http://behavioralchild.com/milestones/ | archive-date= 15 November 2015 | access-date = 13 October 2015 }}</ref>\n\nThe [[Centers for Disease Control]] (CDC) divides Middle Childhood into two stages, 6–8 years and 9–11 years, and gives \"developmental milestones for each stage\".<ref name = \"CDC_CD_6-8\">{{cite web | work = Centers for Disease Control | title = Child Development: Middle Childhood (6-8 years of age) | date = 4 February 2021 | url = https://www.cdc.gov/ncbddd/childdevelopment/positiveparenting/middle.html }}</ref><ref name = \"CDC_CD_9-11\">{{cite web | work = Centers for Disease Control | title = Child Development: Middle Childhood (9-11 years of age) | url = https://www.cdc.gov/ncbddd/childdevelopment/positiveparenting/middle2.html | access-date = 15 October 2015 }}</ref>\n\n''Middle Childhood (6–8).''<br />\nEntering elementary school, children in this age group begin to thinks about the future and their \"place in the world\". Working with other students and wanting their friendship and acceptance become more important. This leads to \"more independence from parents and family\". As students, they develop the mental and verbal skills \"to describe experiences and talk about thoughts and feelings\". They become less self-centered and show \"more concern for others\".<ref name = \"CDC_CD_6-8\" />\n\n''Late Childhood (9–12).''<br />\nFor children ages 9–11 \"friendships and peer relationships\" increase in strength, complexity, and importance. This results in greater \"peer pressure\". They grow even less dependent on their families and they are challenged academically. To meet this challenge, they increase their attention span and learn to see other points of view.<ref name = \"CDC_CD_9-11\" />\n\n", "goals": ["The student will be able to identify the psychosocial crisis for each stage of Erik Erikson's developmental psychology and explain how it is met or not met", "The student will be able to identify the developmental milestones for each stage of Erik Erikson's developmental psychology and explain how they are met or not met", "The student will be able to identify the cognitive development for each stage of Erik Erikson's developmental psychology and explain how it is met or not met", "The student will be able to identify the motor skills for each stage of Erik Erikson's developmental psychology and explain how they are met or not met", "The student will be able to identify the social relationships for each stage of Erik Erikson's developmental psychology and explain how they are met or not met"]}, {"title": "Middle adulthood", "content": "{{Main|Middle age}}\nMiddle adulthood generally refers to the period between ages 40 to 64. During this period, middle-aged adults experience a conflict between generativity and stagnation. Generativity is the sense of contributing to society, the next generation, or their immediate community. On the other hand, stagnation results in a lack of purpose.<ref>{{cite journal | vauthors = Helson R, Soto CJ | title = Up and down in middle age: monotonic and nonmonotonic changes in roles, status, and personality | journal = Journal of Personality and Social Psychology | volume = 89 | issue = 2 | pages = 194–204 | date = August 2005 | pmid = 16162053 | doi = 10.1037/0022-3514.89.2.194 }}</ref> The adult's identity continues to develop in middle-adulthood. Middle-aged adults often adopt opposite gender characeristics. The adult realizes they are half-way through their life and often reevaluate vocational and social roles. Life circumstances can also cause a reexamination of identity.<ref>{{Cite journal |last=Sokol |first=Justin |date=2009 |title=Identity Development Throughout the Lifetime: An Examination of Eriksonian Theory |url=https://epublications.marquette.edu/cgi/viewcontent.cgi?article=1030&context=gjcp |journal=Graduate Journal of Counseling Psychology |volume=1 |issue=2 |pages=12 |via=e-Publications@Marquette}}</ref>  \n\nPhysically, the middle-aged experience a decline in muscular strength, reaction time, sensory keenness, and cardiac output. Also, women experience [[menopause]] at an average age of 48.8 and a sharp drop in the hormone [[estrogen]].<ref>{{cite journal | vauthors = Schoenaker DA, Jackson CA, Rowlands JV, Mishra GD | title = Socioeconomic position, lifestyle factors and age at natural menopause: a systematic review and meta-analyses of studies across six continents | journal = International Journal of Epidemiology | volume = 43 | issue = 5 | pages = 1542–1562 | date = October 2014 | pmid = 24771324 | pmc = 4190515 | doi = 10.1093/ije/dyu094 }}</ref> Men experience an equivalent endocrine system event to menopause. [[Andropause]] in males is a hormone fluctuation with physical and psychological effects that can be similar to those seen in menopausal females. As men age lowered testosterone levels can contribute to mood swings and a decline in [[spermatozoa|sperm]] count. Sexual responsiveness can also be affected, including delays in [[erection]] and longer periods of [[penile stimulation]] required to achieve [[ejaculation]].\n\nThe important influence of biological and social changes experienced by women and men in middle adulthood is reflected in the fact that depression is highest at age 48.5 around the world.<ref>{{cite journal | vauthors = Blanchflower DG, Oswald AJ | title = Is well-being U-shaped over the life cycle? | journal = Social Science & Medicine | volume = 66 | issue = 8 | pages = 1733–1749 | date = April 2008 | pmid = 18316146 | doi = 10.1016/j.socscimed.2008.01.030 | url = http://www.nber.org/papers/w12935.pdf }}</ref>\n\n", "goals": ["The student will be able to identify the various factors that influence the development of identity in middle adulthood", "The student will be able to describe the physical changes that occur in middle adulthood", "The student will be able to explain the relationship between socioeconomic position, lifestyle factors, and age at natural menopause", "The student will be able to distinguishe the differences between menopause in women and andropause in men", "The student will be able to identify the factors that contribute to the decline in sexual responsiveness in middle adulthood"]}, {"title": "Old age", "content": "{{Main|Old age}}\nThe [[World Health Organization]] finds \"no general agreement on the age at which a person becomes old.\" Most [[Developed country|\"developed countries\"]] set the age as 65 or 70. However, in [[Developing country|developing countries]] inability to make \"active contribution\" to society, not chronological age, marks the beginning of old age.<ref>{{cite web | title = Definition of an older or elderly person | work = World Health Organization | url = http://www.who.int/healthinfo/survey/ageingdefnolder/en/ | access-date = 11 October 2015 }}</ref> According to [[Erikson's stages of psychosocial development]], old age is the stage in which individuals assess the quality of their lives.<ref name=\"Miller2003\">{{cite book |url=https://books.google.com/books?id=rPcwuEe9MBQC&pg=PA242 |title=Encyclopedia of Human Ecology: I-Z |vauthors=Miller JR |publisher=ABC-CLIO |year=2003 |isbn=978-1-57607-852-5 |pages=242– |access-date=4 December 2012}}</ref> \n\nErikson labels this stage as integrity versus despair. For integrated persons, there is a sense of fulfillment in life. They have become self-aware and optimistic due to life's commitments and connection to others. While reflecting on life, people in this stage develop feelings of contentment with their experiences. If a person falls into despair, they are often disapointed about failures or missed chances in life. They may feel that the time left in life is an insufficient amount to turn things around.<ref>{{Cite journal |last1=Hearn |first1=Simon |last2=Saulnier |first2=Gary |last3=Strayer |first3=Janet |last4=Glenham |first4=Margarete |last5=Koopman |first5=Ray |last6=Marcia |first6=James E. |date=2012-03-01 |title=Between Integrity and Despair: Toward Construct Validation of Erikson's Eighth Stage |url=https://doi.org/10.1007/s10804-011-9126-y |journal=Journal of Adult Development |language=en |volume=19 |issue=1 |pages=1–20 |doi=10.1007/s10804-011-9126-y |issn=1573-3440}}</ref>   \n\nPhysically, older people experience a decline in muscular strength, reaction time, stamina, hearing, distance perception, and the sense of smell.<ref name=\"Deary2011\">{{cite journal | vauthors = Deary IJ, Johnson W, Gow AJ, Pattie A, Brett CE, Bates TC, Starr JM | title = Losing one's grip: a bivariate growth curve model of grip strength and nonverbal reasoning from age 79 to 87 years in the Lothian Birth Cohort 1921 | journal = The Journals of Gerontology. Series B, Psychological Sciences and Social Sciences | volume = 66 | issue = 6 | pages = 699–707 | date = November 2011 | pmid = 21743039 | doi = 10.1093/geronb/gbr059 | doi-access = free | hdl = 20.500.11820/a59dc7c1-af60-4f02-a8be-37987b26f9a4 | hdl-access = free }}</ref> They also are more susceptible to diseases such as cancer and pneumonia due to a weakened immune system.<ref>{{cite news | title = The Immune System in the Elderly: A Fair Fight Against Diseases? | newspaper = Medscape | url = http://www.medscape.com/viewarticle/780507_2 | archive-url = https://web.archive.org/web/20130619221724/http://www.medscape.com/viewarticle/780507_2 | url-status = live | archive-date = June 19, 2013 | access-date = November 8, 2013 }}</ref> Programs aimed at balance, muscle strength, and mobility have been shown to reduce disability among mildly (but not more severely) disabled elderly.<ref name=\"Gill2002\">{{cite journal | vauthors = Gill TM, Baker DI, Gottschalk M, Peduzzi PN, Allore H, Byers A | title = A program to prevent functional decline in physically frail, elderly persons who live at home | journal = The New England Journal of Medicine | volume = 347 | issue = 14 | pages = 1068–1074 | date = October 2002 | pmid = 12362007 | doi = 10.1056/NEJMoa020423 | doi-access = free }}</ref>\n\nSexual expression depends in large part upon the emotional and physical health of the individual. Many older adults continue to be sexually active and satisfied with their sexual activity.<ref>{{cite book| vauthors = Cavanaugh JC, Blanchard-Fields F | author-link2=Fredda Blanchard-Fields | name-list-style = vanc |title=Adult development and aging|year=2009|publisher=Wadsworth/Cengage Learning|location=Australia|isbn=978-0-495-60174-6|pages=89–90|edition=6th}}</ref>\n\nMental [[wikt:disintegration|disintegration]] may also occur, leading to [[dementia]] or ailments such as [[Alzheimer's disease]]. The average age of onset for dementia in males is 78.8 and 81.9 for women.<ref>{{cite journal | vauthors = Brinks R, Landwehr S, Waldeyer R | title = Age of onset in chronic diseases: new method and application to dementia in Germany | journal = Population Health Metrics | volume = 11 | issue = 1 | pages = 6 | year = 2013 | pmid = 23638981 | pmc = 3665482 | doi = 10.1186/1478-7954-11-6 | doi-access = free }}</ref> It is generally believed that [[crystallized intelligence]] increases up to old age, while [[fluid intelligence]] decreases with age.<ref>[https://web.archive.org/web/20000525173324/http://www.webster.edu/~woolflm/cognitions.html Woolf, Linda M. \"Theoretical Perspectives Relevant to Developmental Psychology\", Webster, 1998.]  Retrieved on 2012-03-16.</ref> Whether or not normal intelligence increases or decreases with age depends on the measure and study. [[Longitudinal study|Longitudinal studies]] show that perceptual speed, inductive reasoning, and spatial orientation decline.<ref name=\"What Can We Learn From Longitudinal\">{{cite journal | vauthors = Schaie KW | title = What Can We Learn From Longitudinal Studies of Adult Development? | journal = Research in Human Development | volume = 2 | issue = 3 | pages = 133–158 | year = 2005 | pmid = 16467912 | pmc = 1350981 | doi = 10.1207/s15427617rhd0203_4 }}</ref> An article on adult cognitive development reports that [[Cross-sectional study|cross-sectional studies]] show that \"some abilities remained stable into early old age\".<ref name=\"What Can We Learn From Longitudinal\"/>\n\n", "goals": ["The student will be able to identify the stages of Erikson's psychosocial development and understand the importance of integrity versus despair in old age", "The student will be able to describe the physical decline that occurs in old age, including the decline in muscular strength, reaction time, stamina, hearing, distance perception, and the sense of smell", "The student will be able to explain the role of sexual expression in the lives of older adults and understand the factors that contribute to sexual satisfaction in this age group", "The student will be able to distinguishe between the concepts of crystallized intelligence and fluid intelligence and understand the relationship between these concepts and age", "The student will be able to identify the factors that contribute to the development of dementia and understand the average age of onset for dementia in males and females"]}, {"title": "Mother and father factors", "content": "Parenting roles in child development have typically focused on the role of the mother. Recent literature, however, has looked toward the father as having an important role in child development. Affirming a role for fathers, studies have shown that children as young as 15 months benefit significantly from substantial engagement with their father.<ref name=\"aredos\">{{Cite web |url=https://www.ericdigests.org/2004-3/role.html |date=November 2003 |first1=Vivian |last1=Gadsden |first2=Aisha |last2=Ray |title=Fathers' Role in Children's Academic Achievement and Early Literacy. ERIC Digest |quote=Privately owned website |website=www.ericdigests.org |access-date=2021-05-07 |archive-date=2021-05-07 |archive-url=https://web.archive.org/web/20210507045005/https://www.ericdigests.org/2004-3/role.html |url-status=dead }}</ref><ref>{{Cite web|url=http://video.google.com/videoplay?docid=-2125328669291708941|title=\"Children with active, involved fathers have better social skills, are healthier, and do better in school\", according to Duane Wilson, the Proud Fathers, Proud Parents program coordinator for the Michigan Department of Human Services (2:57)}}</ref> In particular, a study in the U.S. and New Zealand found the presence of the natural father was the most significant factor in reducing rates of early sexual activity and rates of teenage pregnancy in girls.<ref name=\"pmid12795391\">{{cite journal | vauthors = Ellis BJ, Bates JE, Dodge KA, Fergusson DM, Horwood LJ, Pettit GS, Woodward L | title = Does father absence place daughters at special risk for early sexual activity and teenage pregnancy? | journal = Child Development | volume = 74 | issue = 3 | pages = 801–21 | date = 2003 | pmid = 12795391 | pmc = 2764264 | doi = 10.1111/1467-8624.00569 }}</ref> Furthermore, another argument is that neither a mother nor a father is actually essential in successful parenting, and that single parents as well as homosexual couples can support positive child outcomes.<ref name=Silverstein>{{cite journal| vauthors = Silverstein L, Auerbach C |title=Deconstructing the Essential Father|journal=American Psychologist|year=1999|volume=54|issue=6|pages=397–407|doi=10.1037/0003-066x.54.6.397|citeseerx=10.1.1.619.1091}}</ref> According to this set of research, children need at least one consistently responsible adult with whom the child can have a positive emotional connection. Having more than one of these figures contributes to a higher likelihood of positive child outcomes.<ref name=Silverstein />\n\n", "goals": ["The student will be able to identify the role of fathers in child development and the importance of a father's involvement in a child's life", "The student will be able to identify the role of fathers in child development and the importance of a father's involvement in a child's life", "The student will be able to identify the role of fathers in child development and the importance of a father's involvement in a child's life", "The student will be able to identify the role of fathers in child development and the importance of a father's involvement in a child's life", "The student will be able to identify the role of fathers in child development and the importance of a father's involvement in a child's life"]}, {"title": " Cross-cultural ", "content": "A way to improve developmental psychology is a representation of cross-cultural studies. The psychology field in general assumes that \"basic\" human developments are represented in any population, specifically the Western-Educated-Industrialized-Rich and Democratic (W.E.I.R.D.) subjects that are relied on for a majority of their studies. Previous research generalizes the findings done with W.E.I.R.D. samples because many in the Psychological field assume certain aspects of development are exempted from or are not affected by life experiences. However, many of the assumptions have been proven incorrect or are not supported by empirical research. For example, according to Kohlberg, moral reasoning is dependent on cognitive abilities. While both analytical and holistic cognitive systems do have the potential to develop in any adult, the West is still on the extreme end of analytical thinking, and the non-West tend to use holistic processes. Furthermore, moral reasoning in the West only considers aspects that support autonomy and the individual, whereas non-Western adults emphasize moral behaviors supporting the community and maintaining an image of holiness or divinity. Not all aspects of human development are universal and we can learn a lot from observing different regions and subjects.<ref name=\":03\">{{Cite journal |last1=Henrich |first1=Joseph |last2=Heine |first2=Steven J. |last3=Norenzayan |first3=Ara |date=2010 |title=The weirdest people in the world? |url=https://www.cambridge.org/core/product/identifier/S0140525X0999152X/type/journal_article |journal=Behavioral and Brain Sciences |language=en |volume=33 |issue=2–3 |pages=61–83 |doi=10.1017/S0140525X0999152X |pmid=20550733 |s2cid=219338876 |issn=0140-525X}}</ref> \n\n=== Indian Model of Human Development ===\nAn example of a non-West model for development stages is the Indian model, focusing a large amount of its psychological research on morality and interpersonal progress. The developmental stages in Indian models are founded by Hinduism, which primarily teaches stages of life in the process of someone discovering their fate or [[Dharma]].<ref name=\":12\">{{Cite journal |last=Kakar |first=Sudhir |date=1968 |title=The Human Life Cycle: The Traditional Hindu View and the Psychology of Erik Erikson |url=https://www.jstor.org/stable/1398255 |journal=Philosophy East and West |volume=18 |issue=3 |pages=127–136 |doi=10.2307/1398255|jstor=1398255 }}</ref> This cross-cultural model can add another perspective to psychological development in which the West behavioral sciences have not emphasized kinship, ethnicity, or religion.<ref name=\":03\" />\n\nIndian psychologists study the relevance of attentive families during the early stages of life. The early life stages conceptualize a different parenting style from the West because it does not try to rush children out of dependency. The family is meant to help the child grow into the next developmental stage at a particular age. This way, when children finally integrate into society, they are interconnected with those around them and reach [[Sannyasa|renunciation]] when they are older. Children are raised in joint families so that in early childhood (ages 6 months to 2 years) the other family members help gradually wean the child from its mother. During ages 2 to 5, the parents do not rush toilet training. Instead of training the child to perform this behavior, the child learns to do it as they mature at their own pace. This model of early human development encourages dependency, unlike Western models that value autonomy and independence. By being attentive and not forcing the child to become independent, they are confident and have a sense of belonging by late childhood and adolescence. This stage in life (5-15 years) is also when children start education and increase their knowledge of Dharma.<ref>{{Cite journal |last=Rangaswami |first=K. |date=1992 |title=Indian Model of Stages in Human Development and Developmental Tasks |journal=Indian Journal of Psychological Medicine |language=en |volume=15 |issue=1 |pages=77–82 |doi=10.1177/0975156419920112 |s2cid=220540832 |issn=0253-7176|doi-access=free }}</ref> It is within early and middle adulthood that we see moral development progress. Early, middle, and late adulthood are all concerned with caring for others and fulfilling Dharma. The main distinction between early adulthood to middle or late adulthood is how far their influence reaches. Early adulthood emphasizes the importance of fulfilling the immediate family needs, until later adulthood when they broaden their responsibilities to the general public. The old-age life stage development reaches renunciation or a complete understanding of Dharma.<ref name=\":12\" />\n\nThe current mainstream views in the psychological field are against the Indian model for human development. The criticism against such models is that the parenting style is overly protective and encourages too much dependency. It focuses on interpersonal instead of individual goals. Also, there are some overlaps and similarities between Erikson's stages of human development and the Indian model but both of them still have major differences. The West prefers Erickson's ideas over the Indian model because they are supported by scientific studies. The life cycles based on Hinduism are not as favored, because it is not supported with research and it focuses on the ideal human development.<ref name=\":12\" />\n\n", "goals": ["The student will be able to describe the Indian model of human development and compare it to the Western model", "The student will be able to describe the Indian model of human development and compare it to the Western model", "The student will be able to describe the Indian model of human development and compare it to the Western model", "The student will be able to describe the Indian model of human development and compare it to the Western model", "The student will be able to describe the Indian model of human development and compare it to the Western model"]}, {"title": " Indian Model of Human Development ", "content": "An example of a non-West model for development stages is the Indian model, focusing a large amount of its psychological research on morality and interpersonal progress. The developmental stages in Indian models are founded by Hinduism, which primarily teaches stages of life in the process of someone discovering their fate or [[Dharma]].<ref name=\":12\">{{Cite journal |last=Kakar |first=Sudhir |date=1968 |title=The Human Life Cycle: The Traditional Hindu View and the Psychology of Erik Erikson |url=https://www.jstor.org/stable/1398255 |journal=Philosophy East and West |volume=18 |issue=3 |pages=127–136 |doi=10.2307/1398255|jstor=1398255 }}</ref> This cross-cultural model can add another perspective to psychological development in which the West behavioral sciences have not emphasized kinship, ethnicity, or religion.<ref name=\":03\" />\n\nIndian psychologists study the relevance of attentive families during the early stages of life. The early life stages conceptualize a different parenting style from the West because it does not try to rush children out of dependency. The family is meant to help the child grow into the next developmental stage at a particular age. This way, when children finally integrate into society, they are interconnected with those around them and reach [[Sannyasa|renunciation]] when they are older. Children are raised in joint families so that in early childhood (ages 6 months to 2 years) the other family members help gradually wean the child from its mother. During ages 2 to 5, the parents do not rush toilet training. Instead of training the child to perform this behavior, the child learns to do it as they mature at their own pace. This model of early human development encourages dependency, unlike Western models that value autonomy and independence. By being attentive and not forcing the child to become independent, they are confident and have a sense of belonging by late childhood and adolescence. This stage in life (5-15 years) is also when children start education and increase their knowledge of Dharma.<ref>{{Cite journal |last=Rangaswami |first=K. |date=1992 |title=Indian Model of Stages in Human Development and Developmental Tasks |journal=Indian Journal of Psychological Medicine |language=en |volume=15 |issue=1 |pages=77–82 |doi=10.1177/0975156419920112 |s2cid=220540832 |issn=0253-7176|doi-access=free }}</ref> It is within early and middle adulthood that we see moral development progress. Early, middle, and late adulthood are all concerned with caring for others and fulfilling Dharma. The main distinction between early adulthood to middle or late adulthood is how far their influence reaches. Early adulthood emphasizes the importance of fulfilling the immediate family needs, until later adulthood when they broaden their responsibilities to the general public. The old-age life stage development reaches renunciation or a complete understanding of Dharma.<ref name=\":12\" />\n\nThe current mainstream views in the psychological field are against the Indian model for human development. The criticism against such models is that the parenting style is overly protective and encourages too much dependency. It focuses on interpersonal instead of individual goals. Also, there are some overlaps and similarities between Erikson's stages of human development and the Indian model but both of them still have major differences. The West prefers Erickson's ideas over the Indian model because they are supported by scientific studies. The life cycles based on Hinduism are not as favored, because it is not supported with research and it focuses on the ideal human development.<ref name=\":12\" />\n\n", "goals": ["The student will be able to describe the Indian model of human development and its stages, and compare it to the Western model of human development", "The student will be able to describe the Indian model of human development and its stages, and compare it to the Western model of human development", "The student will be able to describe the Indian model of human development and its stages, and compare it to the Western model of human development", "The student will be able to describe the Indian model of human development and its stages, and compare it to the Western model of human development", "The student will be able to describe the Indian model of human development and its stages, and compare it to the Western model of human development"]}, {"title": "Further reading", "content": "{{refbegin}}\n* {{cite journal | vauthors = Bjorklund DF, Pellegrini AD | title = Child development and evolutionary psychology | journal = Child Development | volume = 71 | issue = 6 | pages = 1687–1708 | year = 2000 | pmid = 11194266 | doi = 10.1111/1467-8624.00258 | url = http://bernard.pitzer.edu/~dmoore/psych199s03articles/Bjorklund.pdf#search='evolutionary%20developmental%20psychology | access-date = 2005-12-01 | url-status = dead | citeseerx = 10.1.1.132.1981 | archive-url = https://web.archive.org/web/20110812085718/http://bernard.pitzer.edu/~dmoore/psych199s03articles/Bjorklund.pdf#search='evolutionary%20developmental%20psychology | archive-date = 2011-08-12 }}\n* {{cite book | editor = Bornstein MH, Lamb ME | date = 2005 | title = Developmental science: An advanced textbook |edition = 5th |isbn = 0-8058-5163-1   | location = Mahwah, NJ | publisher = Lawrence Erlbaum Associates Publishers.}}\n* {{cite journal| vauthors = Johnson-Pynn J, Fragaszy DM, Cummins-Sebree S |title=Common territories in comparative and developmental psychology: The quest for shared means and meaning in behavioral investigations.|journal=International Journal of Comparative Psychology|year=2003|volume=16|pages=1–27|doi=10.46867/C4D308 |s2cid=6674770 |url=http://psychology.uga.edu/people/bios/faculty/FragaszyDoc/Johnson-Pynn,%20Fragaszy%20and%20Sebree%202003%20Common%20territories%20in%20comparative%20and%20developmental%20psychology,%20Int%20J%20Comp%20Psych%2016,%201-27.pdf|access-date=2012-06-29|archive-url=https://web.archive.org/web/20130524042218/http://psychology.uga.edu/people/bios/faculty/FragaszyDoc/Johnson-Pynn,%20Fragaszy%20and%20Sebree%202003%20Common%20territories%20in%20comparative%20and%20developmental%20psychology,%20Int%20J%20Comp%20Psych%2016,%201-27.pdf|archive-date=2013-05-24|url-status=dead}}\n* {{cite book | vauthors = Lerner RM | title = Concepts and theories of human development | location = Mahwah, NJ |lccn =  85-28127  | edition = 2nd|  isbn = 0-8058-2682-3 | publisher = Lawrence Erlbaum Associates Publishers| date = 1997}}\n* {{cite book | vauthors = Reid V, Striano T, Koops W | title = Social Cognition During infancy | publisher = Psychology Press | date = 2007 }}\n{{refend}}\n\n", "goals": ["The student will be able to define and understand the concept of developmental psychology", "The student will be able to identify and discuss the role of evolutionary psychology in the field of developmental psychology", "The student will be able to identify and discuss the role of comparative psychology in the field of developmental psychology", "The student will be able to identify and discuss the role of developmental science in the field of developmental psychology", "The student will be able to identify and discuss the role of human development in the field of developmental psychology"]}, {"title": "External links", "content": "{{wikiversity}}\n{{Library resources box\n|by=no\n|onlinebooks=no\n|others=no\n|about=yes\n|label=developmental psychology}}\n*{{Commons category-inline}}\n*[http://www.srcd.org/ The Society for Research in Child Development]\n*[https://www.bps.org.uk/member-microsites/developmental-psychology-section The British Psychological Society, Developmental Psychology Section] {{Webarchive|url=https://web.archive.org/web/20211108072517/https://www.bps.org.uk/member-microsites/developmental-psychology-section |date=2021-11-08 }}\n*[http://www.devpsy.org/ Developmental Psychology]: lessons for teaching and learning developmental psychology\n*[https://web.archive.org/web/20031121184610/http://classweb.gmu.edu/awinsler/ordp/topic.html GMU's On-Line Resources for Developmental Psychology]: a web directory of developmental psychology organizations\n*[http://hearth.library.cornell.edu/ Home Economics Archive: Research, Tradition, History (HEARTH)]{{webarchive|url=https://web.archive.org/web/20220319070746/https://digital.library.cornell.edu/collections/hearth|date =19 March 2022}}<br />An e-book collection of over 1,000 books spanning 1850 to 1950, created by Cornell University's [https://mann.library.cornell.edu/ Mann Library]{{webarchive|url= https://web.archive.org/web/20220302151303/https://mann.library.cornell.edu/|date = 2 March 2022}}. Includes several hundred works on human development, child raising, and family studies itemized in a [https://web.archive.org/web/20031117054622/http://hearth.library.cornell.edu/h/hearth/bibs/child.pdf specific bibliography].\n*[https://journals.plos.org/plosone/browse/developmental_psychology Developmental psychology] Subject Area page at [[PLOS]]\n\n{{Human psychological development}}\n{{Psychology|state=uncollapsed}}\n{{Social sciences}}\n{{Authority control}}\n\n[[Category:Developmental psychology| ]]\n[[Category:Behavioural sciences]]", "goals": ["The student will be able to define and understand the concept of developmental psychology", "The student will be able to identify and discuss the different theoretical perspectives in developmental psychology", "The student will be able to describe and analyze the different stages of human development", "The student will be able to distinguishe and discuss the different factors that influence human development", "The student will be able to identify and discuss the different methods used to study human development"]}]}