{"title": "Evolutionary biology", "key": "Evolutionary_biology", "summary": "{{Short description|Study of the processes that produced the diversity of life}}\n{{For|the textbook|Evolutionary Biology (book)}}\n{{Use dmy dates|date=February 2024}}\n{{Use British English|date=March 2015}}\n\n{{Evolutionary biology}}\n\n[[File:Darwin's finches by Gould.jpg|thumb|right|[[Darwin's finches]]]]\n\n'''Evolutionary biology''' is the subfield of [[biology]] that studies the [[evolution]]ary processes ([[natural selection]], [[common descent]], [[speciation]]) that produced the [[diversity of life]] on Earth. It is also defined as the study of the history of life forms on Earth. Evolution holds that all species are related and gradually change over generations.<ref>{{Cite web |title=What is evolution? |url=https://www.yourgenome.org/facts/what-is-evolution |date=17 February 2017 |access-date=27 November 2021 |website=YourGenome |language=en}}</ref> In a population, the [[genetic variation]]s affect the [[phenotype]]s (physical characteristics) of an organism. These changes in the phenotypes will be an advantage to some organisms, which will then be passed on to their offspring. Some examples of evolution in species over many generations are the [[peppered moth]] and [[flightless bird]]s. In the 1930s, the discipline of evolutionary biology emerged through what [[Julian Huxley]] called the [[Modern synthesis (20th century)|modern synthesis]] of understanding, from previously unrelated fields of biological research, such as [[genetics]] and ecology, [[systematics]], and [[paleontology]].\n\nThe investigational range of current research has widened to encompass the [[genetic architecture]] of [[adaptation]], [[molecular evolution]], and the different forces that contribute to evolution, such as [[sexual selection]], [[genetic drift]], and [[biogeography]]. Moreover, the newer field of [[evolutionary developmental biology]] (\"evo-devo\") investigates how [[embryogenesis]] is controlled, thus yielding a wider synthesis that integrates [[developmental biology]] with the fields of study covered by the earlier evolutionary synthesis.\n\n", "sections": [{"title": " Phylogenetic Trees ", "content": "\n{{Main|Phylogenetic tree}}\n\n[[File:Phylogenetic tree.svg|thumb|The tree of life]]\n\nPhylogenetic Trees are representations of genetic lineage. They are figures that show how related species are to one another. They formed by analyzing the physical traits as well as the similarities of the DNA between species. Then by using a [[molecular clock]] scientists can estimate when the species diverged. An example of a phylogeny would be the tree of life.\n\n", "goals": ["The student will be able to define and explain the concept of a phylogenetic tree", "The student will be able to describe the process of how a phylogenetic tree is constructed", "The student will be able to identify the different types of phylogenetic trees and their uses", "The student will be able to explain the importance of the molecular clock in the construction of a phylogenetic tree", "The student will be able to describe the process of how a phylogenetic tree is used to estimate the time of divergence of species"]}]}