{"title": "Nursing", "key": "Nursing", "summary": "{{Short description|Health care profession}}\n{{Other uses}}\n{{Redirect2|Nurse|Nurses}}\n{{pp|small=yes}}\n<references group=\"The U.S. Nursing Workforce in 2018 and Beyond Journal of Nursing Regulation , Volume 8, Issue 4, S3 - S6\" />\n{{Use dmy dates|date=July 2021}}\n{{Infobox Occupation\n| name= Nursing\n|image = File:Nurse checks blood pressure.jpg\n| imagesize = 250px\n|caption = A nurse checks a patient's blood pressure. \n| official_names=\n| Occupation =\n| activity_sector= Nursing\n| competencies= \nCaring for general and specialized well-being of patients\n| formation=\nQualifications in terms of statutory regulations according to national, state, or provincial legislation in each country \n| employment_field= \n*[[Hospital]]\n*[[Clinic]]\n*[[Laboratory]]\n*[[Research]]\n*[[Education]]\n*[[Home care]]\n\n| related_occupation=\n*[[Medicine]]\n*[[Glossary of medicine]]\n}}\n\n'''Nursing''' is a profession within the [[health care|healthcare]] sector focused on the care of individuals, families, and communities so they may attain, maintain, or recover optimal health and [[quality of life (healthcare)|quality of life]].<ref name=\":5\">{{Cite web |title=Nursing {{!}} The SAGE Encyclopedia of Economics and Society - Credo Reference |url=https://search.credoreference.com/content/entry/sageeas/nursing/0 |access-date=2022-03-31 |website=search.credoreference.com |language=en}}</ref> Nurses can be differentiated from other [[health care providers|healthcare providers]] by their [[nursing theory|approach to patient care]], [[nurse education|training]], and [[scope of practice]]. Nurses practice in many [[List of nursing specialties|specialties]] with differing levels of [[medical prescription|prescription authority]]. Nurses comprise the largest component of most healthcare environments;<ref>{{Cite journal |doi=10.1097/01.NEP.0000000000000659|title=Who Wants to be a Nurse? Understanding Emirati Female Students' Knowledge and Attitudes About Nursing as a Career |year=2020 |last1=Maymoun |first1=Nazneen |last2=Sohail |first2=M. Sadiq |journal=Nursing Education Perspectives |volume=41 |issue=3 |pages=E14–E19 |pmid=32310910 |s2cid=216046198 }}</ref><ref>{{Cite journal |doi=10.1186/s12960-017-0223-2 |doi-access=free|title=The Human Resources for Health Effort Index: A tool to assess and inform Strategic Health Workforce Investments |year=2017 |last1=Fort |first1=Alfredo L. |last2=Deussom |first2=Rachel |last3=Burlew |first3=Randi |last4=Gilroy |first4=Kate |last5=Nelson |first5=David |journal=Human Resources for Health |volume=15 |issue=1 |page=47 |pmid=28724381 |pmc=5518138 }}</ref> but there is evidence of international shortages of qualified nurses.<ref>{{Cite journal |doi=10.1515/emj-2017-0019 |doi-access=free|title=Nurses in Poland — Immediate Action Needed |year=2017 |last1=Haczyński |first1=Józef |last2=Skrzypczak |first2=Zofia |last3=Winter |first3=Małgorzata |journal=Engineering Management in Production and Services |volume=9 |issue=2 |pages=97–104 }}</ref> Nurses collaborate with other healthcare providers such as [[physician]]s, [[nurse practitioner]]s, [[physical therapist]]s, and [[psychologist]]s. There is a distinction between nurses and nurse practitioners; in the U.S., the latter are nurses with a graduate degree in advanced practice nursing, and are permitted to prescribe medications unlike the former. They practice independently in a variety of settings in more than half of the United States. Since the [[Post-war|postwar]] period, nurse education has undergone a process of diversification towards [[Nursing credentials and certifications|advanced and specialized credentials]], and many of the traditional regulations and provider roles are changing.<ref>Coulehan J. L., Block M. R. (2005): The Medical Interview: Mastering skills for clinical practice, 5th Ed. F. A. Davis. {{ISBN|0-8036-1246-X}}. {{OCLC|232304023}}.</ref><ref>Dunphy L. M., Winland-Brown J. E. (2011): Primary care: The art and science of advanced practice nursing. F.A. Davis. {{ISBN|9780803626478}}.</ref>\n\nNurses develop a plan of care, working collaboratively with physicians, therapists, the patient, the patient's family, and other team members that focuses on treating illness to improve quality of life. In the United Kingdom and the United States, clinical nurse specialists and nurse practitioners, diagnose health problems and prescribe the correct medications and other therapies, depending on particular state regulations.<ref>{{Cite web|title=Nursing {{!}} The SAGE Encyclopedia of Economics and Society - Credo Reference|url=https://search.credoreference.com/content/entry/sageeas/nursing/0|access-date=2022-02-18|website=search.credoreference.com|language=en}}</ref> Nurses may help coordinate the patient care performed by other members of a multidisciplinary healthcare team such as therapists, medical practitioners, and dietitians. Nurses provide care both interdependently, for example, with physicians, and independently as nursing professionals. In addition to providing care and support, nurses educate the public and promote health and wellness.<ref>{{Cite web |last=Freeman |first=Veronica |title=The role of nurses in our society today |url=https://www.cerner.com/ae/en/blog/the-role-of-nurses-in-our-society-today |access-date=2023-03-31 |website=www.cerner.com |language=en}}</ref>\n{{TOC limit|3}}\n\n", "sections": [{"title": "Worldwide", "content": "===Americas===\n====United States====\n[[File:Poston, Arizona. Registered nurse, Mrs. Edythe Sasser, is assisited by Yoshiko Konatsu, nurse's aid . . . - NARA - 537104.jpg|thumb|Two nurses in Arizona, 1943]]\n{{Main article|Nursing in the United States|History of nursing in the United States}}\nIn the US, scope of practice is determined by the state or territory in which a nurse is licensed. Each state has its own laws, rules, and regulations governing nursing care. Usually the making of such rules and regulations is delegated to a state [[board of nursing]], which performs day-to-day administration of these rules, licenses for nurses and nursing assistants, and makes decisions on nursing issues. In some states, the terms \"nurse\" or \"nursing\" may only be used in conjunction with the practice of a [[registered nurse]] (RN) or [[Licensed Practical Nurse|licensed practical or vocational nurse]] (LPN/LVN).\n\nIn the hospital setting, registered nurses often delegate tasks to LPNs and [[unlicensed assistive personnel]].\n\nRNs are not limited to employment as bedside nurses. They are employed by physicians, attorneys, insurance companies, governmental agencies, community/public health agencies, private industry, school districts, ambulatory surgery centers, among others. Some registered nurses are independent consultants who [[self-employed|work for themselves]], while others work for large manufacturers or chemical companies. Research nurses conduct or assist in the conduct of research or evaluation (outcome and process) in many areas such as biology, psychology, human development, and health care systems.\n\nMany employers offer flexible work schedules, child care, educational benefits, and bonuses. About 21 percent of registered nurses are union members or covered by union contract.<ref name=\"United States Department of Labor Bureau of Labor Statistics\">United States Department of Labor Bureau of Labor Statistics</ref>\n\nNursing is the nation's largest health care profession. In 2017, there were more than 4,015,250 registered nurses and 922,196 licensed practical nurses nationwide.<ref>{{cite journal|title=The U.S. Nursing Workforce in 2018 and Beyond |journal=Journal of Nursing Regulation |volume=8 |number=4 |year=2018 |pages=S3–S6 |url=https://wyoleg.gov/InterimCommittee/2019/10-20190613EnvironmentalScan2018.pdf}}</ref> Of all licensed RNs, 2.6&nbsp;million or 84.8% are employed in nursing. Nurses comprise the largest single component of hospital staff, are the primary providers of hospital patient care, and deliver most of the nation's long-term care. The primary pathway to professional nursing, as compared to technical-level practice, is the four-year Bachelor of Science in nursing (BSN) degree. Registered nurses are prepared either through a BSN program; a three-year associate degree in nursing; or a three-year hospital training program, receiving a hospital diploma. All take the same state licensing exam. (The number of diploma programs has declined steadily—to less than 10 percent of all basic RN education programs—as nursing education has shifted from hospital-operated instruction into the college and university system.)\n\n=====Educational and licensure requirements=====\n\n======Diploma in Nursing======\n{{main article|Diploma in Nursing}}\nThe oldest method of nursing education is the hospital-based diploma program, which lasts approximately three years. Students take between 30 and 60 credit hours in [[anatomy]], [[physiology]], [[microbiology]], [[nutrition]], [[chemistry]], and other subjects at a college or university, then move on to intensive nursing classes. Until 1996, most RNs in the US were initially educated in nursing by diploma programs.<ref name=\"ANA\">American Nurses Association. [http://www.ana.org/readroom/fsdemogr2.htm#education \"Nursing Facts: Today's Registered Nurse – Numbers and Demographics\"] {{Webarchive|url=https://web.archive.org/web/20070809113102/http://www.ana.org/readroom/fsdemogr2.htm#education |date=9 August 2007 }} Washington, D.C., American Nurses Association, 2006.</ref> According to the Health Services Resources Administration's 2000 Survey of Nurses only six percent of nurses who graduated from nursing programs in the United States received their education at a Diploma School of Nursing.<ref name=\"HRSA\">Health Resources and Service Administration. \"Findings from the National Sample Survey Of Registered Nurses\" Washington, D.C., U.S. Department of Health and Human Services Health Resources and Service Administration Bureau of Health Professions Division of Nursing, 2000.</ref>\n\n======Associate Degree in Nursing======\n{{main article|Associate of Science in Nursing}}\nThe most common initial nursing education is a two-year [[Associate Degree in Nursing]] (Associate of Applied Science in Nursing, Associate of Science in nursing, Associate Degree in Nursing), a [[community college|two-year college]] degree referred to as an ADN. Some four-year colleges and universities also offer the ADN. Associate degree nursing programs have prerequisite and corequisite courses (which may include English, Math and Human Anatomy and Physiology) and ultimately stretch out the degree-acquiring process to about three years or greater.\n\n======Bachelor of Science in Nursing======\n{{main article|Bachelor of Science in Nursing}}\nAnother pathway into the profession, or a higher level of education for other nurses, is obtaining a [[Bachelor of Science in Nursing]] (BSN), a four-year degree that also prepares nurses for graduate-level education. For the first two years in a BSN program, students usually obtain general education requirements and spend the remaining time in nursing courses. In some new programs the first two years can be substituted for an active LPN license along with the required general studies. Advocates for the ADN and diploma programs state that such programs have an on the job training approach to educating students, while the BSN is an [[academic degree]] that emphasizes research and [[nursing theory]]. Some states require a specific amount of clinical experience that is the same for both BSN and ADN students. A BSN degree qualifies its holder for administrative, research, consulting and teaching positions that would not usually be available to those with an ADN, but is not necessary for most patient care functions. Nursing schools may be accredited by either the [[Accreditation Commission for Education in Nursing]] (ACEN) or the [[Commission on Collegiate Nursing Education]] (CCNE).\n\n======Graduate education======\n{{Further|Master of Science in Nursing|Doctor of Nursing Practice}}\n\nAdvanced education in nursing is done at the master's and doctoral levels. It prepares the graduate for specialization as an [[advanced practice registered nurse]] (APRN) or for advanced roles in leadership, management, or education. The [[clinical nurse leader]] (CNL) is an advanced generalist who focuses on the improvement of quality and safety outcomes for patients or patient populations from an administrative and staff management focus. Doctoral programs in nursing prepare the student for work in nursing education, health care administration, clinical research, public policy, or advanced clinical practice. Most programs confer the PhD in nursing or [[Doctor of Nursing Practice]] (DNP).\n\n[[Advanced practice registered nurse]] (APRN)\n\nAreas of advanced nursing practice include that of a [[nurse practitioner]] (NP), a certified [[nurse midwife]] (CNM), a [[nurse anesthetist|certified registered nurse anesthetist]] (CRNA), or a [[clinical nurse specialist]] (CNS). Nurse practitioners and CNSs work assessing, diagnosing and treating patients in fields as diverse as [[family practice]], women's health care, [[emergency nursing]], acute/critical care, [[psychiatry]], [[geriatrics]], or [[pediatrics]], additionally, a CNS usually works for a facility to improve patient care, do research, or as a staff educator.\n\n=====Licensure examination=====\n\nCompletion of any one of these three educational routes allows a graduate nurse to take the [[NCLEX-RN]], the test for [[nurse licensure|licensure]] as a registered nurse, and is accepted by every state as an adequate indicator of minimum competency for a new graduate. However, controversy exists over the appropriate entry-level preparation of RNs. Some professional organizations believe the BSN should be the sole method of RN preparation and ADN graduates should be licensed as \"technical nurses\" to work under the supervision of BSN graduates. Others feel the on-the-job experiences of diploma and ADN graduates makes up for any deficiency in theoretical preparation.{{Citation needed|date=December 2022}}\n\n=====Shortage in the United States=====\n{{Main article|Nursing shortage}}\nRNs are the largest group of health care workers in the United States, with about 2.7&nbsp;million employed in 2011.<ref name=\"bls.gov\">[http://www.bls.gov/oes/current/oes291111.htm Bureau of Labor Statistics – Registered Nurses] {{webarchive |url=https://web.archive.org/web/20120811044058/http://www.bls.gov/oes/current/oes291111.htm |date=11 August 2012 }}</ref> It has been reported{{By whom|date=July 2012}} that the number of new graduates and foreign-trained nurses is insufficient to meet the [[demand]] for registered nurses; this is often referred to as the [[nursing shortage]] and is expected{{By whom|date=July 2012}} to increase for the foreseeable future. There are data to support the idea that the nursing shortage is a voluntary shortage.<ref>{{cite book | vauthors = Haddad LM, Annamaraju P, Toney-Butler TJ | title = Nursing Shortage\n | publisher = Stat Pearls | date=January 2020 | url = https://www.ncbi.nlm.nih.gov/books/NBK493175/ | access-date = 10 May 2020 | pmid = 29630227}}</ref> {{Citation needed|date=July 2012}} In other words, nurses are leaving nursing of their own volition. In 2006 it was estimated that approximately 1.8&nbsp;million nurses chose not to work as a nurse. The Bureau of Labor Statistics (BLS) reported that 296,900 healthcare jobs were created in 2011. RNs make up the majority of the healthcare work force, therefore these positions will be filled primarily by nurses. The BLS also stated that by 2020, there would be 1.2&nbsp;million nursing job openings due to an increase in the workforce, and replacements.<ref>Rosseter, 2012.</ref>\n\n======Causes======\n{{Speculation|section|date=July 2012}}\nThe International Council of Nursing (ICN), the largest international health professional organization in the world, recognizes the shortage of nurses as a growing crisis in the world. This shortage impacts the healthcare of everyone worldwide. One of the many reasons is that nurses who pursue to become nurses do so very late in their lives. This leads to a non-lengthy employment time. A national survey prepared by the Federation of Nurses and Health Professionals in 2001 found that one in five nurses plans to leave the profession within five years because of unsatisfactory working conditions, including low pay, severe under staffing, high stress, physical demands, mandatory overtime, and irregular hours. Approximately 29.8 percent of all nursing jobs are found in hospitals.<ref name=\"bls.gov\"/> However, due to administrative cost cutting, increased nurse's workload, and rapid growth of outpatient services, hospital nursing jobs will experience slower than average growth. Employment in home care and nursing homes is expected{{By whom|date=July 2012}} to grow rapidly. Though more people are living well into their 80s and 90s, many need the kind of long-term care available at a nursing home. Many nurses will also be needed to help staff the growing number of out-patient facilities, such as HMOs (Health Maintenance Organizations), group medical practices, and ambulatory surgery centers. Nursing specialties will be in great demand. There are, in addition, many part-time employment possibilities.<ref name=\"isbn0-8160-6587-X\">{{cite book |title=Nursing (Ferguson's Careers in Focus) |publisher=Ferguson |location=New York, N.Y. |year=2006 |page=[https://archive.org/details/careersinfocusnu0000unse_l8r2/page/188 188] |isbn=978-0-8160-6587-5 |url=https://archive.org/details/careersinfocusnu0000unse_l8r2/page/188 }}</ref><ref name=\"Nardi, Deena A. 2013\">Nardi, Deena A., and Charlene C. Gyurko. \"The Global Nursing Faculty Shortage: Status and Solutions for Change.\" (2013): 1–11. Web. 28 January 2015.</ref>\n\nLevsey, Campbell, and Green voiced their concern about the shortage of nurses, citing Fang, Wilsey-Wisniewski, & Bednash, 2006, who state that over 40,000 qualified nursing applicants were turned away in the 2005–2006 academic year from baccalaureate nursing programs due to a lack of masters and doctoral qualified faculty, and that this number was increased over 9,000 from 32,000 qualified but rejected students from just two years earlier. Several strategies have been offered to mitigate this shortage including; Federal and private support for experienced nurses to enhance their education, incorporating more hybrid/blended nursing courses, and using simulation in lieu of clinical (hospital) training experiences.<ref name=\"Nardi, Deena A. 2013\"/><ref>{{cite journal | last1=Fang | first1=D. | last2=Wilsey-Wisniewski | first2=S.J. | last3=Bednash | first3=G.D. | year = 2006 | title = 2005–2006 enrollment and graduations in baccalaureate and graduate programs in nursing. Washington, DC: American Association of Colleges of Nursing. Levsey, K.R., Campbell, D., & Green, A. (2007). Yesterday, Today, and Tomorrow; Challenges in Securing Federal Support for Graduate Nurses | journal = Journal of Nursing Education | volume = 46 | issue = 4| pages = 176–183 }}</ref>\n\nFurthermore, there is a shortage of academically qualified instructors to teach at schools of nursing worldwide. The serious need for educational capacity is not being met, which is the underlying most important preparation resource for the nurses of tomorrow. The decrease in faculty everywhere is due to many factors including decrease in satisfaction with the workforce, poor salaries, and reduction in full-time equivalent. Throughout the span of 6 years the nursing faculty shortage has been written about an increasing amount. There is no clear consensus or an organized plan on how to fix the ongoing issue.<ref>Nardi, Deena A., and Charlene C. Gyurko. \"The Global Nursing Faculty Shortage: Status and Solutions for Change.\" (2013): 1–11. Web. 28 January 2015</ref>\n\n=====Continuing education=====\nWith health care knowledge growing steadily, nurses can stay ahead of the curve through continuing education. Continuing education classes and programs enable nurses to provide the best possible care to patients, advance nursing careers, and keep up with Board of Nursing requirements. The American Nurses Association and the American Nursing Credentialing Center are devoted to ensuring nurses have access to quality continuing education offerings. Continuing education classes are calibrated to provide enhanced learning for all levels of nurses. Many States also regulate Continuing Nursing Education. Nursing licensing boards requiring Continuing Nursing Education (CNE) as a condition for licensure, either initial or renewal, accept courses provided by organizations that are accredited by other state licensing boards, by the American Nursing Credentialing Center (ANCC), or by organizations that have been designated as an approver of continuing nursing education by ANCC.<ref>{{cite web|url=http://www.nursecredentialing.org/AccredContactHoursFAQ|title=FAQs: Contact Hours (CNE Credit)|access-date=10 February 2015|archive-url=https://web.archive.org/web/20150211024758/http://www.nursecredentialing.org/AccredContactHoursFAQ|archive-date=11 February 2015}}</ref> There are some exceptions to this rule including the state of California, Florida and Kentucky. National Healthcare Institute<ref name=\"nhinstitute\">{{cite web|url=http://www.nhinstitute.com|title=Continuing Education for Nurses and Medics|website=NHI|access-date=10 December 2017}}</ref> has created a list to assist nurses in determining their CNE credit hours requirements. While this list is not all inclusive, it offers details on how to contact nursing licensing boards directly.<ref name=\"http://www.nursingworld.org/\">{{cite web|url=http://www.nursingworld.org/ |title=American Nurses Association |publisher=Nursingworld.org |access-date=21 August 2011}}</ref><ref name=\"http://www.NHInstitute.org/\">{{cite web|url=http://www.nhinstitute.com/item/education-requirements-by-board-of-nursing.html|title=National Healthcare Institute Continuing Education Requirements by Board of Nursing |publisher=NHInstitute.com |access-date=14 February 2012}}</ref>\n\n=====Board certification=====\n{{main article|Nursing credentials and certifications}}\n\nProfessional nursing organizations, through their certification boards, have voluntary certification exams to demonstrate clinical competency in their particular specialty. Completion of the prerequisite work experience allows an RN to register for an examination, and passage gives an RN permission to use a professional designation after their name. For example, passage of the American Association of Critical-care Nurses specialty exam allows a nurse to use the initials 'CCRN' after his or her name. Other organizations and societies have similar procedures.\n\nThe [[American Nurses Credentialing Center]], the credentialing arm of the [[American Nurses Association]], is the largest nursing credentialing organization and administers more than 30 specialty examinations.<ref name=\"ANCC\">American Nurses Credentialing Center. [http://www.ana.org/ancc/cert/index.html \"ANCC Certification\"] {{Webarchive|url=https://web.archive.org/web/20070607205339/http://www.ana.org/ancc/cert/index.html |date=7 June 2007 }} Washington, D.C., American Nurses Association, '''2006'''.</ref>\n\n=====Correctional nursing=====\n{{main article|Correctional nursing}}\n\nDue to its large [[Incarceration in the United States|prison population]], the United States needs many [[Correctional nursing|correctional nurses]] to help inmates receive proper health-care, including [[Mentally ill people in United States jails and prisons|mental health treatments for prisoners with psychological issues.]] The demand for nurse is high everywhere. Nurses working in correctional care have to focus on the care of the patient, not what they did. They are to provide the best possible care because is a compassionate field and all nurses want is to better the patient.\n\nNurses are not the only health care workers in correctional facilities. Some examples of people who work in correctional facilities are LPNS, RNs, nurse practitioners, doctors, pharmacists, therapists, and specialists.<ref name=\":52\">{{Cite web |date=2019-08-12 |title=What to Expect as a Correctional Care Nurse and How to Avoid Burnout in Challenging Settings |url=https://nursing.usc.edu/blog/correctional-nurse-career/ |access-date=2022-03-10 |website=USC-MSN |language=en-US}}</ref>\n\n====== Role of correctional nurse ======\nWhen the individual arrives, nurses perform an initial exam that is just a basic checkup to determine what needs the patient may have while in prison. Here they can discover existing conditions or even signs of substance abuse. A correctional nurse can face a wide variety of healthcare issues including chronic medical conditions, mental health, infectious disease, and much more. Correctional nurses must follow stricter protocols than in a hospital due to confidentiality. Assessing a patient can be difficult. A deputy or officer may have to be present during exams, which can make the patient feel restricted, and be less open with their medical information. Without the nurse knowing some information from the patient, prevent them from receiving the best care possible.<ref name=\":52\" />\n\n====Canada====\n{{Main article|Nursing in Canada}}\n\n=====History=====\nCanadian nursing dates back to 1639 in [[Quebec]] with the Augustine nuns.<ref name=\"test2\">[http://www.cna-nurses.ca/CNA/nursing/certification/specialties/default_e.aspx Link text] {{webarchive|url=https://web.archive.org/web/20111229233442/http://www.cna-nurses.ca/cna/nursing/certification/specialties/default_e.aspx|date=29 December 2011}}.</ref> These nuns were trying to open a mission that cared for the spiritual and physical needs of patients. The establishment of this mission created the first nursing apprenticeship training in North America.<ref name=\"test2\" /> In the nineteenth century, some Catholic orders of nursing were trying to spread their message across Canada. Most nurses were female and only had an occasional consultation with a physician. Towards the end of the nineteenth century, hospital care and medical services had been improved and expanded. Much of this was due to Nightingale's influence. In 1874 the first formal nursing training program was started at the General and Marine Hospital in St. Catharines in Ontario.<ref name=\"test2\" />\n\n====Education====\nAll Canadian nurses and prospective nurses are heavily encouraged by the [[Canadian Nurses Association]] to continue their education to receive a [[bachelor's degree]]. This degree may result in better patient outcomes.{{citation needed|date=March 2019}} All Canadian provinces and territories, with the exception of the [[Yukon]] and [[Quebec]], require that all nurses have a bachelor's degree.<ref name=\"test2\" /> The length of time generally required to obtain this degree is four years. However, some Canadian universities offer a condensed program that is two years in length.<ref name=\"test2\" />\n\nNursing specialty certification is available through the [[Canadian Nurses Association]] in 22 practice areas,<ref name=\"test2\" /> including:\n\n* cardiovascular nursing\n* community health nursing\n* [[critical care nursing]]\n* pediatric critical care nursing\n* [[emergency nursing]]\n* gastroenterology nursing\n* [[gerontological nursing]]\n* hospice palliative care nursing\n* [[medical-surgical nursing]]\n* [[neonatal nursing]]\n* nephrology nursing\n* [[neuroscience nursing]]\n* [[occupational health nursing]]\n* [[oncology nursing]]\n* [[orthopedic nursing]]\n* [[pediatric nursing]]\n* peri-anesthesia nursing\n* [[obstetrical nursing]]\n* peri-operative nursing\n* [[psychiatric and mental health nursing]]\n* rehabilitation nursing\n* [[Wound, ostomy, and continence nursing]]\n\nNursing specialty certification generally requires practice, experience, and passing a test that is based on competencies for that specific medical or surgical domain in which nursing care is provided. The certification in gerontological nursing, which involves providing care to the elderly, is offered to not only RNs and NPs but also LPNs.\n\n====Latin America====\nLatin American nursing is based on three levels of training: (a) professional/registered, (b) technical, and (c) auxiliary.<ref>{{cite book|title=Siantz, de Leon, M.L., Malvárez, S., (31 May 2008) \"Migration of Nurses: A Latin American Perspective\" OJIN: The Online Journal of Issues in Nursing; Vol. 13 No. 2 Manuscript 2.}}</ref> The nursing education in Latin America and the Caribbean includes the principles and values of the Universal Health and primary health care. These principles underpin transformative education modalities such as critical and complex thinking development, problem-solving, evidence-based clinical decision-making, and lifelong learning.<ref>{{citation|doi=10.1590/1518-8345.2232.2913|title=The situation of nursing education in Latin America and the Caribbean towards universal health|year=2017|last1=Cassiani|first1=Silvia Helena De Bortoli|last2=Wilson|first2=Lynda Law|last3=Mikael|first3=Sabrina de Souza Elias|last4=Peña|first4=Laura Morán|last5=Grajales|first5=Rosa Amarilis Zarate|last6=McCreary|first6=Linda L.|last7=Theus|first7=Lisa|last8=Agudelo|first8=Maria del Carmen Gutierrez|last9=Felix|first9=Adriana da Silva|last10=Uriza|first10=Jacqueline Molina de|last11=Gutierrez|first11=Nathaly Rozo|journal=Revista Latino-Americana de Enfermagem|volume=25|pages=e2913|pmid=28513769|pmc=5466053}}</ref> The Pan American Health Organization/World Health Organization (PAHO/WHO) proposes the Strategy for Universal Access to Health and Universal Health Coverage to improve health outcomes and other basic objectives of health systems based on the right of each person to receive the best standard of health, without exposing people to financial difficulties through nursing intervention.<ref>Pan American Health Organization. Strategy for universal access to health and universal health coverage. Washington, D.C.: OPS; 2014. http://www.paho.org/uhexchange/index.php/en/uhexchange-documents/technical-information/26-strategy-for-universal-access-to-health-and-universal-health-coverage/file</ref>\n\n=== Europe ===\n\n====Spain====\nSee [[Nursing in Spain]]\n\n====United Kingdom====\n{{Main article|Nursing in the United Kingdom}}\nTo practice lawfully as a registered nurse in the United Kingdom, the practitioner must hold a current and valid registration with the [[Nursing and Midwifery Council]]. The title \"Registered Nurse\" can only be granted to those holding such registration. This protected title is laid down in the Nurses, Midwives and Health Visitors Act, 1997.<ref name=\"ACT2\">United Kingdom Government [http://www.opsi.gov.uk/ACTS/acts1997/1997024.htm Nurses, Midwives and Health Visitors Act, 1997.] London: HMSO, 1997.</ref> From April 2016, nurses in the United Kingdom are expected to revalidate every three years which involves providing evidence of further development and active practice.<ref>{{cite news|last=Jackson|first=Linda|date=24 February 2016|title=How revalidation will work for nurses and midwives|work=The Guardian|url=https://www.theguardian.com/healthcare-network/2016/feb/24/revalidation-nurses-midwives-how-it-works|access-date=8 October 2016}}</ref><ref>{{Cite news|date=16 October 2015|title=NMC Revalidation to begin in April 2016|language=en-GB|work=NursingNotes|url=https://nursingnotes.co.uk/news/professional/nmc-revalidation-to-begin-in-april-2016/|access-date=1 June 2017}}</ref>\n\n=====First and second level=====\nFirst-level nurses make up the bulk of the registered nurses in the UK. They were previously known by titles such as Registered General Nurse (RGN), Registered Sick Children's Nurse (RSCN), Registered Mental Nurse (RMN), and Registered Nurse (for the) Mentally Handicapped (RNMH). The titles used now are similar, including Registered Nurse Adult (RNA), Registered Nurse Child (RNC), Registered Nurse Mental Health (RNMH), and Registered Nurse (of) Learning Disabilities (RNLD). Second-level nurse training is no longer provided; however, they are still legally able to practice in the United Kingdom as a registered nurse. Many have now either retired or undertaken conversion courses to become first-level nurses. They are entitled to refer to themselves as registered nurses as their registration is on the Nursing & Midwifery Council register of nurses, although most refer to themselves as Enrolled Nurses (ENs) or State Enrolled Nurses (SENs).\n\n=====Advanced practice=====\n\n* ''Nurse practitioners'' – Most of these nurses obtain a minimum of a master's degree and a desired post grad certificate. They often perform roles similar to those of physicians and physician assistants. They can prescribe medications as independent or supplementary prescribers, although they are still legally regulated, unlike physician's assistants. Most Nurse Practitioners (NPs) have referral and admission rights to hospital specialties. They commonly work in [[primary care]] (e.g. General Practitioner (GP) surgeries), [[Emergency department|Accident and Emergency (A&E) departments]], or pediatrics although they are increasingly being seen in other areas of practice. In the UK, the title \"nurse practitioner\" is legally protected.\n* ''Specialist community public health nurses'' – traditionally [[district nurse]]s and [[health visitor]]s, this group oversees research and publication activities.\n* ''Lecturer-practitioners (also called practice education facilitators)'' – these nurses work both in the National Health Service (NHS), and in universities. They typically work 2–3 days per week in each setting. In university, they train pre-registration student nurses (see below), and often teach on specialist courses post-registration nurses.\n* ''Lecturers'' – these nurses are not employed by the NHS. Instead they work full-time in universities, both teaching and performing research.\n\n=====Managers=====\nMany nurses who have worked in clinical settings for a long time choose to leave clinical nursing and join the ranks of the NHS management. This used to be seen as a natural career progression for those who had reached ward management positions, however with the advent of specialist nursing roles (see above), this has become a less attractive option.\n\nNonetheless, many nurses fill positions in the senior management structure of NHS organizations, some even as board members. Others choose to stay a little closer to their clinical roots by becoming clinical nurse managers or ''[[Matron|modern matrons]]''.\n\n=====Nurse education=====\n======Pre-registration======\nTo become a registered nurse, one must complete a program recognised by the [[Nursing and Midwifery Council]] (NMC). Currently, this involves completing a [[Academic degree|degree]], available from a range of [[:Category:Nursing schools in the United Kingdom|universities offering these courses]], in the chosen branch specialty (see below), leading to both an academic award and professional registration as a 1st level registered nurse. Such a course is a 50/50 split of learning in university (i.e. through lectures, assignments and examinations) and in practice (i.e. supervised patient care within a hospital or community setting).\n\nThese courses are three (occasionally four) years' long. The first year is known as the common foundation program (CFP), and teaches the basic knowledge and skills required of all nurses. Skills included in the CFP may include communication, taking observations, administering medication and providing personal care to patients. The remainder of the program consists of training specific to the student's chosen branch of nursing. These are:\n\n* Child nursing\n* Mental health nursing\n* Learning disabilities nursing\n\n{{As of|2013}}, the Nursing and Midwifery Council will require all new nurses qualifying in the UK to hold a degree qualification.<ref name=\"http://www.nmc-uk.org/Get-involved/Consultations/Past-consultations/By-year/Pre-registration-nursing-education-Phase-2/Changes-to-pre-registration-nursing-programmes-FAQs-/2\">{{cite web|title=Changes to pre-registration nursing programmes: FAQs &#124; Nursing and Midwifery Council|url=http://www.nmc-uk.org/Get-involved/Consultations/Past-consultations/By-year/Pre-registration-nursing-education-Phase-2/Changes-to-pre-registration-nursing-programmes-FAQs-/|date=20 April 2010|publisher=Nmc-uk.org|archive-url=https://web.archive.org/web/20110727073118/http://www.nmc-uk.org/Get-involved/Consultations/Past-consultations/By-year/Pre-registration-nursing-education-Phase-2/Changes-to-pre-registration-nursing-programmes-FAQs-/|archive-date=27 July 2011|access-date=21 August 2011}}</ref> However, those nurses who hold a diploma, or even a certificate in nursing are still able to legally practice in the UK, although they are able to undertake university modules to obtain enough credits to top up to a degree.\n\n[[Midwifery]] training is similar in length and structure, but is sufficiently different that it is not considered a branch of nursing. There are shortened (18-month) programs to allow nurses already qualified in the adult branch to hold dual registration as a nurse and a midwife. Shortened courses lasting 2 years also exist for graduates of other disciplines to train as nurses. This is achieved by more intense study and a shortening of the common foundation program.<ref name=\"NMC2\">Nursing and Midwifery Council [http://www.nmc.org.uk Pre-registration training.] London: NMC, 2003.</ref>\n\n{{As of|2016}} student nurses in England and Wales can apply for a [[bursary]] from the government to support them during their nurse training, and may also be eligible for a student loan, although there has been speculation that this will not be available in the future.<ref name=\"nursingtimes2\">{{cite web|title=Student bursary system 'unsustainable', claims minister in response to editors|url=https://www.nursingtimes.net/news/education/bursary-system-unsustainable-claims-minister-03-10-2016/|website=Nursing Times|date=3 October 2016|access-date=10 December 2017}}</ref> Student nurses in Scotland still receive a standard bursary which is not means tested, and their tuition fees continue to be paid – however, they are not eligible for student loans.\n\nBefore Project 2000, nurse education was the responsibility of hospitals and was not based in universities; hence many nurses who qualified prior to these reforms do not hold an academic award.\n\n======Post-registration======\nAfter the point of initial registration, there is an expectation that all qualified nurses will continue to update their skills and knowledge. The Nursing and Midwifery Council insists on a minimum of 35 hours of education every three years, as part of its post registration education and practice (PREP) requirements.<ref name=\"http://www.nmc-uk.org/Nurses-and-midwives/Advice-by-topic/A/Advice/Post-Registration-Education-and-Practice-Prep-requirements-for-midwives/2\">{{cite web|title=Post Registration Education and Practice (Prep) requirements for midwives &#124; Nursing and Midwifery Council|url=http://www.nmc-uk.org/Nurses-and-midwives/Advice-by-topic/A/Advice/Post-Registration-Education-and-Practice-Prep-requirements-for-midwives/|publisher=Nmc-uk.org|archive-url=https://web.archive.org/web/20101126092059/http://www.nmc-uk.org/Nurses-and-midwives/Advice-by-topic/A/Advice/Post-Registration-Education-and-Practice-Prep-requirements-for-midwives/|archive-date=26 November 2010|access-date=21 August 2011}}</ref>\n\nThere are also opportunities for many nurses to gain additional clinical skills after qualification. [[Cannulation]], [[venipuncture]], [[Intravenous therapy|intravenous drug therapy]] and [[Urinary catheterization|male catheterization]] are the most common, although there are many others (such as [[advanced life support]]), which some nurses undertake.\n\nMany nurses who qualified with a diploma choose to upgrade their qualification to a degree by studying part-time. Many nurses prefer this option to gaining a degree initially, as there is often an opportunity to study in a specialist field as a part of this upgrading. Financially, in England, it was also much more lucrative, as diploma students get the full bursary during their initial training, and employers often pay for the degree course as well as the nurse's salary.<ref name=\"Nursing and Midwifery Education, 20072\">Nursing and Midwifery Education, 2007</ref>\n\nTo become specialist nurses (such as nurse consultants, nurse practitioners etc.) or nurse educators, some nurses undertake further training above bachelor's degree level. Master's degrees exist in various healthcare related topics, and some nurses choose to study for PhDs or other higher academic awards. [[District nurse]]s and [[health visitor]]s are also considered specialist nurses, and to become such they must undertake specialist training. This is a one-year full-time degree.\n\nAll newly qualifying [[district nurse]]s and [[health visitor]]s are trained to prescribe from the Nurse Prescribers' Formulary, a list of medications and dressings typically useful to those carrying out these roles. Many of these (and other) nurses will also undertake training in independent and supplementary prescribing, which allows them (as of 1 May 2006) to prescribe almost any drug in the [[British National Formulary]]. This has been the cause of a great deal of debate in both medical and nursing circles.<ref name=\"BFN2\">{{cite web|title=BNF Publications|url=http://bnf.org/bnf/index.htm|author=BNF Publications}}</ref>\n\n====European Union====\nIn the European Union, the profession of nurse is regulated. A profession is said to be regulated when access and exercise is subject to the possession of a specific professional qualification. The regulated professions database contains a list of regulated professions for nurse<ref name=\"europa2\">{{cite web|title=Regulated professions database – European Commission|url=http://ec.europa.eu/internal_market/qualifications/regprof/index.cfm?action=profession&id_profession=12402&tab=countries|publisher=European Commission|access-date=10 December 2017}}</ref> in the European Union (EU) member states, European Economic Area (EEA) countries, and Switzerland. This list is covered by the Directive 2005/36/EC.\n\n=== Asia ===\n\n====India====\nNursing education is governed in [[India]] by the central body [[Indian Nursing Council]] and its norms are implemented through respective State Nursing councils. The list of state nursing councils are available in the official web page of Indian Nursing Council. First formal education in nursing was offered in Madras Medical college, in Madras presidency. \nIndian Nursing Council Act, 1947. Act Year Number: Act No. 19 of December enactment Date of enactment: [31 December 19act] Act Objective: An Act to constitute the Nursing Council of India. To establish uniform standards of training for nurses, midwives, and health visitors. It is implemented with 17 sections and each section indicates the specific legislative role of the council.\n\nThe nursing profession was dominated by females in the British colonial period, but in Madras Presidency, men were actively engaged in the profession.<ref>Jayapal SK, Arulappan J. Historical Trajectory of Men in Nursing in India. SAGE Open Nurs. 2020 May 13; 6:1-10. doi: 10.1177/2377960820920128. PMID 33415276; PMCID: PMC7774447</ref>\n\n====Iran====\n{{main|Nursing in Iran}}\n\n====Israel====\nNurses in [[Israel]] have a wide variety of responsibilities, including hospital care, patient education, wound care, prenatal and other monitoring, midwifery, and well-baby clinics.\n\nNursing in Israeli Jewish culture traces its origins to [[Shiphrah and Puah|Shifra and Puah]], two [[Hebrews|Hebrew]] midwives depicted in the [[Book of Exodus]] helping women in ancient Egypt give birth and keep their infants safe.\n\nModern-day nursing was established by nurses sent to [[Mandatory Palestine]] and later Israel by the [[Hadassah Women's Zionist Organization of America|Hadassah]] organization, as well as a nursing school founded by [[Henrietta Szold]] in 1918.  During those times, the United Kingdom regulated midwifery in Mandatory Palestine, but the nurses were not mentioned in the regulation decree.\n\nToday, nurses and midwives are regulated by the [[Israeli Ministry of Health]].\n\n====Japan====\n{{main article|Nursing in Japan}}\n\n=====History=====\nNursing was not an established part of Japan's healthcare system until 1899 with the Midwives Ordinance.<ref name=\"nurse3\">{{cite web|title=Nursing in Japan – Overview of Japanese Nursing System|url=http://www.nurse.or.jp/jna/english/nursing/system.html|website=nurse.or.jp|access-date=25 February 2018|archive-date=11 March 2018|archive-url=https://web.archive.org/web/20180311091329/http://www.nurse.or.jp/jna/english/nursing/system.html|url-status=dead}}</ref> From there the Registered Nurse Ordinance came into play in 1915. This established a legal substantiation to registered nurses all over Japan. A new law geared towards nurses was created during [[World War II]]: the ''Public Health Nurse, Midwife and Nurse Law'', established in 1948.<ref name=\"test2\" /> It established educational requirements, standards and licensure. There has been a continued effort to improve nursing in Japan. In 1992 the Nursing Human Resource Law was passed.<ref name=\"test2\" /> This law created the development of new university programs for nurses. Those programs were designed to raise the education level of the nurses so that they could be better suited for taking care of the public.\n\n=====Types of nurses=====\nJapan only recognizes four types of nursing and they are [[Public Health Nursing]], [[Midwifery]], Registered Nursing and Assistant Nursing.\n\n======Public health======\nThis type of nursing is designed to help the public and is also driven by the public's needs. The goals of public health nurses are to monitor the spread of disease, keep vigilant watch for environmental hazards, educate the community on how to care for and treat themselves, and train for community disasters.\n\n======Midwifery======\nNurses that are involved with midwifery are independent of any organization. A [[midwife]] takes care of a pregnant woman during labour and postpartum. They assist with things like breastfeeding and caring for the child.\n\n======Nursing assistant======\nNursing assistants, also known as nurse assistants or CNAs (Certified Nursing Assistants), assist patients with basic daily tasks. Individuals who are assistant nurses follow orders from a registered nurse. They report back to the licensed nurse about a patient's condition. Assistant nurses are always supervised by a licensed registered nurse.\n\n=====Education=====\nIn 1952 Japan established the first nursing university in the country.<ref name=\"test2\" /> An [[Associate of Science in Nursing|associate degree]] was the only level of certification for years. Soon people began to want nursing degrees at a higher level of education. Soon the [[Bachelor of Science in Nursing|Bachelor's Degree in Nursing]] (BSN) was established. Currently, Japan offers [[Doctorate in Nursing|doctorate]]-level degrees of nursing in a good number of its universities.\n\nThere are three ways that an individual could become a registered nurse in Japan. After obtaining a high school degree the person could go to a nursing university for four years and earn a bachelor's degree, go to a junior nursing college for three years or go to a nursing school for three years.<ref name=\"test2\" /> Regardless of where the individual attends school they must take the national exam. Those who attended a nursing university have a bit of an advantage over those who went to a nursing school. They can take the national exam to be a registered nurse, public health nurse or midwife. In the cases of becoming a midwife or a public health nurse, the student must take a one-year course in their desired field after attending a nursing university and passing the national exam to become a registered nurse. The nursing universities are the best route for someone who wants to become a nurse in Japan.<ref name=\"test2\" /> They offer a wider range of general education classes and they also allow for a more rigid teaching style of nursing. These nursing universities train their students to be able to make critical and educated decisions when they are out in the field. Physicians are the ones who are teaching the potential nurses because there are not enough available nurses to teach students. This increases the dominance that physicians have over nurses.\n\nStudents that attend a nursing college or just a nursing school receive the same degree as one who graduated from a nursing university would, but they do not have the same educational background. The classes offered at nursing colleges and nursing schools are focused on more practical aspects of nursing. These institutions do not offer many general education classes, so students who attend these schools will solely be focusing on their nursing educations while they are in school. Students who attend a nursing college or school do have the opportunity to become a [[midwife]] or a public health nurse. They have to go through a training institute for their desired field after graduating from the nursing school or college.<ref name=\"test2\" /> Japanese nurses never have to renew their licenses. Once they have passed their exam, they have their license for life.<ref name=\"test2\" />\n\n=====Today=====\nLike the United States, Japan is in need of more nurses. The driving force behind this need is the fact that country is aging and needs more medical care for its people. However, the number of available nurses does not seem to be increasing. Nurses face poor working conditions and low social status, and there is a cultural idea that married women quit their jobs for family responsibilities.<ref name=\"nurse22\">{{cite web|title=Nursing in Japan – Working conditions in Japan|url=http://www.nurse.or.jp/jna/english/nursing/employment.html|website=nurse.or.jp|access-date=25 February 2018|archive-date=25 February 2021|archive-url=https://web.archive.org/web/20210225151221/https://www.nurse.or.jp/jna/english/nursing/employment.html|url-status=dead}}</ref> On average, Japanese nurses make around 280,000 yen a month, and it is one of the higher paying jobs. However, physicians make twice as much as nurses.<ref name=\"worldsalaries2\">{{cite web|title=Professional Nurse Salaries – International Comparison|url=http://www.worldsalaries.org/professionalnurse.shtml|website=worldsalaries.org|access-date=25 February 2018}}</ref> Similar to other cultures, the Japanese people view nurses as subservient to physicians. According to the [[American Nurses Association]] article on Japan, \"nursing work has been described using negative terminology such as 'hard, dirty, dangerous, low salary, few holidays, minimal chance of marriage and family, and poor image.'\"\n\nThere are organizations that unite Japanese nurses like the [[Japanese Nursing Association]] (JNA); the JNA is a professional organization and not a union. Members of the JNA lobby politicians and produces publications about nursing. According to the American Nurses Association's article on Japan, the JNA \"works toward the improvement in nursing practice through many activities including the development of a policy research group to influence policy development, a code of ethics for nurses, and standards of nursing practice.\" The JNA also provides certification for specialists in mental health, oncology and community health.<ref name=\"test2\" /> There are other organizations, including some that categorize nurses by specialty, like emergency nursing or disaster nursing. One of the older unions that relates to nursing is the Japanese Federation of Medical Workers Union, which was created in 1957.<ref name=\"test2\" /> It is a union that includes physicians as well as nurses. This organization was involved with the '''Nursing Human Resource Law'''.<ref name=\"test2\" />\n\n====Philippines====\n{{main article|Nursing in the Philippines}}\nPhilippines is well known for migrant nurses working in other countries especially in the west like the United States of America. It accounts a quarter of overseas nurses in the world. Every year, around 20,000 nurses leave the Philippines to work in more developed countries looking for better pay.<ref>{{cite news |title=The Worlds Largest Supplier of Nurses: The Philippines |work=Hawk Herald |url=https://www.hawkherald.com/2021/11/the-worlds-largest-supplier-of-nurses-the-philippines/|access-date=6 December 2022|archive-date=20 November 2021|archive-url=https://web.archive.org/web/20211120041136/https://www.hawkherald.com/2021/11/the-worlds-largest-supplier-of-nurses-the-philippines/|url-status=live}}</ref> Nurses in the Philippines must be licensed by the [[Professional Regulatory Commission]].\n\n====Taiwan====\n{{main article|Nursing in Taiwan}}\nIn [[Taiwan]], the [[Ministry of Health and Welfare (Taiwan)|Ministry of Health and Welfare]] is in charge of the regulation of nursing.<ref>{{cite web|title=Ministry of Health and Welfare|url=http://www.mohw.gov.tw/EN/Ministry/Index.aspx|access-date=6 May 2016|archive-date=28 April 2017|archive-url=https://web.archive.org/web/20170428230510/http://www.mohw.gov.tw/EN/Ministry/Index.aspx}}</ref> The Taiwan Union of Nurses Association (TUNA) is the union unit in Taiwan, fighting for nurses on payment and working time issues.<ref>{{cite web|title=中華民國護理師護士公會全國聯合會|url=http://www.nurse.org.tw/English/Default.aspx}}</ref>\n\n===Australia===\n{{main article|Nursing in Australia}}\nCatholic religious institutes were influential in the development of Australian nursing, founding many of Australia's hospitals – the Irish [[Sisters of Charity of Australia|Sisters of Charity]] were first to arrive in 1838 and established [[St Vincent's Hospital, Sydney]] in 1857 as a free hospital for the poor. They and other orders like the [[Sisters of Mercy]], and in aged care the Sisters of the Little Company of Mary and [[Little Sisters of the Poor]] founded hospitals, hospices, research institutes and aged care facilities around Australia.<ref>{{cite web|url=http://national.stvincents.com.au/history.php|date=6 July 2011|archive-url=https://web.archive.org/web/20100402062826/http://national.stvincents.com.au/history.php|archive-date=2 April 2010|access-date=31 July 2012|title=Sisters of Charity Health Service }}</ref><ref>{{cite web|title=Little Sisters of the Poor Oceania|url=http://www.littlesistersofthepoor.org.au/|publisher=Littlesistersofthepoor.org.au|access-date=31 July 2012}}</ref>\n\nA census in the 1800s found several hundred nurses working in Western Australia during the colonial period of history, this included Aboriginal female servants who cared for the infirm.<ref>\"But Westward Look\" by author</ref>\n\nThe state nursing licensing bodies amalgamated in Australia in 2011 under the federal body AHPRA (Australian Health Practitioner Registration Authority).<ref>{{cite journal|last1=Ralph|first1=Nicholas|last2=Birks|first2=Melanie|last3=Chapman|first3=Ysanne|date=November 2013|title=The accreditation of nursing education in Australia|url=http://eprints.usq.edu.au/25901/14/Ralph_Birks_Coll_SV.pdf|journal=Collegian|volume=22|issue=1|pages=3–7|doi=10.1016/j.colegn.2013.10.002|pmid=26285403}}</ref> Several divisions of nursing license is available and recognized around the country.\n\n* Enrolled nurses may initiate some oral medication orders with a specific competency now included in national curricula but variable in application by agency.\n* Registered nurses hold a university degree (enrolled nurses can progress to registered nurse status and do get credit for previous study).\n* Nurse practitioners have started emerging from postgraduate programs and work in both private practice and [[Public hospital|public hospitals and clinics]].\n* Mental health nurses must complete further training as advanced mental health practitioners in order to administer client referrals under the ''Mental Health Act''.\n\nAustralia enjoys the luxury of a national curriculum for vocational nurses, trained at Technical and Further Education (TAFE) colleges or private Registered Training Organization (RTO). Enrolled and registered nurses are identified by the department of immigration as an occupational area of need, although registered nurses are always in shorter supply, and this increases in proportion with specialization.\n\n<ref>[http://www.anu.edu.au/polsci/marx/interventions/rebelwomen/nurses.htm Nurses' militancy stemmed from two different kinds of experiences]. Anu.edu.au (19 November 1983). Retrieved 28 July 2013.</ref>\n\nIn 1986 there were a number of rolling industrial actions around the country, culminating when five thousand Victorian nurses went on strike for eighteen days. The hospitals were able to function by hiring casual staff from each other's striking members, but the increased cost forced a decision in the nurses' favor.\n\n", "goals": ["The student will be able to identify the goals of the course and the learning objectives", "The student will be able to identify the goals of the course and the learning objectives", "The student will be able to identify the goals of the course and the learning objectives", "The student will be able to identify the goals of the course and the learning objectives", "The student will be able to identify the goals of the course and the learning objectives"]}, {"title": "Board certification", "content": "{{main article|Nursing credentials and certifications}}\n\nProfessional nursing organizations, through their certification boards, have voluntary certification exams to demonstrate clinical competency in their particular specialty. Completion of the prerequisite work experience allows an RN to register for an examination, and passage gives an RN permission to use a professional designation after their name. For example, passage of the American Association of Critical-care Nurses specialty exam allows a nurse to use the initials 'CCRN' after his or her name. Other organizations and societies have similar procedures.\n\nThe [[American Nurses Credentialing Center]], the credentialing arm of the [[American Nurses Association]], is the largest nursing credentialing organization and administers more than 30 specialty examinations.<ref name=\"ANCC\">American Nurses Credentialing Center. [http://www.ana.org/ancc/cert/index.html \"ANCC Certification\"] {{Webarchive|url=https://web.archive.org/web/20070607205339/http://www.ana.org/ancc/cert/index.html |date=7 June 2007 }} Washington, D.C., American Nurses Association, '''2006'''.</ref>\n\n", "goals": ["The student will be able to identify the goals of the course", "The student will be able to identify the goals of the course", "The student will be able to identify the goals of the course", "The student will be able to identify the goals of the course", "The student will be able to identify the goals of the course"]}, {"title": "Advanced practice", "content": "\n* ''Nurse practitioners'' – Most of these nurses obtain a minimum of a master's degree and a desired post grad certificate. They often perform roles similar to those of physicians and physician assistants. They can prescribe medications as independent or supplementary prescribers, although they are still legally regulated, unlike physician's assistants. Most Nurse Practitioners (NPs) have referral and admission rights to hospital specialties. They commonly work in [[primary care]] (e.g. General Practitioner (GP) surgeries), [[Emergency department|Accident and Emergency (A&E) departments]], or pediatrics although they are increasingly being seen in other areas of practice. In the UK, the title \"nurse practitioner\" is legally protected.\n* ''Specialist community public health nurses'' – traditionally [[district nurse]]s and [[health visitor]]s, this group oversees research and publication activities.\n* ''Lecturer-practitioners (also called practice education facilitators)'' – these nurses work both in the National Health Service (NHS), and in universities. They typically work 2–3 days per week in each setting. In university, they train pre-registration student nurses (see below), and often teach on specialist courses post-registration nurses.\n* ''Lecturers'' – these nurses are not employed by the NHS. Instead they work full-time in universities, both teaching and performing research.\n\n", "goals": ["The student will be able to identify the roles and responsibilities of different types of nurses, including nurse practitioners, specialist community public health nurses, lecturer-practitioners, and lecturers", "The student will be able to describe the education and training required for each type of nurse, including the minimum qualifications and the typical length of time it takes to complete the education and training", "The student will be able to explain the legal and regulatory frameworks that govern the practice of nurse practitioners, including the requirements for prescribing medications and the referral and admission rights to hospital specialties", "The student will be able to describe the roles and responsibilities of specialist community public health nurses, including their oversight of research and publication activities", "The student will be able to explain the roles and responsibilities of lecturer-practitioners, including their work in both the NHS and universities, and their training of pre-registration student nurses"]}, {"title": "Israel", "content": "Nurses in [[Israel]] have a wide variety of responsibilities, including hospital care, patient education, wound care, prenatal and other monitoring, midwifery, and well-baby clinics.\n\nNursing in Israeli Jewish culture traces its origins to [[Shiphrah and Puah|Shifra and Puah]], two [[Hebrews|Hebrew]] midwives depicted in the [[Book of Exodus]] helping women in ancient Egypt give birth and keep their infants safe.\n\nModern-day nursing was established by nurses sent to [[Mandatory Palestine]] and later Israel by the [[Hadassah Women's Zionist Organization of America|Hadassah]] organization, as well as a nursing school founded by [[Henrietta Szold]] in 1918.  During those times, the United Kingdom regulated midwifery in Mandatory Palestine, but the nurses were not mentioned in the regulation decree.\n\nToday, nurses and midwives are regulated by the [[Israeli Ministry of Health]].\n\n", "goals": ["The student will be able to identify the role of the nurse in the context of the patient's care and the healthcare team", "The student will be able to describe the responsibilities of a nurse in various healthcare settings, including hospital care, patient education, wound care, prenatal and other monitoring, midwifery, and well-baby clinics", "The student will be able to explain the historical origins of nursing in Israeli Jewish culture, tracing its origins to Shiphrah and Puah, two Hebrew midwives depicted in the Book of Exodus helping women in ancient Egypt give birth and keep their infants safe", "The student will be able to describe the establishment of modern-day nursing in Israel by nurses sent to Mandatory Palestine and later Israel by the Hadassah organization, as well as a nursing school founded by Henrietta Szold in 1918", "The student will be able to explain the role of the Israeli Ministry of Health in regulating nurses and midwives in the country today"]}, {"title": "References", "content": "{{Reflist}}\n\n", "goals": ["The student will be able to identify the main components of the nursing process and their importance in the nursing process", "The student will be able to identify the main components of the nursing process and their importance in the nursing process", "The student will be able to identify the main components of the nursing process and their importance in the nursing process", "The student will be able to identify the main components of the nursing process and their importance in the nursing process", "The student will be able to identify the main components of the nursing process and their importance in the nursing process"]}, {"title": "External links", "content": "{{Wikiquote|Nursing}}\n{{Wikibooks|Careers|Nursing}}\n{{Commons category|Nursing}}\n* [http://library.uncg.edu/dp/wv/itemSearch.aspx?t=1&k=nurse UNCG Library Betty H. Carter Women Veterans Historical Project: Nurse]\n* {{Cite EB1911|wstitle=Nursing |short=x}}\n\n{{Nursing}}\n{{Medicine}}\n{{Glossaries of science and engineering}}\n{{Authority control}}\n\n[[Category:Nursing| ]]\n[[Category:Military supporting service occupations]]\n[[Category:Rehabilitation team]]\n[[Category:Health care occupations]]\n[[Category:Hospital staff]]", "goals": ["The student will be able to identify the role of the nurse in the healthcare team and the importance of effective communication in the delivery of healthcare services", "The student will be able to identify the role of the nurse in the healthcare team and the importance of effective communication in the delivery of healthcare services", "The student will be able to identify the role of the nurse in the healthcare team and the importance of effective communication in the delivery of healthcare services", "The student will be able to identify the role of the nurse in the healthcare team and the importance of effective communication in the delivery of healthcare services", "The student will be able to identify the role of the nurse in the healthcare team and the importance of effective communication in the delivery of healthcare services"]}]}