{"id": 238212, "key": "Abnormal_psychology", "title": "Abnormal psychology", "latest": {"id": 1216286397, "timestamp": "2024-03-30T05:49:21Z"}, "content_model": "wikitext", "license": {"url": "https://creativecommons.org/licenses/by-sa/4.0/deed.en", "title": "Creative Commons Attribution-Share Alike 4.0"}, "source": "{{short description|Sub-discipline of psychology}}\n{{Psychology sidebar|basic}}\n'''Abnormal psychology''' is the branch of [[psychology]] that studies unusual patterns of [[behavior]], [[emotion]], and [[thought]], which could possibly be understood as a [[mental disorder]]. Although many behaviors could be considered as [[abnormality (behavior)|abnormal]], this branch of psychology typically deals with behavior in a clinical context.<ref>{{cite web | url = http://assets.pearsonglobalschools.com/asset_mgr/current/201214/PsychologyChapter5.pdf | title = Abnormal Psychology | publisher = Pearson International Schools | access-date = 2013-03-21 | archive-date = 2013-06-26 | archive-url = https://web.archive.org/web/20130626034611/http://assets.pearsonglobalschools.com/asset_mgr/current/201214/PsychologyChapter5.pdf | url-status = dead }}</ref><ref name=\"Barlow_2012\">{{cite book |title=Abnormal Psychology: An Integrative Approach | vauthors = Barlow D |publisher=Wadsworth Cengage Learning |year=2012 |isbn=978-1-111-34362-0 |location=Belmont, California, US }}</ref>{{rp|1–4}} There is a long history of attempts to understand and control behavior deemed to be aberrant or deviant (statistically, functionally, morally, or in some other sense), and there is often cultural variation in the approach taken. The field of abnormal psychology identifies multiple causes for different conditions, employing diverse theories from the general field of psychology and elsewhere, and much still hinges on what exactly is meant by \"abnormal\". There has traditionally been a divide between psychological and biological explanations, reflecting a philosophical [[Mind–body dualism|dualism]] in regard to the [[mind–body problem]]. There have also been different approaches in trying to [[Classification of mental disorders|classify mental disorders]]. Abnormal includes three different categories; they are [[wikt:subnormal|subnormal]], [[wikt:supernormal|supernormal]] and [[wikt:paranormal|paranormal]].<ref>{{cite journal |doi=10.1037/h0074965 |title=What is abnormal psychology? |year=1930 | vauthors = Bridges JW |journal=The Journal of Abnormal and Social Psychology |volume=24 |issue=4 |pages=430–2}}</ref>\n\nThe science of abnormal psychology studies two types of behaviors: adaptive and [[maladaptive behavior]]s. Behaviors that are maladaptive suggest that some problem(s) exist, and can also imply that the individual is vulnerable and cannot cope with environmental stress, which is leading them to have problems functioning in daily life in their emotions, mental thinking, physical actions and talks. Behaviors that are adaptive are ones that are well-suited to the nature of people, their lifestyles and surroundings, and to the people that they communicate with, allowing them to understand each other.<ref>{{cite book|title=Abnormal Psychology|publisher=Prentice Hall |location=US| vauthors =Sarason IG, Sarason BR |edition=6th }}{{page needed|date=October 2013}}</ref>\n\n[[Clinical psychology]] is the applied field of psychology that seeks to assess, understand, and treat psychological conditions in clinical practice. The theoretical field known as ''abnormal psychology'' may form a backdrop to such work, but clinical psychologists in the current field are unlikely to use the term ''abnormal'' in reference to their practice. [[Psychopathology]] is a similar term to abnormal psychology, but may have more of an implication of an underlying [[pathology]] (disease process), which assumes the medical model of mental disturbance and as such, is a term more commonly used in the medical specialty known as [[psychiatry]].<ref>{{cite journal | vauthors = Stanghellini G | title = Psychopathology: re-humanizing psychiatry | journal = Acta Psychiatrica Scandinavica | volume = 127 | issue = 6 | pages = 436–7 | date = June 2013 | pmid = 23663272 | doi = 10.1111/acps.12091 | doi-access = free }}</ref>\n\n==History==\n{{Main|History of mental disorders}}\n\n=== Humors ===\n{{Main articles|Humorism|Four temperaments}}\n[[Hippocrates]] (460–377 BCE) hypothesized that the body and mind become unwell when the so-called [[Humorism|humors]], vital fluids in the body, become unbalanced. The [[four temperaments]] theory posits four such humors: black bile, yellow bile, phlegm, and blood. Each humor was associated with a particular temperament: too much phlegm causes a person to be fatigued, too much black bile causes [[melancholia]], yellow bile causes a quick temper, and too much blood causes optimism, cheerfulness, and confidence.<ref>{{Cite book | vauthors = Nevid J, Rathus S, Greene B |title=Abnormal Psychology in a changing world |publisher=Pearson |year=2018 |isbn=978-0-134-44758-2 |location=New York, NY |page=11}}</ref>\n\n===Asylums===\nThe act of placing individuals with mental illness in a separate facility known as an [[Psychiatric hospital|asylum]] dates to 1547, when [[Henry VIII|King Henry VIII of England]] established the [[Bethlem Royal Hospital|St. Mary of Bethlehem asylum]] in London. This hospital, nicknamed Bedlam, was famous for its deplorable conditions.<ref name = \"Nolen-Hoeksema_2013\">{{cite book | vauthors = Nolen-Hoeksema S | date = 2013 | title = Abnormal Psychology | edition = 6th | location = Boston | publisher = McGraw-Hill | isbn = 978-0078035388 }}</ref> Asylums remained popular throughout the [[Middle Ages]] and the [[Renaissance|Renaissance era]]. These early asylums often had miserable conditions. Patients were seen as a \"burden\" to society, locked away and treated almost like beasts to be dealt with, rather than patients needing treatment. However, many of the patients received helpful medical treatment. There was scientific curiosity into abnormal behavior, although it was rarely investigated in the early asylums. Inmates in these early asylums were often put on display for profit, as they were viewed as less than human. The early asylums were basically modifications of the existing criminal institutions.<ref name=\"Fadul_2014\">{{Cite book|title=Encyclopedia of Theory & Practice in Psychotherapy & Counseling| vauthors = Fadul JA |publisher=Lulu Press Inc.|year=2014|isbn=978-1-312-34920-9|location=Raleigh, NC|pages=3}}</ref>\n\nIn the late 18th century, the idea of humanitarian treatment for the patients gained much favor, due to the work of [[Philippe Pinel]] in France. He pushed for the idea that the patients should be treated with kindness, and not the cruelty inflicted on them, as if they were animals or criminals. His experimental ideas, such as removing the chains from the patients, were met with reluctance. The experiments in kindness proved to be a great success, which helped to bring about a reform in the way mental institutions would be run.<ref name=\"Fadul_2014\" />\n\nInstitutionalization would continue to improve throughout the 19th and 20th century, as a result of the work of many humanitarians such as [[Dorothea Dix]], and the [[Social hygiene movement|mental hygiene movement]] which promoted the physical well-being of the mental patients. \"Dix, more than any other figure in the nineteenth century, made people in America and virtually all of Europe aware that the insane were being subjected to incredible abuses.\"<ref>{{cite book | vauthors = Rimm DC, Somervill JW | title = Abnormal Psychology | location = New York | publisher = Academic Press | date = 1977 | isbn = 978-0-12-588840-0 }} {{page needed|date=May 2013}}</ref> Through this movement, millions of dollars were raised to build new institutions to house the mentally ill. Mental hospitals began to grow substantially in numbers during the 20th century, as care for the mentally ill increased in them.\n\nBy 1939, there were over 400,000 patients in state mental hospitals in the US.<ref name = Osborn>{{cite journal | vauthors = Osborn LA | title = From beauty to despair: the rise and fall of the American State Mental Hospital | journal = The Psychiatric Quarterly | volume = 80 | issue = 4 | pages = 219–31 | date = December 2009 | pmid = 19633958 | doi = 10.1007/s11126-009-9109-3 | s2cid = 11812547 }}</ref>  Hospital stays were normally quite long for the patients, with some individuals being treated for many years. These hospitals, while better than the asylums of the past, were still lacking in the means of effective treatment for the patients. Even though the reform movement had occurred, patients were often still met with cruel and inhumane treatment.\n\nThings began to change in the year 1946, when [[Mary Jane Ward]] published the influential novel titled ''The Snake Pit'', which was made into a [[The Snake Pit|popular movie of the same name]]. The book called attention to the conditions which mental patients faced, and helped to spark concern in the general public to create more humane mental health care in these overcrowded hospitals.<ref name = Osborn/>\n\nThat same year, the [[National Institute of Mental Health]] was also created, which provided support for the training of hospital employees, and research into the conditions of the patients. During this period, the [[Hill–Burton Act|Hill-Burton Acts]] was also passed, which was a program that funded mental health hospitals. Along with the Community Health Services Act of 1963, the Hill-Burton Acts helped with the creation of outpatient psychiatric clinics, inpatient general hospitals, and rehabilitation and community consultation centers.<ref name=\"Fadul_2014\" />\n\n=== Deinstitutionalisation ===\nIn the late twentieth century, however, a large number of mental hospitals were closed in many countries. In England, for example, only 14 of the 130 psychiatric institutions that had been created in the early 20th century remained open at the start of the 21st century.<ref name = Osborn/> In 1963, [[John F. Kennedy|President John F. Kennedy]] launched the community health movement in the United States as a \"bold new approach\" to mental health care, aimed at coordinating mental health services for citizens in mental health centers. In the span of 40 years, the United States was able to see an about 90 percent drop in the number of patients in psychiatric hospitals.<ref name = \"Nolen-Hoeksema_2013\" />\n\nDeinstitutionalisation ended the long-term confinement of patients in isolating mental hospitals, which could and did cause long-term negative adaptations. For instance, institutionalizing people with schizophrenia worsens [[Schizophrenia#Negative symptoms|negative symptoms]].<ref>[https://karger.com/psp/article-abstract/40/2/83/284622/Lifelong-Course-of-Positive-and-Negative-Symptoms Lifelong Course of Positive and Negative Symptoms],Branislav Mancevski; John Keilp; Matthew Kurzon; Robert M. Berman; Vladimir Ortakov; Jill Harkavy-Friedman; Gorazd Rosoklija; Andrew J. Dwork. ''Psychopathology'' (2007), vol. 40, no. 2, pp. 83-92</ref> However, the practice is sometimes criticised for a perceived rise in homelessness amongst people who were previously institutionalized, or are presumed that they would have been in the institution era.<ref>{{cite journal | vauthors = Page J, Petrovich J, Kang SY | title = Characteristics of homeless adults with serious mental illnesses served by three street-level federally funded homelessness programs | journal = Community Mental Health Journal | volume = 48 | issue = 6 | pages = 699–704 | date = December 2012 | pmid = 22370894 | doi = 10.1007/s10597-011-9473-y | s2cid = 27447526 }}</ref><ref>{{cite book | vauthors = Jones BE | title = Treating the Homeless: Urban Psychiatry's Challenge. | location = Washington, D.C. | publisher = American Psychiatric Press | date = 1986 | isbn = 978-0-88048-080-2 }} {{page needed|date=October 2013}}</ref>\n\n==Explaining abnormal behaviour==\n\nPeople have tried to explain and control abnormal behavior for thousands of years. Historically, there have been [[Biopsychiatry controversy|three main approaches]] to abnormal behavior: the [[supernatural]], [[biological]], and [[psychological]] traditions.<ref name = \"Barlow_2012\" />{{rp|7}} Abnormal psychology revolves around two major [[paradigm]]s for explaining mental disorders, the ''psychological'' paradigm and the ''biological'' paradigm. The psychological paradigm focuses more on the humanistic, cognitive, and behavioral causes and effects of psychopathology. The biological paradigm includes theories that focus more on physical factors, such as [[genetics]] and [[neurochemistry]].\n\n===Supernatural explanations===\nIn the first supernatural tradition, also called the demonological method, abnormal behaviors are attributed to agents outside human bodies. According to this model, abnormal behaviors are caused by [[demon]]s, [[Extraterrestrial life|aliens]], or spirits, or the influences of the [[Moon]], planets, and stars. During the Stone Age, [[trepanning]] was performed on those who had [[Mental disorder|mental illness]], to literally cut the evil spirits out of the victim's head. Conversely, [[History of China|Ancient Chinese]], [[Ancient Egypt]]ians, and [[Hebrews]] believed that these were evil demons or spirits and advocated [[exorcism]]. By the time of the [[Ancient Greeks|Greeks]] and [[Ancient Romans|Romans]], mental illnesses were thought to be caused by an imbalance of the [[four humors]] which lead treatments like the draining of fluids from the [[brain]]. During the [[Medieval]] period, many Europeans believed that the power of [[Witchcraft|witches]], demons, and spirits caused abnormal behaviors. People with psychological disorders were thought to be possessed by evil spirits that had to be exorcised through [[Religion|religious]] rituals. If exorcism failed, some authorities advocated steps such as confinement, beating, and other types of [[torture]] to make the body uninhabitable to witches, demons, and spirits. The belief that witches, demons, and spirits are responsible for the abnormal behavior continued into the 15th century.<ref name = \"Barlow_2012\" />{{rp|8}} Swiss [[Alchemy|alchemist]], astrologer, and [[physician]] [[Paracelsus]] (1493–1541), on the other hand, rejected the idea that abnormal behaviors were caused by [[witches]], demons, and spirits and suggested that people's mind and behaviors were influenced by the movements of the moon and stars.<ref name = \"Barlow_2012\" />{{rp|11}} This tradition is still alive today. Some people, especially in the developing countries, as well as some followers of religious [[sect]]s in the developed countries, continue to believe that [[supernatural]] powers influence human behaviors. In Western [[academia]], the supernatural tradition has been largely replaced by the biological and psychological traditions.<ref name = \"Barlow_2012\" />{{rp|26}}\n\n'''Supernatural traditions'''\n\nThroughout time, societies have proposed several explanations of abnormal behavior within human beings. Beginning in some hunter-gatherer societies, [[Animism|animists]] have believed that people demonstrating abnormal behavior are possessed by [[Vengeful ghost|malevolent spirits]]. This idea has been associated with [[Trepanning|trepanation]], the practice of cutting a hole into the individual's skull in order to release the malevolent spirits.<ref>{{Harvnb|Hansell|Damour|2005|pp=Ch 3. pp. 30–33}}</ref> Although it has been difficult to define abnormal psychology, one definition includes characteristics such as statistical infrequency.<ref>{{cite book|title=Abnormal Psychology|vauthors=Davison GC|publisher=Veronica Visentin|year=2008|isbn=978-0-470-84072-6|location=Toronto|pages=3}}</ref>\n\nA more formalized response to spiritual beliefs about abnormality is the practice of exorcism. Performed by religious authorities, exorcism is thought of as another way to release evil spirits who cause pathological behavior within the person. In some instances, individuals exhibiting unusual thoughts or behaviors have been [[exile]]d from society, or worse. Perceived witchcraft, for example, has been punished by death. Two Catholic Inquisitors wrote the ''[[Malleus Maleficarum]]'' (Latin for \"The Hammer Against Witches\"), which was used by many Inquisitors and witch-hunters. It contained an early taxonomy of perceived deviant behavior, and proposed guidelines for prosecuting deviant individuals.<ref>{{Cite journal| vauthors = Herzig T |date=2010|title=Malleus maleficarum (review) |url= http://muse.jhu.edu/content/crossref/journals/magic_ritual_and_witchcraft/v005/5.1.herzig.html |journal=Magic, Ritual, and Witchcraft|language=en|volume=5|issue=1|pages=135–138|doi=10.1353/mrw.0.0161|s2cid=161336612|issn=1940-5111}}</ref>\n\n===Biological explanations===\nIn the biological tradition, psychological disorders are attributed to biological causes. In the psychological tradition, disorders are attributed to faulty [[Developmental psychology|psychological development]], and to [[Social environment|social context]].<ref name = \"Barlow_2012\" />{{rp|26}} The medical or biological perspective holds the belief that most or all abnormal behavior can be attributed to a medical factor; assuming all psychological disorders are diseases.<ref name=\"Purgatory Perspectives: Medical\">{{cite web|title=Perspectives: Medical|url=http://www.purgatory.net/merits/medical.htm | work = A Beginner's Guide to Abnormal Psychology }}</ref>\n\nThe Greek physician [[Hippocrates]], who is considered to be the father of Western medicine, played a major role in the biological tradition. Hippocrates and his associates wrote the [[Hippocratic Corpus]] between 450 and 350 BC, in which they suggested that abnormal behaviors can be treated like any other disease. Hippocrates viewed the brain as the seat of [[consciousness]], [[emotion]], [[intelligence]], and [[wisdom]] and believed that disorders involving these functions would logically be located in the brain.<ref name = \"Barlow_2012\" />{{rp|11}}\n\nThese ideas of Hippocrates and his associates were later adopted by [[Galen]], the [[Ancient Rome|Roman]] physician. [[Galen]] extended these ideas and developed a strong and influential school of thought within the biological tradition that extended well into the 18th century.\n\nKendra Cherry, MSEd, states: \"The medical approach to abnormal psychology focuses on the biological causes of mental illness. This perspective emphasizes understanding the underlying cause of disorders, which might include genetic inheritance, related physical disorders, infections, and chemical imbalances. Medical treatments are often pharmacological in nature, although medication is often used in conjunction with some other type of psychotherapy.\"<ref>{{Cite news|url=https://www.verywell.com/what-is-abnormal-psychology-2794775|title=What Is Abnormal Psychology?| vauthors = Cherry K |date=May 9, 2016|work=Verywell|access-date=2017-03-10}}</ref>\n\n===Psychological explanations===\n\nAccording to Sigmund Freud's [[Id, ego and super-ego|structural model]], the id, ego, and superego are three theoretical constructs that define the way an individual interacts with the external world, as well as responding to internal forces<ref name=\"Boag_2014\">{{cite journal | vauthors = Boag S | title = Ego, drives, and the dynamics of internal objects | journal = Frontiers in Psychology | volume = 5 | issue = 5 | pages = 666 | date = July 1, 2014 | pmid = 25071640 | pmc = 4076885 | doi = 10.3389/fpsyg.2014.00666 | doi-access = free }}</ref> The Id represents the instinctual drives of an individual that remain unconscious. The super-ego represents a person's conscience and their internalization of societal norms and morality. Finally, the ego serves to realistically integrate the drives of the id with the prohibitions of the super-ego. Lack of development in the Superego, or an incoherently developed Superego within an individual, will result in thoughts and actions that are irrational and abnormal, contrary to the norms and beliefs of society.<ref name=\"Boag_2014\" />\n\n====Irrational beliefs====\nIrrational beliefs are driven by unconscious fears and can result in abnormal behavior.<ref name=\"Turner_2016\">{{cite journal | vauthors = Turner MJ | title = Rational Emotive Behavior Therapy (REBT), Irrational and Rational Beliefs, and the Mental Health of Athletes | journal = Frontiers in Psychology | volume = 7 | pages = 1423 | date = 2016-09-20 | pmid = 27703441 | pmc = 5028385 | doi = 10.3389/fpsyg.2016.01423 | doi-access = free }}</ref> [[Rational emotive behavior therapy]] helps to drive irrational and maladaptive beliefs out of one's mind.<ref name=\"Turner_2016\" />\n\n==== Sociocultural influences====\nThe term sociocultural refers to the various circles of influence on the individual, ranging from close friends and family, to the institutions and policies of a country, or the world as a whole. Discriminations, whether based on social class, income, race and ethnicity, or gender, can influence the development of abnormal behaviour.<ref>{{cite book | vauthors = Whitbourne SK, Halgin RP |title=Abnormal Psychology: Clinical Perspectives on Psychological Disorders |date=2013 |publisher=McGraw-Hill Higher Education |location=New York, NY |isbn=978-0-07-803527-2 |edition=7th}}</ref>\n\n===Multiple causality===\nThe number of different theoretical perspectives in the field of psychological abnormality has made it difficult to properly explain psychopathology. The attempt to explain all mental disorders with the same theory leads to [[reductionism]] (explaining a disorder or other complex phenomena using only a single idea or perspective).<ref name = \"Hansell_2005_37\">{{Harvnb|Hansell|Damour|2005|pp=Ch 3. pp. 37}}</ref> Most mental disorders are composed of several factors, which is why one must take into account several theoretical perspectives, when attempting to diagnose or explain a particular behavioral abnormality or mental disorder. Explaining mental disorders with a combination of theoretical perspectives is known as multiple causality.\n\nThe [[diathesis–stress model]]<ref>{{cite journal | vauthors = Zvolensky MJ, Kotov R, Antipova AV, Schmidt NB | title = Diathesis stress model for panic-related distress: a test in a Russian epidemiological sample | journal = Behaviour Research and Therapy | volume = 43 | issue = 4 | pages = 521–32 | date = April 2005 | pmid = 15701361 | doi = 10.1016/j.brat.2004.09.001 | s2cid = 2979875 }}</ref> emphasizes the importance of applying multiple causality to psychopathology, by stressing that disorders are caused by both precipitating causes, and predisposing causes. A precipitating cause is an immediate trigger that instigates a person's action or behavior. A predisposing cause is an underlying factor that interacts with the immediate factors to result in a disorder. Both causes play a key role in the development of a psychological disorder.<ref name = \"Hansell_2005_37\" /> For example, high neuroticism antedates most types of psychopathology.<ref name=\"NeuroticismMA\">{{cite journal | vauthors = Jeronimus BF, Kotov R, Riese H, Ormel J | title = Neuroticism's prospective association with mental disorders halves after adjustment for baseline symptoms and psychiatric history, but the adjusted association hardly decays with time: a meta-analysis on 59 longitudinal/prospective studies with 443 313 participants | journal = Psychological Medicine | volume = 46 | issue = 14 | pages = 2883–2906 | date = October 2016 | pmid = 27523506 | doi = 10.1017/S0033291716001653 | s2cid = 23548727 | url = https://zenodo.org/record/895885 }}</ref>\n\n===Recent concepts of abnormality===\n* ''Statistical abnormality''<ref>{{Cite web |last=Gilles-Thomas |first=David L. |date=1989 |title=Definitions of Abnormality |url=https://www.acsu.buffalo.edu/~dgthomas/Abpsy/lecture1.html |access-date=2022-06-05 |website=[[University of Buffalo]]}}</ref> – when a certain behavior/characteristic is relevant to a low percentage of the population. However, this does not necessarily mean that such individuals have mental illness (for example, statistical abnormalities such as extreme wealth/attractiveness)\n* ''Psychometric abnormality'' – [[Psychometrics|Psychometric]] abnormality implicates abnormality as a deviation from a statistically determined norm, such as the population average IQ of 100. In this case, an IQ score less than about 70–75 may define someone as having a learning disability, and suggests they will have some difficulties coping with life. However, the problems associated with a low IQ differ widely across individuals depending on their life circumstances. So, even when an individual is defined as psycho-metrically 'abnormal', this tells us little about their actual condition or problems. Furthermore, if one takes the other end of the IQ spectrum, a deviation of 30 points above the mean is generally not considered to be abnormal, or to indicate the presence of mental health problems.\n* ''Deviant behavior'' – this is not always a sign of mental illness, as mental illness can occur without deviant behavior, and such behavior may occur in the absence of mental illness.\n* ''Combinations'' – including distress, dysfunction, distorted psychological processes, inappropriate responses in given situations, and causing/risking harm to oneself.<ref>{{Harvnb|Bennett|2003|pp=3–5}}</ref>\n\n==== Examples ====\nThere is a wide range of [[mental disorder]]s that are considered to be forms of Abnormal Psychology. These include, but are not limited to:\n\n'''Schizophrenia'''\n\n[[Schizophrenia]] can be described as a disorder that causes extreme loss of touch with reality. The [[Psychosis|Psychotic]] nature of schizophrenia manifests itself through [[delusion]]s, as well as auditory and visual [[hallucination]]s. Schizophrenia is known to have a genetic etiology, as well as other biological components, such as brain disruptions in the prenatal development period.<ref name = \"Phares_2014\">{{cite book| vauthors = Phares V |title=Understanding abnormal Child Psychology|publisher=Wiley|location=Haboken NJ }}</ref>{{rp|323–326}}\n\n'''Attention deficit hyperactivity disorder'''\n\n[[Attention deficit hyperactivity disorder]] (ADHD) is characterized by high amounts of inattention and hyperactive impulsiveness. Inattentive symptoms include not listening, careless errors, disorganization, losing personal belongings, becoming easily distracted, and forgetfulness. Symptoms of hyperactive impulsiveness include fidgeting, talking excessively, and interrupting others.<ref name = \"Phares_2014\" />{{rp|225–253}}\n\n'''Antisocial personality disorder'''\n\n[[Antisocial personality disorder]] can be described as a cluster of personality traits that lead to specific outcomes, and violate the rights of other people. These personality traits include callousness, deceitfulness, lack of remorse, apathy, manipulation of others, impulsiveness, and grandiosity.<ref name=\"Sánchez_de_Ribera_2019\">{{Cite journal| vauthors = Sánchez de Ribera O, Kavish N, Katz IM, Boutwell BB, Back M |date= September 2019 |title=Untangling Intelligence, Psychopathy, Antisocial Personality Disorder, and Conduct Problems: A Meta–Analytic Review |journal=European Journal of Personality|language=en|volume=33|issue=5|pages=529–564|doi=10.1002/per.2207|s2cid=202253144|issn=0890-2070}}</ref> Additional traits may include superficial charm, sexual promiscuity, and pathological lying.<ref name=\"Sánchez_de_Ribera_2019\" />\n\n'''Dissociative identity disorder'''\n\n[[Dissociative identity disorder]] (DID) involves one individual having multiple personalities. Those with DID are described as having multiple selves that each have their own consciousness and awareness.<ref name=\"Boysen_2013\">{{cite journal | vauthors = Boysen GA, VanBergen A | title = A review of published research on adult dissociative identity disorder: 2000-2010 | journal = The Journal of Nervous and Mental Disease | volume = 201 | issue = 1 | pages = 5–11 | date = January 2013 | pmid = 23274288 | doi = 10.1097/NMD.0b013e31827aaf81 | s2cid = 25189072 }}</ref>\n\nDID has two main etiologies, which are the post-traumatic and socio-cognitive models.<ref name=\"Boysen_2013\" /> The post-traumatic model states that DID is caused by inescapable past trauma, such as child abuse. The child dissociates and forms alternate personalities as a coping mechanism, in response to the current trauma. Even when the trauma ends, the personalities continue to disrupt the person's life longterm. The socio-cognitive model states that people will implicitly act as if they have multiple personalities and that it is done to align with cultural norms.<ref name=\"Boysen_2013\" />\n\n'''Social anxiety disorder'''\n\nThose with [[social anxiety disorder]] (SAD) have a very intense fear of social situations. This fear stems from the belief that the person will be evaluated negatively or embarrass themselves.<ref name=\"McEnery_2019\">{{cite journal | vauthors = McEnery C, Lim MH, Tremain H, Knowles A, Alvarez-Jimenez M | title = Prevalence rate of social anxiety disorder in individuals with a psychotic disorder: A systematic review and meta-analysis | journal = Schizophrenia Research | volume = 208 | pages = 25–33 | date = June 2019 | pmid = 30722947 | doi = 10.1016/j.schres.2019.01.045 | s2cid = 73425627 }}</ref>\n\nSAD is also considered to be one of the more disabling mental disorders. Symptoms of this disorder include fear in most, if not all, social situations.<ref name=\"McEnery_2019\" /> SAD can develop after a traumatic and/or embarrassing experience has occurred while the person was being observed by other people.<ref name = \"Phares_2014\" />{{rp|200–202}}\n\n'''Generalized anxiety disorder'''\n\n[[Generalized anxiety disorder]] is characterized by a constant, chronic state of worry and anxiety that is related to a large variety of situations, and is difficult to control. Additional symptoms may include irritability, fatigue, concentration difficulties, and restlessness.<ref>{{cite journal | vauthors = Tyrer P, Baldwin D | title = Generalised anxiety disorder | journal = Lancet | volume = 368 | issue = 9553 | pages = 2156–66 | date = December 2006 | pmid = 17174708 | doi = 10.1016/S0140-6736(06)69865-6 | s2cid = 18959359 }}</ref>\n\n'''Specific phobia'''\n\nIndividuals with [[specific phobia]]s have an extreme fear and avoidance of various objects or situations.<ref name=\"Ipser_2013\">{{cite journal | vauthors = Ipser JC, Singh L, Stein DJ | title = Meta-analysis of functional brain imaging in specific phobia | journal = Psychiatry and Clinical Neurosciences | volume = 67 | issue = 5 | pages = 311–22 | date = July 2013 | pmid = 23711114 | doi = 10.1111/pcn.12055 | s2cid = 46155186 | doi-access = free }}</ref> Specifically, fears become phobias when there is excessive and unreasonable fear that is disproportionate to the culture that the individual is in.<ref name = \"Phares_2014\" />{{rp|199–200}} Examples of specific phobias include, but are not limited to, phobias of school, [[Blood phobia|blood]], [[Traumatophobia|injury]], [[Fear of needles|needles]], small animals, and [[Acrophobia|heights]].<ref name=\"Ipser_2013\" />\n\n'''Post-traumatic stress disorder'''\n\n[[Post-traumatic stress disorder]] (PTSD) is described as physical and mental distress related to past traumatic experiences. PTSD can manifest a large variety of symptoms, including, but not limited to, nightmares, flashbacks, avoidance and/or physiological reactions related to stimuli regarding the trauma, shame, guilt, anger, hypervigilance, and social withdrawal.<ref name=\"Kube_2020\">{{cite journal | vauthors = Kube T, Berg M, Kleim B, Herzog P | title = Rethinking post-traumatic stress disorder - A predictive processing perspective | journal = Neuroscience and Biobehavioral Reviews | volume = 113 | pages = 448–460 | date = June 2020 | pmid = 32315695 | doi = 10.1016/j.neubiorev.2020.04.014 | s2cid = 215814023 }}</ref>\n\nPTSD symptoms can arise due to various experiences that involve actual or threatened violence, injury, or death. Firsthand experience, witnessing, or learning about traumatic experiences can possibly lead to the development of PTSD.<ref name=\"Kube_2020\" />\n\n==Approaches==\n* ''Somatogenic''&nbsp;– abnormality is seen as a result of biological disorders in the brain.<ref>{{cite book | vauthors = Kraepelin E | title =  Compendium der Psychiatrie | trans-title = Textboook of Psychiatry | language = German | location = Leipzig | publisher = Abel | date = 1883 | oclc = 604107351 }}</ref> This approach has led to the development of radical biological treatments, e.g. lobotomy.\n* ''Psychogenic''&nbsp;– abnormality is caused by psychological problems. [[Psychoanalytic]] ([[Sigmund Freud|Freud]]), [[Cathartic]], [[Hypnotic]] and [[Humanistic Psychology]] ([[Carl Rogers]], [[Abraham Maslow]])<ref>{{Harvnb|Bennett|2003|pp=7–10}}</ref> treatments were all derived from this paradigm. This approach has, as well, led to some esoteric treatments: [[Franz Mesmer]] used to place his patients in a darkened room with music playing, then enter it wearing a flamboyant outfit and poke the \"infected\" body areas with a stick.\n\n==Classification==\n\n===DSM-5===\n{{more citations needed section|date=May 2013}}\nThe standard abnormal psychology and psychiatry reference book in North America is the [[Diagnostic and Statistical Manual]] of the [[American Psychiatric Association]]. The current version of the book is known as the DSM-5. It lists a set of [[mental illness|disorders]] and provides detailed descriptions on what constitutes a mental disorder.<ref name=\"DSM-5\" />\n\nThe DSM-5 identifies three key elements that must be present to constitute a mental disorder. These elements include:<ref name=\"DSM-5\" />\n* Symptoms that involve disturbances in behavior, thoughts, or emotions.\n* Symptoms associated with personal distress or impairment.\n* Symptoms that stem from internal dysfunctions (i.e. specifically having biological and/or psychological roots).<ref>{{cite book | vauthors = Schacter D, Gilbert D, Wegner D |year=2010 |title=Psychology |edition=2nd |chapter=Identifying Psychological Disorders: What is Abnormal? |chapter-url=https://books.google.com/books?id=emAyzTNy1cUC&pg=PA550 |location=New York, NY |publisher=Worth Publishers |isbn=978-1-4292-3719-2 |url=https://archive.org/details/psychology0000scha |url-access=registration }}</ref>  \nThe DSM-5 uses three main sections to organize its contents. These sections include I, II, and III. Section I includes the introduction, use, and basics of the DSM-5. Section II includes diagnostic criteria and codes. Section III includes emerging measures and models.<ref name=\"DSM-5\">{{cite book| author = American Psychiatric Association |title=Diagnostic and Statistical Manual of Mental Disorders (DSM-5)|year=2013|location=American Psychiatric Publishing}}</ref>\n\n=== Section I (DSM-5 Basics) ===\nSection I of the DSM-5 briefly prefaces purpose, content, structure, and use.<ref name=\"DSM-5\" /> This includes basics, introductions and cautionary statements for forensic use.<ref name=\"DSM-5\" /> Information is also given about the revision and review processes as well as the DSM-5's goals to harmonize with the ICD-11. An explanation regarding the change from the previous multi-axial classification system to the current three section system is also included here.<ref name=\"DSM-5\" />\n\n=== Section II (Diagnostic Criteria and Codes) ===\nSection II of the DSM-5 Contains a wide range of diagnostic criteria and codes used for establishing, and diagnosing the vast amount of abnormal psychological constructs.<ref name=\"DSM-5\" /> This sections replaced the bulk of the axis system in the previous DSM versions and includes the following categories:<ref name=\"DSM-5\" />\n\n* Diagnostic Criteria and codes<ref name=\"DSM-5\" />\n* [[Neurodevelopmental disorder|Neurodevelopmental Disorders]]<ref name=\"DSM-5\" />\n* [[Schizophrenia]] Spectrum and Other Psychotic Disorders<ref name=\"DSM-5\" />\n* [[Bipolar disorder|Bipolar]] and related Disorders<ref name=\"DSM-5\" />\n* Depressive Disorders<ref name=\"DSM-5\" />\n* Anxiety Disorders<ref name=\"DSM-5\" />\n* [[Obsessive–compulsive disorder|Obsessive-Compulsive]] and related Disorders<ref name=\"DSM-5\" />\n* Trauma and Stressor related disorders<ref name=\"DSM-5\" />\n* Dissociative Disorders<ref name=\"DSM-5\" />\n* [[Somatic symptom disorder|Somatic Symptom]] and Related Disorders<ref name=\"DSM-5\" />\n* Feeding and Eating Disorders<ref name=\"DSM-5\" />\n* Elimination Disorders<ref name=\"DSM-5\" />\n* [[Sleep disorder|Sleep Wake Disorders]]<ref name=\"DSM-5\" />\n* [[Sexual dysfunction|Sexual Dysfunctions]]<ref name=\"DSM-5\" />\n* [[Gender dysphoria|Gender Dysphoria]]<ref name=\"DSM-5\" />\n* Disruptive, Impulse Control, and [[Conduct disorder|Conduct Disorders]]<ref name=\"DSM-5\" />\n* Substance Related and Addictive Disorders<ref name=\"DSM-5\" />\n* Neurocognitive Disorders<ref name=\"DSM-5\" />\n* Personality Disorders<ref name=\"DSM-5\" />\n* Paraphilic Disorders<ref name=\"DSM-5\" />\n* Medication induced movement disorders and effects of medication.<ref name=\"DSM-5\" />\n* Other Mental disorders and additional Codes<ref name=\"DSM-5\" />\n\nThese categories are used to organize the various Abnormal psychological concepts based on their similarity.<ref name=\"DSM-5\" />\n\n=== Section III (Emerging Measures and Models) ===\nSection III of the DSM-5 contains the various methods and strategies that are used to make clinical decisions, understand culture, and explore emerging diagnoses.<ref name=\"DSM-5\" />\n\n===ICD-10===\nThe major international nosologic system for the classification of mental disorders can be found in the International Classification of Diseases, 10th revision (ICD-10). The [[ICD|ICD-10]] has been used by [[World Health Organization]] (WHO) Member States since 1994. Chapter five covers some 300 mental and behavioral disorders. The ICD-10's chapter five has been influenced by APA's DSM-IV and there is a great deal of concordance between the two. Beginning in January 2022, the ICD-11 will replace the ICD-10 in WHO member states.<ref>{{cite journal | vauthors = Reed GM, First MB, Kogan CS, Hyman SE, Gureje O, Gaebel W, Maj M, Stein DJ, Maercker A, Tyrer P, Claudino A, Garralda E, Salvador-Carulla L, Ray R, Saunders JB, Dua T, Poznyak V, Medina-Mora ME, Pike KM, Ayuso-Mateos JL, Kanba S, Keeley JW, Khoury B, Krasnov VN, Kulygina M, Lovell AM, de Jesus Mari J, Maruta T, Matsumoto C, Rebello TJ, Roberts MC, Robles R, Sharan P, Zhao M, Jablensky A, Udomratn P, Rahimi-Movaghar A, Rydelius PA, Bährer-Kohler S, Watts AD, Saxena S | display-authors = 6 | title = Innovations and changes in the ICD-11 classification of mental, behavioural and neurodevelopmental disorders | journal = World Psychiatry | volume = 18 | issue = 1 | pages = 3–19 | date = February 2019 | pmid = 30600616 | pmc = 6313247 | doi = 10.1002/wps.20611 }}</ref> WHO maintains free access to the [https://www.who.int/classifications/icd/en/ ICD-10 Online]. Below are the main categories of disorders:\n* '''F00–F09''' Organic, including symptomatic, mental disorders<ref name=\"ICD-10\" />\n* '''F10–F19''' Mental and behavioral disorders due to psychoactive substance use<ref name=\"ICD-10\" />\n* '''F20–F29''' Schizophrenia, schizotypal and delusional disorders<ref name=\"ICD-10\" />\n* '''F30–F39''' Mood [affective] disorders<ref name=\"ICD-10\" />\n* '''F40–F48''' Neurotic, stress-related and somatoform disorders<ref name=\"ICD-10\" />\n* '''F50–F59''' Behavioral syndromes associated with physiological disturbances and physical factors<ref name=\"ICD-10\" />\n* '''F60–F69''' Disorders of adult personality and behavior<ref name=\"ICD-10\" />\n* '''F70–F79''' Mental retardation<ref name=\"ICD-10\" />\n* '''F80–F89''' Disorders of psychological development<ref name=\"ICD-10\" />\n* '''F90–F98''' Behavioral and emotional disorders with onset usually occurring in childhood and adolescence<ref name=\"ICD-10\" />\n* '''F99''' Unspecified mental disorder<ref name=\"ICD-10\">{{Cite book|title=ICD-10: international statistical classification of diseases and related health problems. (10th revision, Fifth edition.)|publisher=World Health Organization|year=2016}}</ref>\n\n=== ICD-11 ===\nThe ICD-11 is the most recent version of the International Classification of Diseases. The ''Mental, behavioral, or Neurodevelopmental disorders section'' highlights forms of abnormal psychology.<ref name=\"ICD-11\">{{Cite web|last=World Health Organization|title=International Classification of Diseases for mortality and Morbidity Statistics (ICD-11)|url=https://icd.who.int/browse11/l-m/en|url-status=live|website=WHO|archive-url=https://web.archive.org/web/20180619155128/https://icd.who.int/browse11/l-m/en |archive-date=2018-06-19 }}</ref>\n\n'''Mental, behavioral, or Neurodevelopmental disorders'''\n\n* '''6A00-6A0Z''' Neurodevelopmental disorders<ref name=\"ICD-11\" />\n* '''6A20-6A2Z''' Schizophrenia or other primary psychotic disorders<ref name=\"ICD-11\" />\n* '''6A40-6A4Z''' Catatonia<ref name=\"ICD-11\" />\n* '''6A60-6A8Z''' Mood Disorders<ref name=\"ICD-11\" />\n* '''6B00-6B0Z''' Anxiety or fear related disorders<ref name=\"ICD-11\" />\n* '''6B20-6B2Z''' Obsessive-compulsive or related disorders<ref name=\"ICD-11\" />\n* '''6B40-6B4Z''' Disorders specifically associated with stress<ref name=\"ICD-11\" />\n* '''6B60-6B6Z''' Dissociative disorders<ref name=\"ICD-11\" />\n* '''6B80-6B8Z''' Feeding or eating disorders<ref name=\"ICD-11\" />\n* '''6C00-6C0Z''' Elimination Disorders<ref name=\"ICD-11\" />\n* '''6C20-6C2Z''' Disorders of bodily distress or bodily experience<ref name=\"ICD-11\" />\n* Disorders due to substance use or addictive behaviors<ref name=\"ICD-11\" />\n* '''6C70-6C7Z''' Impulse control disorders<ref name=\"ICD-11\" />\n* '''6C90-6C9Z''' Disruptive behavior or dissocial disorders<ref name=\"ICD-11\" />\n* '''6D10-6E68''' personality disorders and related traits<ref name=\"ICD-11\" />\n* '''6D30-6D3Z''' Paraphilic disorders<ref name=\"ICD-11\" />\n* '''6D50-6D5Z''' Factitious disorders<ref name=\"ICD-11\" />\n* '''6D70-6E0Z''' Neurocognitive disorders<ref name=\"ICD-11\" />\n* '''6E20-6E2Z''' Mental or behavioral disorders associated with pregnancy, childbirth or the puerperium<ref name=\"ICD-11\" />\n* '''6E40.0-6E40.Z''' (6E40) Psychological or behavioral factors affecting disorders or diseases classified elsewhere<ref name=\"ICD-11\" />\n* '''6E60-6E6Z''' secondary mental or behavioral syndromes associated with disorders or diseases classified elsewhere<ref name=\"ICD-11\" />\n\n==Perspectives of abnormal psychology==\nPsychologists may use different perspectives to try to get better understanding on abnormal psychology. Some of them may just concentrate on a single perspective. But the professionals prefer to combine two or three perspectives together in order to get significant information for better treatments.\n*Behavioral&nbsp;– the perspective focus on observable behaviors\n*Medical&nbsp;– the perspective focus on biological causes on mental illness\n*Cognitive&nbsp;– the perspective focus on how internal thoughts, perceptions and reasoning contribute to psychological disorders\n\n==Cause==\n\n===Genetics===\n* Investigated through family studies, mainly of monozygotic (identical) and dizygotic (fraternal) twins, often in the context of [[adoption]]. Monozygotic twins should be more likely than dizygotic twins to have the same disorder because they share 100% of their genetic material, whereas dizygotic twins share only 50%. For many disorders, this is exactly what research shows. But given that monozygotic twins share 100% of their genetic material, it may be expected of them to have the same disorders 100% of the time, but in fact they have the same disorders only about 50% of the time<ref>{{cite book | vauthors = Davila J, Fincham FD | chapter = Abnormal Psychology | chapter-url = http://www.blackwellpublishing.com/intropsych/pdf/chapter15.pdf | title = Psychology | publisher = }}</ref>\n* These studies allow calculation of a ''heritability coefficient''.\n*Genetic vulnerabilities ([[Diathesis–stress model|Diathesis stress Model]])<ref name = \"Phares_2014\" />{{rp|290–291}}\n\n===Biological causal factors===\n* Neurotransmitter [imbalances of neurotransmitters like [[norepinephrine]], [[dopamine]], [[serotonin]] and [[GABA]] (Gamma aminobutyric acid)] and hormonal imbalances in the brain<ref>{{Cite book| vauthors = Nevid J, Rathus S, Greene B |title=Abnormal Psychology in the changing world|publisher=Pearson|year=2018|isbn=978-0-134-44758-2|location=New York|pages=41–42}}</ref>\n* Constitutional liabilities [physical handicaps and temperament]\n* Brain dysfunction and neural plasticity\n* Physical deprivation or disruption [deprivation of basic physiological needs]\n\n===Socio-cultural factors===\n* Effects of urban/rural dwelling, gender and minority status on state of mind<ref>{{Cite book| vauthors = Fitzgerald K |title=Sociology of Sexualities|publisher=SAGE|year=2020|pages=204–205}}</ref>\n*[[Generalization (learning)|Generalizations]] about cultural practices and beliefs may fail to capture the diversity that exists within and across cultural groups, so we must be extremely careful not to stereotype individuals of any cultural group<ref>{{Cite book|title=Abnormal Child Psychology| vauthors = Mash EJ, Wolfe DA |publisher=Jon-David Hague|year=2013|isbn=978-1-111-83449-4|location=Belmont, CA|pages=110|quote=Generalizations about cultural practices and beliefs may fail to capture the diversity that exists within and across cultural groups, so we must be extremely careful not to stereotype individuals of any cultural group}}</ref>\n* Experiences with child physical and or sexual abuse.<ref name=\"Kube_2020\"/>\n* Encounters with environments that involve actual or threatened death<ref name=\"Kube_2020\" />\n\n===Systemic factors===\n* Family systems<ref name=\"Barbato_2020\" />\n* Negatively Expressed Emotion playing a part in schizophrenic relapse and [[anorexia nervosa]].\n\n===Biopsychosocial factors===\n* Illness dependent on stress \"triggers\".<ref>{{Harvnb|Bennett|2003|pp=17–26}}</ref>\n\n==Therapies==\n===Psychoanalysis (Freud)===\n[[Psychoanalytic theory]] is heavily based on the theory of the neurologist [[Sigmund Freud]]. These ideas often represented repressed emotions and memories from a patient's childhood within their unconscious. According to psychoanalytic theory, these repressions cause the disturbances that people experience in their daily lives, and by finding the source of these disturbances, one should be able to eliminate the disturbance itself. This is accomplished by a variety of methods, with some popular ones being [[Free association (psychology)|free association]], [[hypnosis]], and [[insight]]. The goal of these methods is to induce a [[catharsis]], or emotional release in the patient, which should indicate that the source of the problem has been tapped, and it can then be treated. Freud's [[Psychosexual development|psychosexual stages]] also played a key role in this form of therapy, as he would often believe that the problems the patient was experiencing were due to them becoming stuck, or \"[[Fixation (psychology)|fixated]]\", in a particular stage. Dreams also played a major role in this form of therapy, as Freud viewed dreams as a way to gain insight into the unconscious mind. Patients were often asked to keep dream journals to bring in for discussion during the next therapy session.  There are many potential problems associated with this style of therapy, including resistance to the repressed memory or feeling, and [[negative transference]] onto the therapist. Psychoanalysis was carried on by many after Freud, including his daughter [[Anna Freud]], and [[Jacques Lacan]]. Many others have also gone on to elaborate on Freud's original theory, and to add their own take on [[Defence mechanisms|defense mechanisms]] or [[Dream interpretation|dream analysis]].<ref>{{cite journal | vauthors = Kovacevic F |year= 2013|title=A Lacanian approach to dream interpretation |journal=[[Dreaming (journal)|Dreaming]] |volume=23  |issue=1 |pages=78–89 |doi=10.1037/a0032206}}</ref>  While psychoanalysis has fallen out of favor to more modern forms of therapy, it is still used by some clinical psychologists to varying degrees.<ref>{{cite journal | vauthors = Smit Y, Huibers MJ, Ioannidis JP, van Dyck R, van Tilburg W, Arntz A | title = The effectiveness of long-term psychoanalytic psychotherapy--a meta-analysis of randomized controlled trials | journal = Clinical Psychology Review | volume = 32 | issue = 2 | pages = 81–92 | date = March 2012 | pmid = 22227111 | doi = 10.1016/j.cpr.2011.11.003 }}</ref>\n\n===Behavioral therapy (Wolpe)===\n[[Behaviour therapy|Behavior therapy]] relies on the principles of [[behaviorism]], such as involving [[classical conditioning|classical]] and [[operant conditioning]]. Behaviorism arose in the early 20th century, from the work of psychologists such as James Watson and [[B. F. Skinner]]. Behaviorism states that all behaviors humans do is because of a [[Stimulus (psychology)|stimulus]] and [[reinforcement]]. While this reinforcement is normally for good behavior, it can also occur for maladaptive behavior.  In this therapeutic view, the patients maladaptive behavior has been reinforced, which will cause the maladaptive behavior to be repeated. The goal of the therapy is to reinforce less maladaptive behaviors, so that with time, these adaptive behaviors will become the primary ones in the patient.<ref>{{Cite journal| vauthors = Edwards J |date=2016|title=Behaviorism and Control in the History of Economics and Psychology|url=https://read.dukeupress.edu/hope/article/48/suppl_1/170-197/28071|journal=History of Political Economy|language=en|volume=48|issue=suppl 1|pages=170–197|doi=10.1215/00182702-3619262|issn=0018-2702}}</ref>\n\n===Humanistic therapy (Rogers)===\n\n[[Humanistic psychology|Humanistic therapy]] aims to achieve [[self-actualization]] ([[Carl Rogers]], 1961). In this style of therapy, the therapist will focus on the patient themselves, as opposed to the patient's problem. The goal of this therapy is, by treating the patient as \"human\", rather than \"client\", to get to the source of the problem, and to resolve the problem in an effective manner. Humanistic therapy has been on the rise in recent years, and has been associated with numerous positive benefits. It is considered to be one of the core elements needed for therapeutic effectiveness, and a significant contributor to not only the well-being of the patient, but society as a whole. Some say that all of the therapeutic approaches today draw from the humanistic approach in some regard, and that humanistic therapy is the best way for treat a patient.<ref>{{cite journal | vauthors = Schneider KJ, Längle A | title = The renewal of humanism in psychotherapy: summary and conclusion | journal = Psychotherapy | volume = 49 | issue = 4 | pages = 480–1 | date = December 2012 | pmid = 23205836 | doi = 10.1037/a0028026 }}</ref> Humanistic therapy can be used on people of all ages; it is very popular among children in its variant known as \"[[play therapy]]\".<ref name=\"Lin_2015\" />\n\n===Cognitive behavioural therapy (Ellis and Beck)===\n\n[[Cognitive behavioral therapy|Cognitive behavioural therapy]] (CBT) aims to influence thought and cognition (Beck, 1977). This form of therapy relies on not only the components of behavioral therapy as mentioned before, but also the elements of [[cognitive psychology]].<ref name=\"Phares_2014\" />{{rp|101–102}} This relies on not only the clients behavioral problems that could have arisen from conditioning, but also their [[Schema (psychology)|negative schemas]] and [[Beck's cognitive triad|distorted perceptions]] of the world around them.  These negative schemas may cause distress in the life of the patient; for example, the schemas may give them unrealistic expectations for how well they should perform at their job, or how they should look physically. When these expectations are not met, it will often result in maladaptive behaviors, such as [[Depression (mood)|depression]], [[Obsessive–compulsive disorder|obsessive compulsions]], and [[anxiety]]. With CBT, the goal is to change the schemas that are causing the stress in the patients life, and replace them with more realistic ones. Once the negative schemas have been replaced, it will hopefully cause a remission of the patients symptoms. CBT is considered particularly effective in the treatment of depression, and has even been used in recent years in group settings. It is felt that using CBT in a group setting aids in giving its members a sense of support, and decreasing the likelihood of them dropping out of therapy before the treatment has had time to work properly.<ref>{{cite journal | vauthors = Hans E, Hiller W | title = Effectiveness of and dropout from outpatient cognitive behavioral therapy for adult unipolar depression: a meta-analysis of nonrandomized effectiveness studies | journal = Journal of Consulting and Clinical Psychology | volume = 81 | issue = 1 | pages = 75–88 | date = February 2013 | pmid = 23379264 | doi = 10.1037/a0031080 }}</ref> CBT has been found to be an effective treatment for many patients, even those who do not have diseases and disorders typically thought of as psychiatric ones. For example, patients with the disease [[multiple sclerosis]] have found a lot of help using CBT. The treatment often helps the patients cope with the disorder they have, and how they can adapt to their new lives without developing new problems, such as depression, or negative schemas about themselves.<ref>{{cite journal | vauthors = Moss-Morris R, Dennison L, Landau S, Yardley L, Silber E, Chalder T | title = A randomized controlled trial of cognitive behavioral therapy (CBT) for adjusting to multiple sclerosis (the saMS trial): does CBT work and for whom does it work? | journal = Journal of Consulting and Clinical Psychology | volume = 81 | issue = 2 | pages = 251–62 | date = April 2013 | pmid = 22730954 | doi = 10.1037/a0029132 | author-link1 = Rona Moss-Morris }}</ref>\n\nAccording to RAND, therapies are difficult to provide to all patients in need. A lack of funding and understanding of symptoms provides a major roadblock that is not easily avoided. Individual symptoms and responses to treatments vary, which creates a disconnect between patient, society, and care givers/professionals.<ref>{{cite journal | vauthors = Gresenz CR, Stockdale SE, Wells KB |url= https://www.rand.org/pubs/research_briefs/RB4533/index1.html|title= Are People With Mental Illness Getting the Help They Need? | journal =  Health Services Research |date= January 2000| volume = 35 | issue = 1 | pages = 295–306 }}</ref>\n\n===Play therapy (Humanistic)===\n\nChildren are often sent to therapy due to outbursts that they have in a school or home setting; the theory is that by treating the child in a setting that is similar to the area that they are having their disruptive behavior, the child will be more likely to learn from the therapy, and have an effective outcome. In [[play therapy]], the clinicians will \"play\" with their client, usually with toys, or a tea party. Playing is the typical behavior of a child, and therefore, playing with the therapist will come as a natural response to the child. In playing together, the clinician will ask the patient questions, and due to the setting, the questions seem less intrusive, more therapeutic, and more like a normal conversation. This should help the patient realize issues they have, and confess them to the therapist with less difficulty than they may experience in a traditional counselling setting.<ref>{{cite journal| vauthors = Bratton SC, Ceballos PL, Sheely-Moore AI, Meany-Walen K, Pronchenko Y, Jones LD |year=2013|title=Head start early mental health intervention: Effects of child-centered play therapy on disruptive behaviors|journal=International Journal of Play Therapy|volume=22|pages=28–42|doi=10.1037/a0030318}}</ref>\n\nPlay therapy involves a therapist observing a child as the child plays with toys and interacts with their surrounding environment. The therapist plays an observational, as well as an interactional role, in the intervention. This process allows for the child to enact their problems through play, and speak more comfortably with the therapist.<ref name=\"Phares_2014\" />{{rp|102–103}} Although somewhat controversial, due to data that suggests a lack of effectiveness in children older than 10 years old, play therapy has been shown to be a valuable treatment. This therapy is particularly useful for younger children under the age of 10, who are consciously aware of their environment. Play therapy is important, seeing as many therapeutic interventions that are effective for adults have shown to be less effective for children.<ref name=\"Lin_2015\">{{Cite journal| vauthors = Lin YW, Bratton SC |date=January 2015|title=A Meta-Analytic Review of Child-Centered Play Therapy Approaches |journal=Journal of Counseling & Development|language=en|volume=93|issue=1|pages=45–58|doi=10.1002/j.1556-6676.2015.00180.x}}</ref>\n\n===Family systems therapies===\n\n[[Family therapy|Family systems therapies]] are based on the belief that children's problems revolve around problems that occur within the family. Family systems therapy attempts to improve the relations between multiple people involved in specific families via therapeutic intervention. For the best effect, it is recommended that the entire family be included in the therapy. The treatments include family management skill development, and child–parent attachment development. These interventions help to improve family functioning.<ref name=\"Phares_2014\" />{{rp|102–103}}\n\n===Family management skill development (Family systems therapy)===\n\nFamily management skills can be taught by family therapists, and include methods such as improving supervision, disciplinary practices, and creating environments that allow for positive interactions between parents and children.<ref name=\"Phares_2014\" />{{rp|102–103}}\n\n=== Child–parent attachment development (Family systems therapy) ===\n\nChild–parent [[Attachment theory|attachment]] development involves altering or creating relationships between parents and children, in attempts to create secure bases for the child, and to facilitate trust, independence, and positive perceptions of family relationships. We see these situations a lot more than we think which makes some spectrums of abnormal psychology more normal, and more common.<ref name=\"Barbato_2020\">{{Cite journal| vauthors = Barbato A, D'Avanzo B, Vadilonga F, Cortinovis M, Lombardi S, Pili F, Rangone G, Visconti A | display-authors = 6 |date=November 2020|title=Systemic family therapy integrated with attachment interventions for adoptive families. Development of a treatment manual |journal=Journal of Family Therapy|language=en|volume=42|issue=4|pages=539–540|doi=10.1111/1467-6427.12278| s2cid = 198768158 |issn=0163-4445}}</ref> These goals are often achieved by creating understanding regarding behaviors, creating opportunities for attachment, and increasing the family's ability to think about their history and relationships.<ref name=\"Barbato_2020\" />\n\n== See also ==\n{{Main|Outline of abnormal psychology}}\n{{Columns-list|colwidth=22em|\n* [[Abuse]]\n* [[Cognitive behavioral therapy]]\n* [[International Classification of Diseases]]\n* [[Insanity defense]]\n* [[Mental Health Act 1983]]\n* [[Mental Health Act 2007]]\n* [[M'Naghten Rules]]\n* [[Models of abnormality]]\n* [[Outline of psychology]]\n* [[Parapsychology]]\n* [[Seasonal affective disorder]]\n* [[Zero stroke]]\n* [[Society of Clinical Child & Adolescent Psychology]]\n* [[List of psychology organizations|List of organizations in psychology]]\n}}\n\n==Notes==\n{{Reflist}}\n\n== References ==\n{{refbegin}}\n* {{cite book | vauthors = Barlow DH, Durand VM |year=2004 |title=Abnormal Psychology: An Integrative Approach |publisher=Thomson Wadsworth |isbn=978-0-534-63362-2}}\n* {{Cite book | vauthors = Bennett P |year=2003 |title=Abnormal and Clinical Psychology |publisher=Open University Press |isbn=978-0-335-21236-1 }}\n* {{cite news | vauthors = Cherry K |date=May 9, 2016 |url=https://www.verywell.com/what-is-abnormal-psychology-2794775|title=What Is Abnormal Psychology?|work=Verywell|access-date=2017-03-10}}\n* {{cite book | vauthors = Hansell J, Damour L |year=2005 |title=Abnormal Psychology |publisher=Von Hoffman Press |isbn=978-0-471-38982-8 |url-access=registration |url=https://archive.org/details/abnormalpsycholo0000hans }}\n* {{cite journal | vauthors = Ormel J, Jeronimus BF, Kotov R, Riese H, Bos EH, Hankin B, Rosmalen JG, Oldehinkel AJ | display-authors = 6 | title = Neuroticism and common mental disorders: meaning and utility of a complex relationship | journal = Clinical Psychology Review | volume = 33 | issue = 5 | pages = 686–697 | date = July 2013 | pmid = 23702592 | pmc = 4382368 | doi = 10.1016/j.cpr.2013.04.003 }}\n{{refend}}\n\n== Further reading ==\n{{refbegin}}\n* {{cite journal | vauthors = Ahn WK, Novick LR, Kim NS | title = Understanding behavior makes it more normal | journal = Psychonomic Bulletin & Review | volume = 10 | issue = 3 | pages = 746–52 | date = September 2003 | pmid = 14620373 | pmc = 2654343 | doi = 10.3758/bf03196541 | url = https://ahnthinkinglab.yale.edu/sites/default/files/files/Papers/ahnnovickkim2003-1.pdf }}\n* {{cite journal | vauthors = Zvolensky MJ, Kotov R, Antipova AV, Schmidt NB | title = Diathesis stress model for panic-related distress: a test in a Russian epidemiological sample | journal = Behaviour Research and Therapy | volume = 43 | issue = 4 | pages = 521–32 | date = April 2005 | pmid = 15701361 | doi = 10.1016/j.brat.2004.09.001 | s2cid = 2979875 }}\n{{refend}}\n\n== External links ==\n{{Library resources box|by=no|onlinebooks=no|about=yes|wikititle=abnormal psychology}}\n* [https://web.archive.org/web/20080108152418/http://minnay.com/products/ Abnormal Psychology Students Practice Resources]\n* [https://web.archive.org/web/20170712233214/http://english4success.ru/Upload/books/1278.pdf Psychology Terms – a 600-page dictionary pdf]\n* [https://web.archive.org/web/20091202022810/http://ccvillage.buffalo.edu/Abpsy/ A Course in Abnormal Psychology]\n\n{{Psychology}}\n{{Social sciences}}\n\n{{Authority control}}\n\n{{DEFAULTSORT:Abnormal Psychology}}\n[[Category:Abnormal psychology| ]]\n[[Category:Clinical psychology]]\n[[Category:Behavioural sciences]]", "sections": [{"title": null, "content": "{{short description|Sub-discipline of psychology}}\n{{Psychology sidebar|basic}}\n'''Abnormal psychology''' is the branch of [[psychology]] that studies unusual patterns of [[behavior]], [[emotion]], and [[thought]], which could possibly be understood as a [[mental disorder]]. Although many behaviors could be considered as [[abnormality (behavior)|abnormal]], this branch of psychology typically deals with behavior in a clinical context.<ref>{{cite web | url = http://assets.pearsonglobalschools.com/asset_mgr/current/201214/PsychologyChapter5.pdf | title = Abnormal Psychology | publisher = Pearson International Schools | access-date = 2013-03-21 | archive-date = 2013-06-26 | archive-url = https://web.archive.org/web/20130626034611/http://assets.pearsonglobalschools.com/asset_mgr/current/201214/PsychologyChapter5.pdf | url-status = dead }}</ref><ref name=\"Barlow_2012\">{{cite book |title=Abnormal Psychology: An Integrative Approach | vauthors = Barlow D |publisher=Wadsworth Cengage Learning |year=2012 |isbn=978-1-111-34362-0 |location=Belmont, California, US }}</ref>{{rp|1–4}} There is a long history of attempts to understand and control behavior deemed to be aberrant or deviant (statistically, functionally, morally, or in some other sense), and there is often cultural variation in the approach taken. The field of abnormal psychology identifies multiple causes for different conditions, employing diverse theories from the general field of psychology and elsewhere, and much still hinges on what exactly is meant by \"abnormal\". There has traditionally been a divide between psychological and biological explanations, reflecting a philosophical [[Mind–body dualism|dualism]] in regard to the [[mind–body problem]]. There have also been different approaches in trying to [[Classification of mental disorders|classify mental disorders]]. Abnormal includes three different categories; they are [[wikt:subnormal|subnormal]], [[wikt:supernormal|supernormal]] and [[wikt:paranormal|paranormal]].<ref>{{cite journal |doi=10.1037/h0074965 |title=What is abnormal psychology? |year=1930 | vauthors = Bridges JW |journal=The Journal of Abnormal and Social Psychology |volume=24 |issue=4 |pages=430–2}}</ref>\n\nThe science of abnormal psychology studies two types of behaviors: adaptive and [[maladaptive behavior]]s. Behaviors that are maladaptive suggest that some problem(s) exist, and can also imply that the individual is vulnerable and cannot cope with environmental stress, which is leading them to have problems functioning in daily life in their emotions, mental thinking, physical actions and talks. Behaviors that are adaptive are ones that are well-suited to the nature of people, their lifestyles and surroundings, and to the people that they communicate with, allowing them to understand each other.<ref>{{cite book|title=Abnormal Psychology|publisher=Prentice Hall |location=US| vauthors =Sarason IG, Sarason BR |edition=6th }}{{page needed|date=October 2013}}</ref>\n\n[[Clinical psychology]] is the applied field of psychology that seeks to assess, understand, and treat psychological conditions in clinical practice. The theoretical field known as ''abnormal psychology'' may form a backdrop to such work, but clinical psychologists in the current field are unlikely to use the term ''abnormal'' in reference to their practice. [[Psychopathology]] is a similar term to abnormal psychology, but may have more of an implication of an underlying [[pathology]] (disease process), which assumes the medical model of mental disturbance and as such, is a term more commonly used in the medical specialty known as [[psychiatry]].<ref>{{cite journal | vauthors = Stanghellini G | title = Psychopathology: re-humanizing psychiatry | journal = Acta Psychiatrica Scandinavica | volume = 127 | issue = 6 | pages = 436–7 | date = June 2013 | pmid = 23663272 | doi = 10.1111/acps.12091 | doi-access = free }}</ref>\n\n"}, {"title": "History", "content": "{{Main|History of mental disorders}}\n\n=== Humors ===\n{{Main articles|Humorism|Four temperaments}}\n[[Hippocrates]] (460–377 BCE) hypothesized that the body and mind become unwell when the so-called [[Humorism|humors]], vital fluids in the body, become unbalanced. The [[four temperaments]] theory posits four such humors: black bile, yellow bile, phlegm, and blood. Each humor was associated with a particular temperament: too much phlegm causes a person to be fatigued, too much black bile causes [[melancholia]], yellow bile causes a quick temper, and too much blood causes optimism, cheerfulness, and confidence.<ref>{{Cite book | vauthors = Nevid J, Rathus S, Greene B |title=Abnormal Psychology in a changing world |publisher=Pearson |year=2018 |isbn=978-0-134-44758-2 |location=New York, NY |page=11}}</ref>\n\n===Asylums===\nThe act of placing individuals with mental illness in a separate facility known as an [[Psychiatric hospital|asylum]] dates to 1547, when [[Henry VIII|King Henry VIII of England]] established the [[Bethlem Royal Hospital|St. Mary of Bethlehem asylum]] in London. This hospital, nicknamed Bedlam, was famous for its deplorable conditions.<ref name = \"Nolen-Hoeksema_2013\">{{cite book | vauthors = Nolen-Hoeksema S | date = 2013 | title = Abnormal Psychology | edition = 6th | location = Boston | publisher = McGraw-Hill | isbn = 978-0078035388 }}</ref> Asylums remained popular throughout the [[Middle Ages]] and the [[Renaissance|Renaissance era]]. These early asylums often had miserable conditions. Patients were seen as a \"burden\" to society, locked away and treated almost like beasts to be dealt with, rather than patients needing treatment. However, many of the patients received helpful medical treatment. There was scientific curiosity into abnormal behavior, although it was rarely investigated in the early asylums. Inmates in these early asylums were often put on display for profit, as they were viewed as less than human. The early asylums were basically modifications of the existing criminal institutions.<ref name=\"Fadul_2014\">{{Cite book|title=Encyclopedia of Theory & Practice in Psychotherapy & Counseling| vauthors = Fadul JA |publisher=Lulu Press Inc.|year=2014|isbn=978-1-312-34920-9|location=Raleigh, NC|pages=3}}</ref>\n\nIn the late 18th century, the idea of humanitarian treatment for the patients gained much favor, due to the work of [[Philippe Pinel]] in France. He pushed for the idea that the patients should be treated with kindness, and not the cruelty inflicted on them, as if they were animals or criminals. His experimental ideas, such as removing the chains from the patients, were met with reluctance. The experiments in kindness proved to be a great success, which helped to bring about a reform in the way mental institutions would be run.<ref name=\"Fadul_2014\" />\n\nInstitutionalization would continue to improve throughout the 19th and 20th century, as a result of the work of many humanitarians such as [[Dorothea Dix]], and the [[Social hygiene movement|mental hygiene movement]] which promoted the physical well-being of the mental patients. \"Dix, more than any other figure in the nineteenth century, made people in America and virtually all of Europe aware that the insane were being subjected to incredible abuses.\"<ref>{{cite book | vauthors = Rimm DC, Somervill JW | title = Abnormal Psychology | location = New York | publisher = Academic Press | date = 1977 | isbn = 978-0-12-588840-0 }} {{page needed|date=May 2013}}</ref> Through this movement, millions of dollars were raised to build new institutions to house the mentally ill. Mental hospitals began to grow substantially in numbers during the 20th century, as care for the mentally ill increased in them.\n\nBy 1939, there were over 400,000 patients in state mental hospitals in the US.<ref name = Osborn>{{cite journal | vauthors = Osborn LA | title = From beauty to despair: the rise and fall of the American State Mental Hospital | journal = The Psychiatric Quarterly | volume = 80 | issue = 4 | pages = 219–31 | date = December 2009 | pmid = 19633958 | doi = 10.1007/s11126-009-9109-3 | s2cid = 11812547 }}</ref>  Hospital stays were normally quite long for the patients, with some individuals being treated for many years. These hospitals, while better than the asylums of the past, were still lacking in the means of effective treatment for the patients. Even though the reform movement had occurred, patients were often still met with cruel and inhumane treatment.\n\nThings began to change in the year 1946, when [[Mary Jane Ward]] published the influential novel titled ''The Snake Pit'', which was made into a [[The Snake Pit|popular movie of the same name]]. The book called attention to the conditions which mental patients faced, and helped to spark concern in the general public to create more humane mental health care in these overcrowded hospitals.<ref name = Osborn/>\n\nThat same year, the [[National Institute of Mental Health]] was also created, which provided support for the training of hospital employees, and research into the conditions of the patients. During this period, the [[Hill–Burton Act|Hill-Burton Acts]] was also passed, which was a program that funded mental health hospitals. Along with the Community Health Services Act of 1963, the Hill-Burton Acts helped with the creation of outpatient psychiatric clinics, inpatient general hospitals, and rehabilitation and community consultation centers.<ref name=\"Fadul_2014\" />\n\n=== Deinstitutionalisation ===\nIn the late twentieth century, however, a large number of mental hospitals were closed in many countries. In England, for example, only 14 of the 130 psychiatric institutions that had been created in the early 20th century remained open at the start of the 21st century.<ref name = Osborn/> In 1963, [[John F. Kennedy|President John F. Kennedy]] launched the community health movement in the United States as a \"bold new approach\" to mental health care, aimed at coordinating mental health services for citizens in mental health centers. In the span of 40 years, the United States was able to see an about 90 percent drop in the number of patients in psychiatric hospitals.<ref name = \"Nolen-Hoeksema_2013\" />\n\nDeinstitutionalisation ended the long-term confinement of patients in isolating mental hospitals, which could and did cause long-term negative adaptations. For instance, institutionalizing people with schizophrenia worsens [[Schizophrenia#Negative symptoms|negative symptoms]].<ref>[https://karger.com/psp/article-abstract/40/2/83/284622/Lifelong-Course-of-Positive-and-Negative-Symptoms Lifelong Course of Positive and Negative Symptoms],Branislav Mancevski; John Keilp; Matthew Kurzon; Robert M. Berman; Vladimir Ortakov; Jill Harkavy-Friedman; Gorazd Rosoklija; Andrew J. Dwork. ''Psychopathology'' (2007), vol. 40, no. 2, pp. 83-92</ref> However, the practice is sometimes criticised for a perceived rise in homelessness amongst people who were previously institutionalized, or are presumed that they would have been in the institution era.<ref>{{cite journal | vauthors = Page J, Petrovich J, Kang SY | title = Characteristics of homeless adults with serious mental illnesses served by three street-level federally funded homelessness programs | journal = Community Mental Health Journal | volume = 48 | issue = 6 | pages = 699–704 | date = December 2012 | pmid = 22370894 | doi = 10.1007/s10597-011-9473-y | s2cid = 27447526 }}</ref><ref>{{cite book | vauthors = Jones BE | title = Treating the Homeless: Urban Psychiatry's Challenge. | location = Washington, D.C. | publisher = American Psychiatric Press | date = 1986 | isbn = 978-0-88048-080-2 }} {{page needed|date=October 2013}}</ref>\n\n"}, {"title": " Humors ", "content": "{{Main articles|Humorism|Four temperaments}}\n[[Hippocrates]] (460–377 BCE) hypothesized that the body and mind become unwell when the so-called [[Humorism|humors]], vital fluids in the body, become unbalanced. The [[four temperaments]] theory posits four such humors: black bile, yellow bile, phlegm, and blood. Each humor was associated with a particular temperament: too much phlegm causes a person to be fatigued, too much black bile causes [[melancholia]], yellow bile causes a quick temper, and too much blood causes optimism, cheerfulness, and confidence.<ref>{{Cite book | vauthors = Nevid J, Rathus S, Greene B |title=Abnormal Psychology in a changing world |publisher=Pearson |year=2018 |isbn=978-0-134-44758-2 |location=New York, NY |page=11}}</ref>\n\n"}, {"title": "Asylums", "content": "The act of placing individuals with mental illness in a separate facility known as an [[Psychiatric hospital|asylum]] dates to 1547, when [[Henry VIII|King Henry VIII of England]] established the [[Bethlem Royal Hospital|St. Mary of Bethlehem asylum]] in London. This hospital, nicknamed Bedlam, was famous for its deplorable conditions.<ref name = \"Nolen-Hoeksema_2013\">{{cite book | vauthors = Nolen-Hoeksema S | date = 2013 | title = Abnormal Psychology | edition = 6th | location = Boston | publisher = McGraw-Hill | isbn = 978-0078035388 }}</ref> Asylums remained popular throughout the [[Middle Ages]] and the [[Renaissance|Renaissance era]]. These early asylums often had miserable conditions. Patients were seen as a \"burden\" to society, locked away and treated almost like beasts to be dealt with, rather than patients needing treatment. However, many of the patients received helpful medical treatment. There was scientific curiosity into abnormal behavior, although it was rarely investigated in the early asylums. Inmates in these early asylums were often put on display for profit, as they were viewed as less than human. The early asylums were basically modifications of the existing criminal institutions.<ref name=\"Fadul_2014\">{{Cite book|title=Encyclopedia of Theory & Practice in Psychotherapy & Counseling| vauthors = Fadul JA |publisher=Lulu Press Inc.|year=2014|isbn=978-1-312-34920-9|location=Raleigh, NC|pages=3}}</ref>\n\nIn the late 18th century, the idea of humanitarian treatment for the patients gained much favor, due to the work of [[Philippe Pinel]] in France. He pushed for the idea that the patients should be treated with kindness, and not the cruelty inflicted on them, as if they were animals or criminals. His experimental ideas, such as removing the chains from the patients, were met with reluctance. The experiments in kindness proved to be a great success, which helped to bring about a reform in the way mental institutions would be run.<ref name=\"Fadul_2014\" />\n\nInstitutionalization would continue to improve throughout the 19th and 20th century, as a result of the work of many humanitarians such as [[Dorothea Dix]], and the [[Social hygiene movement|mental hygiene movement]] which promoted the physical well-being of the mental patients. \"Dix, more than any other figure in the nineteenth century, made people in America and virtually all of Europe aware that the insane were being subjected to incredible abuses.\"<ref>{{cite book | vauthors = Rimm DC, Somervill JW | title = Abnormal Psychology | location = New York | publisher = Academic Press | date = 1977 | isbn = 978-0-12-588840-0 }} {{page needed|date=May 2013}}</ref> Through this movement, millions of dollars were raised to build new institutions to house the mentally ill. Mental hospitals began to grow substantially in numbers during the 20th century, as care for the mentally ill increased in them.\n\nBy 1939, there were over 400,000 patients in state mental hospitals in the US.<ref name = Osborn>{{cite journal | vauthors = Osborn LA | title = From beauty to despair: the rise and fall of the American State Mental Hospital | journal = The Psychiatric Quarterly | volume = 80 | issue = 4 | pages = 219–31 | date = December 2009 | pmid = 19633958 | doi = 10.1007/s11126-009-9109-3 | s2cid = 11812547 }}</ref>  Hospital stays were normally quite long for the patients, with some individuals being treated for many years. These hospitals, while better than the asylums of the past, were still lacking in the means of effective treatment for the patients. Even though the reform movement had occurred, patients were often still met with cruel and inhumane treatment.\n\nThings began to change in the year 1946, when [[Mary Jane Ward]] published the influential novel titled ''The Snake Pit'', which was made into a [[The Snake Pit|popular movie of the same name]]. The book called attention to the conditions which mental patients faced, and helped to spark concern in the general public to create more humane mental health care in these overcrowded hospitals.<ref name = Osborn/>\n\nThat same year, the [[National Institute of Mental Health]] was also created, which provided support for the training of hospital employees, and research into the conditions of the patients. During this period, the [[Hill–Burton Act|Hill-Burton Acts]] was also passed, which was a program that funded mental health hospitals. Along with the Community Health Services Act of 1963, the Hill-Burton Acts helped with the creation of outpatient psychiatric clinics, inpatient general hospitals, and rehabilitation and community consultation centers.<ref name=\"Fadul_2014\" />\n\n"}, {"title": " Deinstitutionalisation ", "content": "In the late twentieth century, however, a large number of mental hospitals were closed in many countries. In England, for example, only 14 of the 130 psychiatric institutions that had been created in the early 20th century remained open at the start of the 21st century.<ref name = Osborn/> In 1963, [[John F. Kennedy|President John F. Kennedy]] launched the community health movement in the United States as a \"bold new approach\" to mental health care, aimed at coordinating mental health services for citizens in mental health centers. In the span of 40 years, the United States was able to see an about 90 percent drop in the number of patients in psychiatric hospitals.<ref name = \"Nolen-Hoeksema_2013\" />\n\nDeinstitutionalisation ended the long-term confinement of patients in isolating mental hospitals, which could and did cause long-term negative adaptations. For instance, institutionalizing people with schizophrenia worsens [[Schizophrenia#Negative symptoms|negative symptoms]].<ref>[https://karger.com/psp/article-abstract/40/2/83/284622/Lifelong-Course-of-Positive-and-Negative-Symptoms Lifelong Course of Positive and Negative Symptoms],Branislav Mancevski; John Keilp; Matthew Kurzon; Robert M. Berman; Vladimir Ortakov; Jill Harkavy-Friedman; Gorazd Rosoklija; Andrew J. Dwork. ''Psychopathology'' (2007), vol. 40, no. 2, pp. 83-92</ref> However, the practice is sometimes criticised for a perceived rise in homelessness amongst people who were previously institutionalized, or are presumed that they would have been in the institution era.<ref>{{cite journal | vauthors = Page J, Petrovich J, Kang SY | title = Characteristics of homeless adults with serious mental illnesses served by three street-level federally funded homelessness programs | journal = Community Mental Health Journal | volume = 48 | issue = 6 | pages = 699–704 | date = December 2012 | pmid = 22370894 | doi = 10.1007/s10597-011-9473-y | s2cid = 27447526 }}</ref><ref>{{cite book | vauthors = Jones BE | title = Treating the Homeless: Urban Psychiatry's Challenge. | location = Washington, D.C. | publisher = American Psychiatric Press | date = 1986 | isbn = 978-0-88048-080-2 }} {{page needed|date=October 2013}}</ref>\n\n"}, {"title": "Explaining abnormal behaviour", "content": "\nPeople have tried to explain and control abnormal behavior for thousands of years. Historically, there have been [[Biopsychiatry controversy|three main approaches]] to abnormal behavior: the [[supernatural]], [[biological]], and [[psychological]] traditions.<ref name = \"Barlow_2012\" />{{rp|7}} Abnormal psychology revolves around two major [[paradigm]]s for explaining mental disorders, the ''psychological'' paradigm and the ''biological'' paradigm. The psychological paradigm focuses more on the humanistic, cognitive, and behavioral causes and effects of psychopathology. The biological paradigm includes theories that focus more on physical factors, such as [[genetics]] and [[neurochemistry]].\n\n===Supernatural explanations===\nIn the first supernatural tradition, also called the demonological method, abnormal behaviors are attributed to agents outside human bodies. According to this model, abnormal behaviors are caused by [[demon]]s, [[Extraterrestrial life|aliens]], or spirits, or the influences of the [[Moon]], planets, and stars. During the Stone Age, [[trepanning]] was performed on those who had [[Mental disorder|mental illness]], to literally cut the evil spirits out of the victim's head. Conversely, [[History of China|Ancient Chinese]], [[Ancient Egypt]]ians, and [[Hebrews]] believed that these were evil demons or spirits and advocated [[exorcism]]. By the time of the [[Ancient Greeks|Greeks]] and [[Ancient Romans|Romans]], mental illnesses were thought to be caused by an imbalance of the [[four humors]] which lead treatments like the draining of fluids from the [[brain]]. During the [[Medieval]] period, many Europeans believed that the power of [[Witchcraft|witches]], demons, and spirits caused abnormal behaviors. People with psychological disorders were thought to be possessed by evil spirits that had to be exorcised through [[Religion|religious]] rituals. If exorcism failed, some authorities advocated steps such as confinement, beating, and other types of [[torture]] to make the body uninhabitable to witches, demons, and spirits. The belief that witches, demons, and spirits are responsible for the abnormal behavior continued into the 15th century.<ref name = \"Barlow_2012\" />{{rp|8}} Swiss [[Alchemy|alchemist]], astrologer, and [[physician]] [[Paracelsus]] (1493–1541), on the other hand, rejected the idea that abnormal behaviors were caused by [[witches]], demons, and spirits and suggested that people's mind and behaviors were influenced by the movements of the moon and stars.<ref name = \"Barlow_2012\" />{{rp|11}} This tradition is still alive today. Some people, especially in the developing countries, as well as some followers of religious [[sect]]s in the developed countries, continue to believe that [[supernatural]] powers influence human behaviors. In Western [[academia]], the supernatural tradition has been largely replaced by the biological and psychological traditions.<ref name = \"Barlow_2012\" />{{rp|26}}\n\n'''Supernatural traditions'''\n\nThroughout time, societies have proposed several explanations of abnormal behavior within human beings. Beginning in some hunter-gatherer societies, [[Animism|animists]] have believed that people demonstrating abnormal behavior are possessed by [[Vengeful ghost|malevolent spirits]]. This idea has been associated with [[Trepanning|trepanation]], the practice of cutting a hole into the individual's skull in order to release the malevolent spirits.<ref>{{Harvnb|Hansell|Damour|2005|pp=Ch 3. pp. 30–33}}</ref> Although it has been difficult to define abnormal psychology, one definition includes characteristics such as statistical infrequency.<ref>{{cite book|title=Abnormal Psychology|vauthors=Davison GC|publisher=Veronica Visentin|year=2008|isbn=978-0-470-84072-6|location=Toronto|pages=3}}</ref>\n\nA more formalized response to spiritual beliefs about abnormality is the practice of exorcism. Performed by religious authorities, exorcism is thought of as another way to release evil spirits who cause pathological behavior within the person. In some instances, individuals exhibiting unusual thoughts or behaviors have been [[exile]]d from society, or worse. Perceived witchcraft, for example, has been punished by death. Two Catholic Inquisitors wrote the ''[[Malleus Maleficarum]]'' (Latin for \"The Hammer Against Witches\"), which was used by many Inquisitors and witch-hunters. It contained an early taxonomy of perceived deviant behavior, and proposed guidelines for prosecuting deviant individuals.<ref>{{Cite journal| vauthors = Herzig T |date=2010|title=Malleus maleficarum (review) |url= http://muse.jhu.edu/content/crossref/journals/magic_ritual_and_witchcraft/v005/5.1.herzig.html |journal=Magic, Ritual, and Witchcraft|language=en|volume=5|issue=1|pages=135–138|doi=10.1353/mrw.0.0161|s2cid=161336612|issn=1940-5111}}</ref>\n\n===Biological explanations===\nIn the biological tradition, psychological disorders are attributed to biological causes. In the psychological tradition, disorders are attributed to faulty [[Developmental psychology|psychological development]], and to [[Social environment|social context]].<ref name = \"Barlow_2012\" />{{rp|26}} The medical or biological perspective holds the belief that most or all abnormal behavior can be attributed to a medical factor; assuming all psychological disorders are diseases.<ref name=\"Purgatory Perspectives: Medical\">{{cite web|title=Perspectives: Medical|url=http://www.purgatory.net/merits/medical.htm | work = A Beginner's Guide to Abnormal Psychology }}</ref>\n\nThe Greek physician [[Hippocrates]], who is considered to be the father of Western medicine, played a major role in the biological tradition. Hippocrates and his associates wrote the [[Hippocratic Corpus]] between 450 and 350 BC, in which they suggested that abnormal behaviors can be treated like any other disease. Hippocrates viewed the brain as the seat of [[consciousness]], [[emotion]], [[intelligence]], and [[wisdom]] and believed that disorders involving these functions would logically be located in the brain.<ref name = \"Barlow_2012\" />{{rp|11}}\n\nThese ideas of Hippocrates and his associates were later adopted by [[Galen]], the [[Ancient Rome|Roman]] physician. [[Galen]] extended these ideas and developed a strong and influential school of thought within the biological tradition that extended well into the 18th century.\n\nKendra Cherry, MSEd, states: \"The medical approach to abnormal psychology focuses on the biological causes of mental illness. This perspective emphasizes understanding the underlying cause of disorders, which might include genetic inheritance, related physical disorders, infections, and chemical imbalances. Medical treatments are often pharmacological in nature, although medication is often used in conjunction with some other type of psychotherapy.\"<ref>{{Cite news|url=https://www.verywell.com/what-is-abnormal-psychology-2794775|title=What Is Abnormal Psychology?| vauthors = Cherry K |date=May 9, 2016|work=Verywell|access-date=2017-03-10}}</ref>\n\n===Psychological explanations===\n\nAccording to Sigmund Freud's [[Id, ego and super-ego|structural model]], the id, ego, and superego are three theoretical constructs that define the way an individual interacts with the external world, as well as responding to internal forces<ref name=\"Boag_2014\">{{cite journal | vauthors = Boag S | title = Ego, drives, and the dynamics of internal objects | journal = Frontiers in Psychology | volume = 5 | issue = 5 | pages = 666 | date = July 1, 2014 | pmid = 25071640 | pmc = 4076885 | doi = 10.3389/fpsyg.2014.00666 | doi-access = free }}</ref> The Id represents the instinctual drives of an individual that remain unconscious. The super-ego represents a person's conscience and their internalization of societal norms and morality. Finally, the ego serves to realistically integrate the drives of the id with the prohibitions of the super-ego. Lack of development in the Superego, or an incoherently developed Superego within an individual, will result in thoughts and actions that are irrational and abnormal, contrary to the norms and beliefs of society.<ref name=\"Boag_2014\" />\n\n====Irrational beliefs====\nIrrational beliefs are driven by unconscious fears and can result in abnormal behavior.<ref name=\"Turner_2016\">{{cite journal | vauthors = Turner MJ | title = Rational Emotive Behavior Therapy (REBT), Irrational and Rational Beliefs, and the Mental Health of Athletes | journal = Frontiers in Psychology | volume = 7 | pages = 1423 | date = 2016-09-20 | pmid = 27703441 | pmc = 5028385 | doi = 10.3389/fpsyg.2016.01423 | doi-access = free }}</ref> [[Rational emotive behavior therapy]] helps to drive irrational and maladaptive beliefs out of one's mind.<ref name=\"Turner_2016\" />\n\n==== Sociocultural influences====\nThe term sociocultural refers to the various circles of influence on the individual, ranging from close friends and family, to the institutions and policies of a country, or the world as a whole. Discriminations, whether based on social class, income, race and ethnicity, or gender, can influence the development of abnormal behaviour.<ref>{{cite book | vauthors = Whitbourne SK, Halgin RP |title=Abnormal Psychology: Clinical Perspectives on Psychological Disorders |date=2013 |publisher=McGraw-Hill Higher Education |location=New York, NY |isbn=978-0-07-803527-2 |edition=7th}}</ref>\n\n===Multiple causality===\nThe number of different theoretical perspectives in the field of psychological abnormality has made it difficult to properly explain psychopathology. The attempt to explain all mental disorders with the same theory leads to [[reductionism]] (explaining a disorder or other complex phenomena using only a single idea or perspective).<ref name = \"Hansell_2005_37\">{{Harvnb|Hansell|Damour|2005|pp=Ch 3. pp. 37}}</ref> Most mental disorders are composed of several factors, which is why one must take into account several theoretical perspectives, when attempting to diagnose or explain a particular behavioral abnormality or mental disorder. Explaining mental disorders with a combination of theoretical perspectives is known as multiple causality.\n\nThe [[diathesis–stress model]]<ref>{{cite journal | vauthors = Zvolensky MJ, Kotov R, Antipova AV, Schmidt NB | title = Diathesis stress model for panic-related distress: a test in a Russian epidemiological sample | journal = Behaviour Research and Therapy | volume = 43 | issue = 4 | pages = 521–32 | date = April 2005 | pmid = 15701361 | doi = 10.1016/j.brat.2004.09.001 | s2cid = 2979875 }}</ref> emphasizes the importance of applying multiple causality to psychopathology, by stressing that disorders are caused by both precipitating causes, and predisposing causes. A precipitating cause is an immediate trigger that instigates a person's action or behavior. A predisposing cause is an underlying factor that interacts with the immediate factors to result in a disorder. Both causes play a key role in the development of a psychological disorder.<ref name = \"Hansell_2005_37\" /> For example, high neuroticism antedates most types of psychopathology.<ref name=\"NeuroticismMA\">{{cite journal | vauthors = Jeronimus BF, Kotov R, Riese H, Ormel J | title = Neuroticism's prospective association with mental disorders halves after adjustment for baseline symptoms and psychiatric history, but the adjusted association hardly decays with time: a meta-analysis on 59 longitudinal/prospective studies with 443 313 participants | journal = Psychological Medicine | volume = 46 | issue = 14 | pages = 2883–2906 | date = October 2016 | pmid = 27523506 | doi = 10.1017/S0033291716001653 | s2cid = 23548727 | url = https://zenodo.org/record/895885 }}</ref>\n\n===Recent concepts of abnormality===\n* ''Statistical abnormality''<ref>{{Cite web |last=Gilles-Thomas |first=David L. |date=1989 |title=Definitions of Abnormality |url=https://www.acsu.buffalo.edu/~dgthomas/Abpsy/lecture1.html |access-date=2022-06-05 |website=[[University of Buffalo]]}}</ref> – when a certain behavior/characteristic is relevant to a low percentage of the population. However, this does not necessarily mean that such individuals have mental illness (for example, statistical abnormalities such as extreme wealth/attractiveness)\n* ''Psychometric abnormality'' – [[Psychometrics|Psychometric]] abnormality implicates abnormality as a deviation from a statistically determined norm, such as the population average IQ of 100. In this case, an IQ score less than about 70–75 may define someone as having a learning disability, and suggests they will have some difficulties coping with life. However, the problems associated with a low IQ differ widely across individuals depending on their life circumstances. So, even when an individual is defined as psycho-metrically 'abnormal', this tells us little about their actual condition or problems. Furthermore, if one takes the other end of the IQ spectrum, a deviation of 30 points above the mean is generally not considered to be abnormal, or to indicate the presence of mental health problems.\n* ''Deviant behavior'' – this is not always a sign of mental illness, as mental illness can occur without deviant behavior, and such behavior may occur in the absence of mental illness.\n* ''Combinations'' – including distress, dysfunction, distorted psychological processes, inappropriate responses in given situations, and causing/risking harm to oneself.<ref>{{Harvnb|Bennett|2003|pp=3–5}}</ref>\n\n==== Examples ====\nThere is a wide range of [[mental disorder]]s that are considered to be forms of Abnormal Psychology. These include, but are not limited to:\n\n'''Schizophrenia'''\n\n[[Schizophrenia]] can be described as a disorder that causes extreme loss of touch with reality. The [[Psychosis|Psychotic]] nature of schizophrenia manifests itself through [[delusion]]s, as well as auditory and visual [[hallucination]]s. Schizophrenia is known to have a genetic etiology, as well as other biological components, such as brain disruptions in the prenatal development period.<ref name = \"Phares_2014\">{{cite book| vauthors = Phares V |title=Understanding abnormal Child Psychology|publisher=Wiley|location=Haboken NJ }}</ref>{{rp|323–326}}\n\n'''Attention deficit hyperactivity disorder'''\n\n[[Attention deficit hyperactivity disorder]] (ADHD) is characterized by high amounts of inattention and hyperactive impulsiveness. Inattentive symptoms include not listening, careless errors, disorganization, losing personal belongings, becoming easily distracted, and forgetfulness. Symptoms of hyperactive impulsiveness include fidgeting, talking excessively, and interrupting others.<ref name = \"Phares_2014\" />{{rp|225–253}}\n\n'''Antisocial personality disorder'''\n\n[[Antisocial personality disorder]] can be described as a cluster of personality traits that lead to specific outcomes, and violate the rights of other people. These personality traits include callousness, deceitfulness, lack of remorse, apathy, manipulation of others, impulsiveness, and grandiosity.<ref name=\"Sánchez_de_Ribera_2019\">{{Cite journal| vauthors = Sánchez de Ribera O, Kavish N, Katz IM, Boutwell BB, Back M |date= September 2019 |title=Untangling Intelligence, Psychopathy, Antisocial Personality Disorder, and Conduct Problems: A Meta–Analytic Review |journal=European Journal of Personality|language=en|volume=33|issue=5|pages=529–564|doi=10.1002/per.2207|s2cid=202253144|issn=0890-2070}}</ref> Additional traits may include superficial charm, sexual promiscuity, and pathological lying.<ref name=\"Sánchez_de_Ribera_2019\" />\n\n'''Dissociative identity disorder'''\n\n[[Dissociative identity disorder]] (DID) involves one individual having multiple personalities. Those with DID are described as having multiple selves that each have their own consciousness and awareness.<ref name=\"Boysen_2013\">{{cite journal | vauthors = Boysen GA, VanBergen A | title = A review of published research on adult dissociative identity disorder: 2000-2010 | journal = The Journal of Nervous and Mental Disease | volume = 201 | issue = 1 | pages = 5–11 | date = January 2013 | pmid = 23274288 | doi = 10.1097/NMD.0b013e31827aaf81 | s2cid = 25189072 }}</ref>\n\nDID has two main etiologies, which are the post-traumatic and socio-cognitive models.<ref name=\"Boysen_2013\" /> The post-traumatic model states that DID is caused by inescapable past trauma, such as child abuse. The child dissociates and forms alternate personalities as a coping mechanism, in response to the current trauma. Even when the trauma ends, the personalities continue to disrupt the person's life longterm. The socio-cognitive model states that people will implicitly act as if they have multiple personalities and that it is done to align with cultural norms.<ref name=\"Boysen_2013\" />\n\n'''Social anxiety disorder'''\n\nThose with [[social anxiety disorder]] (SAD) have a very intense fear of social situations. This fear stems from the belief that the person will be evaluated negatively or embarrass themselves.<ref name=\"McEnery_2019\">{{cite journal | vauthors = McEnery C, Lim MH, Tremain H, Knowles A, Alvarez-Jimenez M | title = Prevalence rate of social anxiety disorder in individuals with a psychotic disorder: A systematic review and meta-analysis | journal = Schizophrenia Research | volume = 208 | pages = 25–33 | date = June 2019 | pmid = 30722947 | doi = 10.1016/j.schres.2019.01.045 | s2cid = 73425627 }}</ref>\n\nSAD is also considered to be one of the more disabling mental disorders. Symptoms of this disorder include fear in most, if not all, social situations.<ref name=\"McEnery_2019\" /> SAD can develop after a traumatic and/or embarrassing experience has occurred while the person was being observed by other people.<ref name = \"Phares_2014\" />{{rp|200–202}}\n\n'''Generalized anxiety disorder'''\n\n[[Generalized anxiety disorder]] is characterized by a constant, chronic state of worry and anxiety that is related to a large variety of situations, and is difficult to control. Additional symptoms may include irritability, fatigue, concentration difficulties, and restlessness.<ref>{{cite journal | vauthors = Tyrer P, Baldwin D | title = Generalised anxiety disorder | journal = Lancet | volume = 368 | issue = 9553 | pages = 2156–66 | date = December 2006 | pmid = 17174708 | doi = 10.1016/S0140-6736(06)69865-6 | s2cid = 18959359 }}</ref>\n\n'''Specific phobia'''\n\nIndividuals with [[specific phobia]]s have an extreme fear and avoidance of various objects or situations.<ref name=\"Ipser_2013\">{{cite journal | vauthors = Ipser JC, Singh L, Stein DJ | title = Meta-analysis of functional brain imaging in specific phobia | journal = Psychiatry and Clinical Neurosciences | volume = 67 | issue = 5 | pages = 311–22 | date = July 2013 | pmid = 23711114 | doi = 10.1111/pcn.12055 | s2cid = 46155186 | doi-access = free }}</ref> Specifically, fears become phobias when there is excessive and unreasonable fear that is disproportionate to the culture that the individual is in.<ref name = \"Phares_2014\" />{{rp|199–200}} Examples of specific phobias include, but are not limited to, phobias of school, [[Blood phobia|blood]], [[Traumatophobia|injury]], [[Fear of needles|needles]], small animals, and [[Acrophobia|heights]].<ref name=\"Ipser_2013\" />\n\n'''Post-traumatic stress disorder'''\n\n[[Post-traumatic stress disorder]] (PTSD) is described as physical and mental distress related to past traumatic experiences. PTSD can manifest a large variety of symptoms, including, but not limited to, nightmares, flashbacks, avoidance and/or physiological reactions related to stimuli regarding the trauma, shame, guilt, anger, hypervigilance, and social withdrawal.<ref name=\"Kube_2020\">{{cite journal | vauthors = Kube T, Berg M, Kleim B, Herzog P | title = Rethinking post-traumatic stress disorder - A predictive processing perspective | journal = Neuroscience and Biobehavioral Reviews | volume = 113 | pages = 448–460 | date = June 2020 | pmid = 32315695 | doi = 10.1016/j.neubiorev.2020.04.014 | s2cid = 215814023 }}</ref>\n\nPTSD symptoms can arise due to various experiences that involve actual or threatened violence, injury, or death. Firsthand experience, witnessing, or learning about traumatic experiences can possibly lead to the development of PTSD.<ref name=\"Kube_2020\" />\n\n"}, {"title": "Supernatural explanations", "content": "In the first supernatural tradition, also called the demonological method, abnormal behaviors are attributed to agents outside human bodies. According to this model, abnormal behaviors are caused by [[demon]]s, [[Extraterrestrial life|aliens]], or spirits, or the influences of the [[Moon]], planets, and stars. During the Stone Age, [[trepanning]] was performed on those who had [[Mental disorder|mental illness]], to literally cut the evil spirits out of the victim's head. Conversely, [[History of China|Ancient Chinese]], [[Ancient Egypt]]ians, and [[Hebrews]] believed that these were evil demons or spirits and advocated [[exorcism]]. By the time of the [[Ancient Greeks|Greeks]] and [[Ancient Romans|Romans]], mental illnesses were thought to be caused by an imbalance of the [[four humors]] which lead treatments like the draining of fluids from the [[brain]]. During the [[Medieval]] period, many Europeans believed that the power of [[Witchcraft|witches]], demons, and spirits caused abnormal behaviors. People with psychological disorders were thought to be possessed by evil spirits that had to be exorcised through [[Religion|religious]] rituals. If exorcism failed, some authorities advocated steps such as confinement, beating, and other types of [[torture]] to make the body uninhabitable to witches, demons, and spirits. The belief that witches, demons, and spirits are responsible for the abnormal behavior continued into the 15th century.<ref name = \"Barlow_2012\" />{{rp|8}} Swiss [[Alchemy|alchemist]], astrologer, and [[physician]] [[Paracelsus]] (1493–1541), on the other hand, rejected the idea that abnormal behaviors were caused by [[witches]], demons, and spirits and suggested that people's mind and behaviors were influenced by the movements of the moon and stars.<ref name = \"Barlow_2012\" />{{rp|11}} This tradition is still alive today. Some people, especially in the developing countries, as well as some followers of religious [[sect]]s in the developed countries, continue to believe that [[supernatural]] powers influence human behaviors. In Western [[academia]], the supernatural tradition has been largely replaced by the biological and psychological traditions.<ref name = \"Barlow_2012\" />{{rp|26}}\n\n'''Supernatural traditions'''\n\nThroughout time, societies have proposed several explanations of abnormal behavior within human beings. Beginning in some hunter-gatherer societies, [[Animism|animists]] have believed that people demonstrating abnormal behavior are possessed by [[Vengeful ghost|malevolent spirits]]. This idea has been associated with [[Trepanning|trepanation]], the practice of cutting a hole into the individual's skull in order to release the malevolent spirits.<ref>{{Harvnb|Hansell|Damour|2005|pp=Ch 3. pp. 30–33}}</ref> Although it has been difficult to define abnormal psychology, one definition includes characteristics such as statistical infrequency.<ref>{{cite book|title=Abnormal Psychology|vauthors=Davison GC|publisher=Veronica Visentin|year=2008|isbn=978-0-470-84072-6|location=Toronto|pages=3}}</ref>\n\nA more formalized response to spiritual beliefs about abnormality is the practice of exorcism. Performed by religious authorities, exorcism is thought of as another way to release evil spirits who cause pathological behavior within the person. In some instances, individuals exhibiting unusual thoughts or behaviors have been [[exile]]d from society, or worse. Perceived witchcraft, for example, has been punished by death. Two Catholic Inquisitors wrote the ''[[Malleus Maleficarum]]'' (Latin for \"The Hammer Against Witches\"), which was used by many Inquisitors and witch-hunters. It contained an early taxonomy of perceived deviant behavior, and proposed guidelines for prosecuting deviant individuals.<ref>{{Cite journal| vauthors = Herzig T |date=2010|title=Malleus maleficarum (review) |url= http://muse.jhu.edu/content/crossref/journals/magic_ritual_and_witchcraft/v005/5.1.herzig.html |journal=Magic, Ritual, and Witchcraft|language=en|volume=5|issue=1|pages=135–138|doi=10.1353/mrw.0.0161|s2cid=161336612|issn=1940-5111}}</ref>\n\n"}, {"title": "Biological explanations", "content": "In the biological tradition, psychological disorders are attributed to biological causes. In the psychological tradition, disorders are attributed to faulty [[Developmental psychology|psychological development]], and to [[Social environment|social context]].<ref name = \"Barlow_2012\" />{{rp|26}} The medical or biological perspective holds the belief that most or all abnormal behavior can be attributed to a medical factor; assuming all psychological disorders are diseases.<ref name=\"Purgatory Perspectives: Medical\">{{cite web|title=Perspectives: Medical|url=http://www.purgatory.net/merits/medical.htm | work = A Beginner's Guide to Abnormal Psychology }}</ref>\n\nThe Greek physician [[Hippocrates]], who is considered to be the father of Western medicine, played a major role in the biological tradition. Hippocrates and his associates wrote the [[Hippocratic Corpus]] between 450 and 350 BC, in which they suggested that abnormal behaviors can be treated like any other disease. Hippocrates viewed the brain as the seat of [[consciousness]], [[emotion]], [[intelligence]], and [[wisdom]] and believed that disorders involving these functions would logically be located in the brain.<ref name = \"Barlow_2012\" />{{rp|11}}\n\nThese ideas of Hippocrates and his associates were later adopted by [[Galen]], the [[Ancient Rome|Roman]] physician. [[Galen]] extended these ideas and developed a strong and influential school of thought within the biological tradition that extended well into the 18th century.\n\nKendra Cherry, MSEd, states: \"The medical approach to abnormal psychology focuses on the biological causes of mental illness. This perspective emphasizes understanding the underlying cause of disorders, which might include genetic inheritance, related physical disorders, infections, and chemical imbalances. Medical treatments are often pharmacological in nature, although medication is often used in conjunction with some other type of psychotherapy.\"<ref>{{Cite news|url=https://www.verywell.com/what-is-abnormal-psychology-2794775|title=What Is Abnormal Psychology?| vauthors = Cherry K |date=May 9, 2016|work=Verywell|access-date=2017-03-10}}</ref>\n\n"}, {"title": "Psychological explanations", "content": "\nAccording to Sigmund Freud's [[Id, ego and super-ego|structural model]], the id, ego, and superego are three theoretical constructs that define the way an individual interacts with the external world, as well as responding to internal forces<ref name=\"Boag_2014\">{{cite journal | vauthors = Boag S | title = Ego, drives, and the dynamics of internal objects | journal = Frontiers in Psychology | volume = 5 | issue = 5 | pages = 666 | date = July 1, 2014 | pmid = 25071640 | pmc = 4076885 | doi = 10.3389/fpsyg.2014.00666 | doi-access = free }}</ref> The Id represents the instinctual drives of an individual that remain unconscious. The super-ego represents a person's conscience and their internalization of societal norms and morality. Finally, the ego serves to realistically integrate the drives of the id with the prohibitions of the super-ego. Lack of development in the Superego, or an incoherently developed Superego within an individual, will result in thoughts and actions that are irrational and abnormal, contrary to the norms and beliefs of society.<ref name=\"Boag_2014\" />\n\n====Irrational beliefs====\nIrrational beliefs are driven by unconscious fears and can result in abnormal behavior.<ref name=\"Turner_2016\">{{cite journal | vauthors = Turner MJ | title = Rational Emotive Behavior Therapy (REBT), Irrational and Rational Beliefs, and the Mental Health of Athletes | journal = Frontiers in Psychology | volume = 7 | pages = 1423 | date = 2016-09-20 | pmid = 27703441 | pmc = 5028385 | doi = 10.3389/fpsyg.2016.01423 | doi-access = free }}</ref> [[Rational emotive behavior therapy]] helps to drive irrational and maladaptive beliefs out of one's mind.<ref name=\"Turner_2016\" />\n\n==== Sociocultural influences====\nThe term sociocultural refers to the various circles of influence on the individual, ranging from close friends and family, to the institutions and policies of a country, or the world as a whole. Discriminations, whether based on social class, income, race and ethnicity, or gender, can influence the development of abnormal behaviour.<ref>{{cite book | vauthors = Whitbourne SK, Halgin RP |title=Abnormal Psychology: Clinical Perspectives on Psychological Disorders |date=2013 |publisher=McGraw-Hill Higher Education |location=New York, NY |isbn=978-0-07-803527-2 |edition=7th}}</ref>\n\n"}, {"title": "Irrational beliefs", "content": "Irrational beliefs are driven by unconscious fears and can result in abnormal behavior.<ref name=\"Turner_2016\">{{cite journal | vauthors = Turner MJ | title = Rational Emotive Behavior Therapy (REBT), Irrational and Rational Beliefs, and the Mental Health of Athletes | journal = Frontiers in Psychology | volume = 7 | pages = 1423 | date = 2016-09-20 | pmid = 27703441 | pmc = 5028385 | doi = 10.3389/fpsyg.2016.01423 | doi-access = free }}</ref> [[Rational emotive behavior therapy]] helps to drive irrational and maladaptive beliefs out of one's mind.<ref name=\"Turner_2016\" />\n\n"}, {"title": " Sociocultural influences", "content": "The term sociocultural refers to the various circles of influence on the individual, ranging from close friends and family, to the institutions and policies of a country, or the world as a whole. Discriminations, whether based on social class, income, race and ethnicity, or gender, can influence the development of abnormal behaviour.<ref>{{cite book | vauthors = Whitbourne SK, Halgin RP |title=Abnormal Psychology: Clinical Perspectives on Psychological Disorders |date=2013 |publisher=McGraw-Hill Higher Education |location=New York, NY |isbn=978-0-07-803527-2 |edition=7th}}</ref>\n\n"}, {"title": "Multiple causality", "content": "The number of different theoretical perspectives in the field of psychological abnormality has made it difficult to properly explain psychopathology. The attempt to explain all mental disorders with the same theory leads to [[reductionism]] (explaining a disorder or other complex phenomena using only a single idea or perspective).<ref name = \"Hansell_2005_37\">{{Harvnb|Hansell|Damour|2005|pp=Ch 3. pp. 37}}</ref> Most mental disorders are composed of several factors, which is why one must take into account several theoretical perspectives, when attempting to diagnose or explain a particular behavioral abnormality or mental disorder. Explaining mental disorders with a combination of theoretical perspectives is known as multiple causality.\n\nThe [[diathesis–stress model]]<ref>{{cite journal | vauthors = Zvolensky MJ, Kotov R, Antipova AV, Schmidt NB | title = Diathesis stress model for panic-related distress: a test in a Russian epidemiological sample | journal = Behaviour Research and Therapy | volume = 43 | issue = 4 | pages = 521–32 | date = April 2005 | pmid = 15701361 | doi = 10.1016/j.brat.2004.09.001 | s2cid = 2979875 }}</ref> emphasizes the importance of applying multiple causality to psychopathology, by stressing that disorders are caused by both precipitating causes, and predisposing causes. A precipitating cause is an immediate trigger that instigates a person's action or behavior. A predisposing cause is an underlying factor that interacts with the immediate factors to result in a disorder. Both causes play a key role in the development of a psychological disorder.<ref name = \"Hansell_2005_37\" /> For example, high neuroticism antedates most types of psychopathology.<ref name=\"NeuroticismMA\">{{cite journal | vauthors = Jeronimus BF, Kotov R, Riese H, Ormel J | title = Neuroticism's prospective association with mental disorders halves after adjustment for baseline symptoms and psychiatric history, but the adjusted association hardly decays with time: a meta-analysis on 59 longitudinal/prospective studies with 443 313 participants | journal = Psychological Medicine | volume = 46 | issue = 14 | pages = 2883–2906 | date = October 2016 | pmid = 27523506 | doi = 10.1017/S0033291716001653 | s2cid = 23548727 | url = https://zenodo.org/record/895885 }}</ref>\n\n"}, {"title": "Recent concepts of abnormality", "content": "* ''Statistical abnormality''<ref>{{Cite web |last=Gilles-Thomas |first=David L. |date=1989 |title=Definitions of Abnormality |url=https://www.acsu.buffalo.edu/~dgthomas/Abpsy/lecture1.html |access-date=2022-06-05 |website=[[University of Buffalo]]}}</ref> – when a certain behavior/characteristic is relevant to a low percentage of the population. However, this does not necessarily mean that such individuals have mental illness (for example, statistical abnormalities such as extreme wealth/attractiveness)\n* ''Psychometric abnormality'' – [[Psychometrics|Psychometric]] abnormality implicates abnormality as a deviation from a statistically determined norm, such as the population average IQ of 100. In this case, an IQ score less than about 70–75 may define someone as having a learning disability, and suggests they will have some difficulties coping with life. However, the problems associated with a low IQ differ widely across individuals depending on their life circumstances. So, even when an individual is defined as psycho-metrically 'abnormal', this tells us little about their actual condition or problems. Furthermore, if one takes the other end of the IQ spectrum, a deviation of 30 points above the mean is generally not considered to be abnormal, or to indicate the presence of mental health problems.\n* ''Deviant behavior'' – this is not always a sign of mental illness, as mental illness can occur without deviant behavior, and such behavior may occur in the absence of mental illness.\n* ''Combinations'' – including distress, dysfunction, distorted psychological processes, inappropriate responses in given situations, and causing/risking harm to oneself.<ref>{{Harvnb|Bennett|2003|pp=3–5}}</ref>\n\n==== Examples ====\nThere is a wide range of [[mental disorder]]s that are considered to be forms of Abnormal Psychology. These include, but are not limited to:\n\n'''Schizophrenia'''\n\n[[Schizophrenia]] can be described as a disorder that causes extreme loss of touch with reality. The [[Psychosis|Psychotic]] nature of schizophrenia manifests itself through [[delusion]]s, as well as auditory and visual [[hallucination]]s. Schizophrenia is known to have a genetic etiology, as well as other biological components, such as brain disruptions in the prenatal development period.<ref name = \"Phares_2014\">{{cite book| vauthors = Phares V |title=Understanding abnormal Child Psychology|publisher=Wiley|location=Haboken NJ }}</ref>{{rp|323–326}}\n\n'''Attention deficit hyperactivity disorder'''\n\n[[Attention deficit hyperactivity disorder]] (ADHD) is characterized by high amounts of inattention and hyperactive impulsiveness. Inattentive symptoms include not listening, careless errors, disorganization, losing personal belongings, becoming easily distracted, and forgetfulness. Symptoms of hyperactive impulsiveness include fidgeting, talking excessively, and interrupting others.<ref name = \"Phares_2014\" />{{rp|225–253}}\n\n'''Antisocial personality disorder'''\n\n[[Antisocial personality disorder]] can be described as a cluster of personality traits that lead to specific outcomes, and violate the rights of other people. These personality traits include callousness, deceitfulness, lack of remorse, apathy, manipulation of others, impulsiveness, and grandiosity.<ref name=\"Sánchez_de_Ribera_2019\">{{Cite journal| vauthors = Sánchez de Ribera O, Kavish N, Katz IM, Boutwell BB, Back M |date= September 2019 |title=Untangling Intelligence, Psychopathy, Antisocial Personality Disorder, and Conduct Problems: A Meta–Analytic Review |journal=European Journal of Personality|language=en|volume=33|issue=5|pages=529–564|doi=10.1002/per.2207|s2cid=202253144|issn=0890-2070}}</ref> Additional traits may include superficial charm, sexual promiscuity, and pathological lying.<ref name=\"Sánchez_de_Ribera_2019\" />\n\n'''Dissociative identity disorder'''\n\n[[Dissociative identity disorder]] (DID) involves one individual having multiple personalities. Those with DID are described as having multiple selves that each have their own consciousness and awareness.<ref name=\"Boysen_2013\">{{cite journal | vauthors = Boysen GA, VanBergen A | title = A review of published research on adult dissociative identity disorder: 2000-2010 | journal = The Journal of Nervous and Mental Disease | volume = 201 | issue = 1 | pages = 5–11 | date = January 2013 | pmid = 23274288 | doi = 10.1097/NMD.0b013e31827aaf81 | s2cid = 25189072 }}</ref>\n\nDID has two main etiologies, which are the post-traumatic and socio-cognitive models.<ref name=\"Boysen_2013\" /> The post-traumatic model states that DID is caused by inescapable past trauma, such as child abuse. The child dissociates and forms alternate personalities as a coping mechanism, in response to the current trauma. Even when the trauma ends, the personalities continue to disrupt the person's life longterm. The socio-cognitive model states that people will implicitly act as if they have multiple personalities and that it is done to align with cultural norms.<ref name=\"Boysen_2013\" />\n\n'''Social anxiety disorder'''\n\nThose with [[social anxiety disorder]] (SAD) have a very intense fear of social situations. This fear stems from the belief that the person will be evaluated negatively or embarrass themselves.<ref name=\"McEnery_2019\">{{cite journal | vauthors = McEnery C, Lim MH, Tremain H, Knowles A, Alvarez-Jimenez M | title = Prevalence rate of social anxiety disorder in individuals with a psychotic disorder: A systematic review and meta-analysis | journal = Schizophrenia Research | volume = 208 | pages = 25–33 | date = June 2019 | pmid = 30722947 | doi = 10.1016/j.schres.2019.01.045 | s2cid = 73425627 }}</ref>\n\nSAD is also considered to be one of the more disabling mental disorders. Symptoms of this disorder include fear in most, if not all, social situations.<ref name=\"McEnery_2019\" /> SAD can develop after a traumatic and/or embarrassing experience has occurred while the person was being observed by other people.<ref name = \"Phares_2014\" />{{rp|200–202}}\n\n'''Generalized anxiety disorder'''\n\n[[Generalized anxiety disorder]] is characterized by a constant, chronic state of worry and anxiety that is related to a large variety of situations, and is difficult to control. Additional symptoms may include irritability, fatigue, concentration difficulties, and restlessness.<ref>{{cite journal | vauthors = Tyrer P, Baldwin D | title = Generalised anxiety disorder | journal = Lancet | volume = 368 | issue = 9553 | pages = 2156–66 | date = December 2006 | pmid = 17174708 | doi = 10.1016/S0140-6736(06)69865-6 | s2cid = 18959359 }}</ref>\n\n'''Specific phobia'''\n\nIndividuals with [[specific phobia]]s have an extreme fear and avoidance of various objects or situations.<ref name=\"Ipser_2013\">{{cite journal | vauthors = Ipser JC, Singh L, Stein DJ | title = Meta-analysis of functional brain imaging in specific phobia | journal = Psychiatry and Clinical Neurosciences | volume = 67 | issue = 5 | pages = 311–22 | date = July 2013 | pmid = 23711114 | doi = 10.1111/pcn.12055 | s2cid = 46155186 | doi-access = free }}</ref> Specifically, fears become phobias when there is excessive and unreasonable fear that is disproportionate to the culture that the individual is in.<ref name = \"Phares_2014\" />{{rp|199–200}} Examples of specific phobias include, but are not limited to, phobias of school, [[Blood phobia|blood]], [[Traumatophobia|injury]], [[Fear of needles|needles]], small animals, and [[Acrophobia|heights]].<ref name=\"Ipser_2013\" />\n\n'''Post-traumatic stress disorder'''\n\n[[Post-traumatic stress disorder]] (PTSD) is described as physical and mental distress related to past traumatic experiences. PTSD can manifest a large variety of symptoms, including, but not limited to, nightmares, flashbacks, avoidance and/or physiological reactions related to stimuli regarding the trauma, shame, guilt, anger, hypervigilance, and social withdrawal.<ref name=\"Kube_2020\">{{cite journal | vauthors = Kube T, Berg M, Kleim B, Herzog P | title = Rethinking post-traumatic stress disorder - A predictive processing perspective | journal = Neuroscience and Biobehavioral Reviews | volume = 113 | pages = 448–460 | date = June 2020 | pmid = 32315695 | doi = 10.1016/j.neubiorev.2020.04.014 | s2cid = 215814023 }}</ref>\n\nPTSD symptoms can arise due to various experiences that involve actual or threatened violence, injury, or death. Firsthand experience, witnessing, or learning about traumatic experiences can possibly lead to the development of PTSD.<ref name=\"Kube_2020\" />\n\n"}, {"title": " Examples ", "content": "There is a wide range of [[mental disorder]]s that are considered to be forms of Abnormal Psychology. These include, but are not limited to:\n\n'''Schizophrenia'''\n\n[[Schizophrenia]] can be described as a disorder that causes extreme loss of touch with reality. The [[Psychosis|Psychotic]] nature of schizophrenia manifests itself through [[delusion]]s, as well as auditory and visual [[hallucination]]s. Schizophrenia is known to have a genetic etiology, as well as other biological components, such as brain disruptions in the prenatal development period.<ref name = \"Phares_2014\">{{cite book| vauthors = Phares V |title=Understanding abnormal Child Psychology|publisher=Wiley|location=Haboken NJ }}</ref>{{rp|323–326}}\n\n'''Attention deficit hyperactivity disorder'''\n\n[[Attention deficit hyperactivity disorder]] (ADHD) is characterized by high amounts of inattention and hyperactive impulsiveness. Inattentive symptoms include not listening, careless errors, disorganization, losing personal belongings, becoming easily distracted, and forgetfulness. Symptoms of hyperactive impulsiveness include fidgeting, talking excessively, and interrupting others.<ref name = \"Phares_2014\" />{{rp|225–253}}\n\n'''Antisocial personality disorder'''\n\n[[Antisocial personality disorder]] can be described as a cluster of personality traits that lead to specific outcomes, and violate the rights of other people. These personality traits include callousness, deceitfulness, lack of remorse, apathy, manipulation of others, impulsiveness, and grandiosity.<ref name=\"Sánchez_de_Ribera_2019\">{{Cite journal| vauthors = Sánchez de Ribera O, Kavish N, Katz IM, Boutwell BB, Back M |date= September 2019 |title=Untangling Intelligence, Psychopathy, Antisocial Personality Disorder, and Conduct Problems: A Meta–Analytic Review |journal=European Journal of Personality|language=en|volume=33|issue=5|pages=529–564|doi=10.1002/per.2207|s2cid=202253144|issn=0890-2070}}</ref> Additional traits may include superficial charm, sexual promiscuity, and pathological lying.<ref name=\"Sánchez_de_Ribera_2019\" />\n\n'''Dissociative identity disorder'''\n\n[[Dissociative identity disorder]] (DID) involves one individual having multiple personalities. Those with DID are described as having multiple selves that each have their own consciousness and awareness.<ref name=\"Boysen_2013\">{{cite journal | vauthors = Boysen GA, VanBergen A | title = A review of published research on adult dissociative identity disorder: 2000-2010 | journal = The Journal of Nervous and Mental Disease | volume = 201 | issue = 1 | pages = 5–11 | date = January 2013 | pmid = 23274288 | doi = 10.1097/NMD.0b013e31827aaf81 | s2cid = 25189072 }}</ref>\n\nDID has two main etiologies, which are the post-traumatic and socio-cognitive models.<ref name=\"Boysen_2013\" /> The post-traumatic model states that DID is caused by inescapable past trauma, such as child abuse. The child dissociates and forms alternate personalities as a coping mechanism, in response to the current trauma. Even when the trauma ends, the personalities continue to disrupt the person's life longterm. The socio-cognitive model states that people will implicitly act as if they have multiple personalities and that it is done to align with cultural norms.<ref name=\"Boysen_2013\" />\n\n'''Social anxiety disorder'''\n\nThose with [[social anxiety disorder]] (SAD) have a very intense fear of social situations. This fear stems from the belief that the person will be evaluated negatively or embarrass themselves.<ref name=\"McEnery_2019\">{{cite journal | vauthors = McEnery C, Lim MH, Tremain H, Knowles A, Alvarez-Jimenez M | title = Prevalence rate of social anxiety disorder in individuals with a psychotic disorder: A systematic review and meta-analysis | journal = Schizophrenia Research | volume = 208 | pages = 25–33 | date = June 2019 | pmid = 30722947 | doi = 10.1016/j.schres.2019.01.045 | s2cid = 73425627 }}</ref>\n\nSAD is also considered to be one of the more disabling mental disorders. Symptoms of this disorder include fear in most, if not all, social situations.<ref name=\"McEnery_2019\" /> SAD can develop after a traumatic and/or embarrassing experience has occurred while the person was being observed by other people.<ref name = \"Phares_2014\" />{{rp|200–202}}\n\n'''Generalized anxiety disorder'''\n\n[[Generalized anxiety disorder]] is characterized by a constant, chronic state of worry and anxiety that is related to a large variety of situations, and is difficult to control. Additional symptoms may include irritability, fatigue, concentration difficulties, and restlessness.<ref>{{cite journal | vauthors = Tyrer P, Baldwin D | title = Generalised anxiety disorder | journal = Lancet | volume = 368 | issue = 9553 | pages = 2156–66 | date = December 2006 | pmid = 17174708 | doi = 10.1016/S0140-6736(06)69865-6 | s2cid = 18959359 }}</ref>\n\n'''Specific phobia'''\n\nIndividuals with [[specific phobia]]s have an extreme fear and avoidance of various objects or situations.<ref name=\"Ipser_2013\">{{cite journal | vauthors = Ipser JC, Singh L, Stein DJ | title = Meta-analysis of functional brain imaging in specific phobia | journal = Psychiatry and Clinical Neurosciences | volume = 67 | issue = 5 | pages = 311–22 | date = July 2013 | pmid = 23711114 | doi = 10.1111/pcn.12055 | s2cid = 46155186 | doi-access = free }}</ref> Specifically, fears become phobias when there is excessive and unreasonable fear that is disproportionate to the culture that the individual is in.<ref name = \"Phares_2014\" />{{rp|199–200}} Examples of specific phobias include, but are not limited to, phobias of school, [[Blood phobia|blood]], [[Traumatophobia|injury]], [[Fear of needles|needles]], small animals, and [[Acrophobia|heights]].<ref name=\"Ipser_2013\" />\n\n'''Post-traumatic stress disorder'''\n\n[[Post-traumatic stress disorder]] (PTSD) is described as physical and mental distress related to past traumatic experiences. PTSD can manifest a large variety of symptoms, including, but not limited to, nightmares, flashbacks, avoidance and/or physiological reactions related to stimuli regarding the trauma, shame, guilt, anger, hypervigilance, and social withdrawal.<ref name=\"Kube_2020\">{{cite journal | vauthors = Kube T, Berg M, Kleim B, Herzog P | title = Rethinking post-traumatic stress disorder - A predictive processing perspective | journal = Neuroscience and Biobehavioral Reviews | volume = 113 | pages = 448–460 | date = June 2020 | pmid = 32315695 | doi = 10.1016/j.neubiorev.2020.04.014 | s2cid = 215814023 }}</ref>\n\nPTSD symptoms can arise due to various experiences that involve actual or threatened violence, injury, or death. Firsthand experience, witnessing, or learning about traumatic experiences can possibly lead to the development of PTSD.<ref name=\"Kube_2020\" />\n\n"}, {"title": "Approaches", "content": "* ''Somatogenic''&nbsp;– abnormality is seen as a result of biological disorders in the brain.<ref>{{cite book | vauthors = Kraepelin E | title =  Compendium der Psychiatrie | trans-title = Textboook of Psychiatry | language = German | location = Leipzig | publisher = Abel | date = 1883 | oclc = 604107351 }}</ref> This approach has led to the development of radical biological treatments, e.g. lobotomy.\n* ''Psychogenic''&nbsp;– abnormality is caused by psychological problems. [[Psychoanalytic]] ([[Sigmund Freud|Freud]]), [[Cathartic]], [[Hypnotic]] and [[Humanistic Psychology]] ([[Carl Rogers]], [[Abraham Maslow]])<ref>{{Harvnb|Bennett|2003|pp=7–10}}</ref> treatments were all derived from this paradigm. This approach has, as well, led to some esoteric treatments: [[Franz Mesmer]] used to place his patients in a darkened room with music playing, then enter it wearing a flamboyant outfit and poke the \"infected\" body areas with a stick.\n\n"}, {"title": "Classification", "content": "\n===DSM-5===\n{{more citations needed section|date=May 2013}}\nThe standard abnormal psychology and psychiatry reference book in North America is the [[Diagnostic and Statistical Manual]] of the [[American Psychiatric Association]]. The current version of the book is known as the DSM-5. It lists a set of [[mental illness|disorders]] and provides detailed descriptions on what constitutes a mental disorder.<ref name=\"DSM-5\" />\n\nThe DSM-5 identifies three key elements that must be present to constitute a mental disorder. These elements include:<ref name=\"DSM-5\" />\n* Symptoms that involve disturbances in behavior, thoughts, or emotions.\n* Symptoms associated with personal distress or impairment.\n* Symptoms that stem from internal dysfunctions (i.e. specifically having biological and/or psychological roots).<ref>{{cite book | vauthors = Schacter D, Gilbert D, Wegner D |year=2010 |title=Psychology |edition=2nd |chapter=Identifying Psychological Disorders: What is Abnormal? |chapter-url=https://books.google.com/books?id=emAyzTNy1cUC&pg=PA550 |location=New York, NY |publisher=Worth Publishers |isbn=978-1-4292-3719-2 |url=https://archive.org/details/psychology0000scha |url-access=registration }}</ref>  \nThe DSM-5 uses three main sections to organize its contents. These sections include I, II, and III. Section I includes the introduction, use, and basics of the DSM-5. Section II includes diagnostic criteria and codes. Section III includes emerging measures and models.<ref name=\"DSM-5\">{{cite book| author = American Psychiatric Association |title=Diagnostic and Statistical Manual of Mental Disorders (DSM-5)|year=2013|location=American Psychiatric Publishing}}</ref>\n\n=== Section I (DSM-5 Basics) ===\nSection I of the DSM-5 briefly prefaces purpose, content, structure, and use.<ref name=\"DSM-5\" /> This includes basics, introductions and cautionary statements for forensic use.<ref name=\"DSM-5\" /> Information is also given about the revision and review processes as well as the DSM-5's goals to harmonize with the ICD-11. An explanation regarding the change from the previous multi-axial classification system to the current three section system is also included here.<ref name=\"DSM-5\" />\n\n=== Section II (Diagnostic Criteria and Codes) ===\nSection II of the DSM-5 Contains a wide range of diagnostic criteria and codes used for establishing, and diagnosing the vast amount of abnormal psychological constructs.<ref name=\"DSM-5\" /> This sections replaced the bulk of the axis system in the previous DSM versions and includes the following categories:<ref name=\"DSM-5\" />\n\n* Diagnostic Criteria and codes<ref name=\"DSM-5\" />\n* [[Neurodevelopmental disorder|Neurodevelopmental Disorders]]<ref name=\"DSM-5\" />\n* [[Schizophrenia]] Spectrum and Other Psychotic Disorders<ref name=\"DSM-5\" />\n* [[Bipolar disorder|Bipolar]] and related Disorders<ref name=\"DSM-5\" />\n* Depressive Disorders<ref name=\"DSM-5\" />\n* Anxiety Disorders<ref name=\"DSM-5\" />\n* [[Obsessive–compulsive disorder|Obsessive-Compulsive]] and related Disorders<ref name=\"DSM-5\" />\n* Trauma and Stressor related disorders<ref name=\"DSM-5\" />\n* Dissociative Disorders<ref name=\"DSM-5\" />\n* [[Somatic symptom disorder|Somatic Symptom]] and Related Disorders<ref name=\"DSM-5\" />\n* Feeding and Eating Disorders<ref name=\"DSM-5\" />\n* Elimination Disorders<ref name=\"DSM-5\" />\n* [[Sleep disorder|Sleep Wake Disorders]]<ref name=\"DSM-5\" />\n* [[Sexual dysfunction|Sexual Dysfunctions]]<ref name=\"DSM-5\" />\n* [[Gender dysphoria|Gender Dysphoria]]<ref name=\"DSM-5\" />\n* Disruptive, Impulse Control, and [[Conduct disorder|Conduct Disorders]]<ref name=\"DSM-5\" />\n* Substance Related and Addictive Disorders<ref name=\"DSM-5\" />\n* Neurocognitive Disorders<ref name=\"DSM-5\" />\n* Personality Disorders<ref name=\"DSM-5\" />\n* Paraphilic Disorders<ref name=\"DSM-5\" />\n* Medication induced movement disorders and effects of medication.<ref name=\"DSM-5\" />\n* Other Mental disorders and additional Codes<ref name=\"DSM-5\" />\n\nThese categories are used to organize the various Abnormal psychological concepts based on their similarity.<ref name=\"DSM-5\" />\n\n=== Section III (Emerging Measures and Models) ===\nSection III of the DSM-5 contains the various methods and strategies that are used to make clinical decisions, understand culture, and explore emerging diagnoses.<ref name=\"DSM-5\" />\n\n===ICD-10===\nThe major international nosologic system for the classification of mental disorders can be found in the International Classification of Diseases, 10th revision (ICD-10). The [[ICD|ICD-10]] has been used by [[World Health Organization]] (WHO) Member States since 1994. Chapter five covers some 300 mental and behavioral disorders. The ICD-10's chapter five has been influenced by APA's DSM-IV and there is a great deal of concordance between the two. Beginning in January 2022, the ICD-11 will replace the ICD-10 in WHO member states.<ref>{{cite journal | vauthors = Reed GM, First MB, Kogan CS, Hyman SE, Gureje O, Gaebel W, Maj M, Stein DJ, Maercker A, Tyrer P, Claudino A, Garralda E, Salvador-Carulla L, Ray R, Saunders JB, Dua T, Poznyak V, Medina-Mora ME, Pike KM, Ayuso-Mateos JL, Kanba S, Keeley JW, Khoury B, Krasnov VN, Kulygina M, Lovell AM, de Jesus Mari J, Maruta T, Matsumoto C, Rebello TJ, Roberts MC, Robles R, Sharan P, Zhao M, Jablensky A, Udomratn P, Rahimi-Movaghar A, Rydelius PA, Bährer-Kohler S, Watts AD, Saxena S | display-authors = 6 | title = Innovations and changes in the ICD-11 classification of mental, behavioural and neurodevelopmental disorders | journal = World Psychiatry | volume = 18 | issue = 1 | pages = 3–19 | date = February 2019 | pmid = 30600616 | pmc = 6313247 | doi = 10.1002/wps.20611 }}</ref> WHO maintains free access to the [https://www.who.int/classifications/icd/en/ ICD-10 Online]. Below are the main categories of disorders:\n* '''F00–F09''' Organic, including symptomatic, mental disorders<ref name=\"ICD-10\" />\n* '''F10–F19''' Mental and behavioral disorders due to psychoactive substance use<ref name=\"ICD-10\" />\n* '''F20–F29''' Schizophrenia, schizotypal and delusional disorders<ref name=\"ICD-10\" />\n* '''F30–F39''' Mood [affective] disorders<ref name=\"ICD-10\" />\n* '''F40–F48''' Neurotic, stress-related and somatoform disorders<ref name=\"ICD-10\" />\n* '''F50–F59''' Behavioral syndromes associated with physiological disturbances and physical factors<ref name=\"ICD-10\" />\n* '''F60–F69''' Disorders of adult personality and behavior<ref name=\"ICD-10\" />\n* '''F70–F79''' Mental retardation<ref name=\"ICD-10\" />\n* '''F80–F89''' Disorders of psychological development<ref name=\"ICD-10\" />\n* '''F90–F98''' Behavioral and emotional disorders with onset usually occurring in childhood and adolescence<ref name=\"ICD-10\" />\n* '''F99''' Unspecified mental disorder<ref name=\"ICD-10\">{{Cite book|title=ICD-10: international statistical classification of diseases and related health problems. (10th revision, Fifth edition.)|publisher=World Health Organization|year=2016}}</ref>\n\n=== ICD-11 ===\nThe ICD-11 is the most recent version of the International Classification of Diseases. The ''Mental, behavioral, or Neurodevelopmental disorders section'' highlights forms of abnormal psychology.<ref name=\"ICD-11\">{{Cite web|last=World Health Organization|title=International Classification of Diseases for mortality and Morbidity Statistics (ICD-11)|url=https://icd.who.int/browse11/l-m/en|url-status=live|website=WHO|archive-url=https://web.archive.org/web/20180619155128/https://icd.who.int/browse11/l-m/en |archive-date=2018-06-19 }}</ref>\n\n'''Mental, behavioral, or Neurodevelopmental disorders'''\n\n* '''6A00-6A0Z''' Neurodevelopmental disorders<ref name=\"ICD-11\" />\n* '''6A20-6A2Z''' Schizophrenia or other primary psychotic disorders<ref name=\"ICD-11\" />\n* '''6A40-6A4Z''' Catatonia<ref name=\"ICD-11\" />\n* '''6A60-6A8Z''' Mood Disorders<ref name=\"ICD-11\" />\n* '''6B00-6B0Z''' Anxiety or fear related disorders<ref name=\"ICD-11\" />\n* '''6B20-6B2Z''' Obsessive-compulsive or related disorders<ref name=\"ICD-11\" />\n* '''6B40-6B4Z''' Disorders specifically associated with stress<ref name=\"ICD-11\" />\n* '''6B60-6B6Z''' Dissociative disorders<ref name=\"ICD-11\" />\n* '''6B80-6B8Z''' Feeding or eating disorders<ref name=\"ICD-11\" />\n* '''6C00-6C0Z''' Elimination Disorders<ref name=\"ICD-11\" />\n* '''6C20-6C2Z''' Disorders of bodily distress or bodily experience<ref name=\"ICD-11\" />\n* Disorders due to substance use or addictive behaviors<ref name=\"ICD-11\" />\n* '''6C70-6C7Z''' Impulse control disorders<ref name=\"ICD-11\" />\n* '''6C90-6C9Z''' Disruptive behavior or dissocial disorders<ref name=\"ICD-11\" />\n* '''6D10-6E68''' personality disorders and related traits<ref name=\"ICD-11\" />\n* '''6D30-6D3Z''' Paraphilic disorders<ref name=\"ICD-11\" />\n* '''6D50-6D5Z''' Factitious disorders<ref name=\"ICD-11\" />\n* '''6D70-6E0Z''' Neurocognitive disorders<ref name=\"ICD-11\" />\n* '''6E20-6E2Z''' Mental or behavioral disorders associated with pregnancy, childbirth or the puerperium<ref name=\"ICD-11\" />\n* '''6E40.0-6E40.Z''' (6E40) Psychological or behavioral factors affecting disorders or diseases classified elsewhere<ref name=\"ICD-11\" />\n* '''6E60-6E6Z''' secondary mental or behavioral syndromes associated with disorders or diseases classified elsewhere<ref name=\"ICD-11\" />\n\n"}, {"title": "DSM-5", "content": "{{more citations needed section|date=May 2013}}\nThe standard abnormal psychology and psychiatry reference book in North America is the [[Diagnostic and Statistical Manual]] of the [[American Psychiatric Association]]. The current version of the book is known as the DSM-5. It lists a set of [[mental illness|disorders]] and provides detailed descriptions on what constitutes a mental disorder.<ref name=\"DSM-5\" />\n\nThe DSM-5 identifies three key elements that must be present to constitute a mental disorder. These elements include:<ref name=\"DSM-5\" />\n* Symptoms that involve disturbances in behavior, thoughts, or emotions.\n* Symptoms associated with personal distress or impairment.\n* Symptoms that stem from internal dysfunctions (i.e. specifically having biological and/or psychological roots).<ref>{{cite book | vauthors = Schacter D, Gilbert D, Wegner D |year=2010 |title=Psychology |edition=2nd |chapter=Identifying Psychological Disorders: What is Abnormal? |chapter-url=https://books.google.com/books?id=emAyzTNy1cUC&pg=PA550 |location=New York, NY |publisher=Worth Publishers |isbn=978-1-4292-3719-2 |url=https://archive.org/details/psychology0000scha |url-access=registration }}</ref>  \nThe DSM-5 uses three main sections to organize its contents. These sections include I, II, and III. Section I includes the introduction, use, and basics of the DSM-5. Section II includes diagnostic criteria and codes. Section III includes emerging measures and models.<ref name=\"DSM-5\">{{cite book| author = American Psychiatric Association |title=Diagnostic and Statistical Manual of Mental Disorders (DSM-5)|year=2013|location=American Psychiatric Publishing}}</ref>\n\n"}, {"title": " Section I (DSM-5 Basics) ", "content": "Section I of the DSM-5 briefly prefaces purpose, content, structure, and use.<ref name=\"DSM-5\" /> This includes basics, introductions and cautionary statements for forensic use.<ref name=\"DSM-5\" /> Information is also given about the revision and review processes as well as the DSM-5's goals to harmonize with the ICD-11. An explanation regarding the change from the previous multi-axial classification system to the current three section system is also included here.<ref name=\"DSM-5\" />\n\n"}, {"title": " Section II (Diagnostic Criteria and Codes) ", "content": "Section II of the DSM-5 Contains a wide range of diagnostic criteria and codes used for establishing, and diagnosing the vast amount of abnormal psychological constructs.<ref name=\"DSM-5\" /> This sections replaced the bulk of the axis system in the previous DSM versions and includes the following categories:<ref name=\"DSM-5\" />\n\n* Diagnostic Criteria and codes<ref name=\"DSM-5\" />\n* [[Neurodevelopmental disorder|Neurodevelopmental Disorders]]<ref name=\"DSM-5\" />\n* [[Schizophrenia]] Spectrum and Other Psychotic Disorders<ref name=\"DSM-5\" />\n* [[Bipolar disorder|Bipolar]] and related Disorders<ref name=\"DSM-5\" />\n* Depressive Disorders<ref name=\"DSM-5\" />\n* Anxiety Disorders<ref name=\"DSM-5\" />\n* [[Obsessive–compulsive disorder|Obsessive-Compulsive]] and related Disorders<ref name=\"DSM-5\" />\n* Trauma and Stressor related disorders<ref name=\"DSM-5\" />\n* Dissociative Disorders<ref name=\"DSM-5\" />\n* [[Somatic symptom disorder|Somatic Symptom]] and Related Disorders<ref name=\"DSM-5\" />\n* Feeding and Eating Disorders<ref name=\"DSM-5\" />\n* Elimination Disorders<ref name=\"DSM-5\" />\n* [[Sleep disorder|Sleep Wake Disorders]]<ref name=\"DSM-5\" />\n* [[Sexual dysfunction|Sexual Dysfunctions]]<ref name=\"DSM-5\" />\n* [[Gender dysphoria|Gender Dysphoria]]<ref name=\"DSM-5\" />\n* Disruptive, Impulse Control, and [[Conduct disorder|Conduct Disorders]]<ref name=\"DSM-5\" />\n* Substance Related and Addictive Disorders<ref name=\"DSM-5\" />\n* Neurocognitive Disorders<ref name=\"DSM-5\" />\n* Personality Disorders<ref name=\"DSM-5\" />\n* Paraphilic Disorders<ref name=\"DSM-5\" />\n* Medication induced movement disorders and effects of medication.<ref name=\"DSM-5\" />\n* Other Mental disorders and additional Codes<ref name=\"DSM-5\" />\n\nThese categories are used to organize the various Abnormal psychological concepts based on their similarity.<ref name=\"DSM-5\" />\n\n"}, {"title": " Section III (Emerging Measures and Models) ", "content": "Section III of the DSM-5 contains the various methods and strategies that are used to make clinical decisions, understand culture, and explore emerging diagnoses.<ref name=\"DSM-5\" />\n\n"}, {"title": "ICD-10", "content": "The major international nosologic system for the classification of mental disorders can be found in the International Classification of Diseases, 10th revision (ICD-10). The [[ICD|ICD-10]] has been used by [[World Health Organization]] (WHO) Member States since 1994. Chapter five covers some 300 mental and behavioral disorders. The ICD-10's chapter five has been influenced by APA's DSM-IV and there is a great deal of concordance between the two. Beginning in January 2022, the ICD-11 will replace the ICD-10 in WHO member states.<ref>{{cite journal | vauthors = Reed GM, First MB, Kogan CS, Hyman SE, Gureje O, Gaebel W, Maj M, Stein DJ, Maercker A, Tyrer P, Claudino A, Garralda E, Salvador-Carulla L, Ray R, Saunders JB, Dua T, Poznyak V, Medina-Mora ME, Pike KM, Ayuso-Mateos JL, Kanba S, Keeley JW, Khoury B, Krasnov VN, Kulygina M, Lovell AM, de Jesus Mari J, Maruta T, Matsumoto C, Rebello TJ, Roberts MC, Robles R, Sharan P, Zhao M, Jablensky A, Udomratn P, Rahimi-Movaghar A, Rydelius PA, Bährer-Kohler S, Watts AD, Saxena S | display-authors = 6 | title = Innovations and changes in the ICD-11 classification of mental, behavioural and neurodevelopmental disorders | journal = World Psychiatry | volume = 18 | issue = 1 | pages = 3–19 | date = February 2019 | pmid = 30600616 | pmc = 6313247 | doi = 10.1002/wps.20611 }}</ref> WHO maintains free access to the [https://www.who.int/classifications/icd/en/ ICD-10 Online]. Below are the main categories of disorders:\n* '''F00–F09''' Organic, including symptomatic, mental disorders<ref name=\"ICD-10\" />\n* '''F10–F19''' Mental and behavioral disorders due to psychoactive substance use<ref name=\"ICD-10\" />\n* '''F20–F29''' Schizophrenia, schizotypal and delusional disorders<ref name=\"ICD-10\" />\n* '''F30–F39''' Mood [affective] disorders<ref name=\"ICD-10\" />\n* '''F40–F48''' Neurotic, stress-related and somatoform disorders<ref name=\"ICD-10\" />\n* '''F50–F59''' Behavioral syndromes associated with physiological disturbances and physical factors<ref name=\"ICD-10\" />\n* '''F60–F69''' Disorders of adult personality and behavior<ref name=\"ICD-10\" />\n* '''F70–F79''' Mental retardation<ref name=\"ICD-10\" />\n* '''F80–F89''' Disorders of psychological development<ref name=\"ICD-10\" />\n* '''F90–F98''' Behavioral and emotional disorders with onset usually occurring in childhood and adolescence<ref name=\"ICD-10\" />\n* '''F99''' Unspecified mental disorder<ref name=\"ICD-10\">{{Cite book|title=ICD-10: international statistical classification of diseases and related health problems. (10th revision, Fifth edition.)|publisher=World Health Organization|year=2016}}</ref>\n\n"}, {"title": " ICD-11 ", "content": "The ICD-11 is the most recent version of the International Classification of Diseases. The ''Mental, behavioral, or Neurodevelopmental disorders section'' highlights forms of abnormal psychology.<ref name=\"ICD-11\">{{Cite web|last=World Health Organization|title=International Classification of Diseases for mortality and Morbidity Statistics (ICD-11)|url=https://icd.who.int/browse11/l-m/en|url-status=live|website=WHO|archive-url=https://web.archive.org/web/20180619155128/https://icd.who.int/browse11/l-m/en |archive-date=2018-06-19 }}</ref>\n\n'''Mental, behavioral, or Neurodevelopmental disorders'''\n\n* '''6A00-6A0Z''' Neurodevelopmental disorders<ref name=\"ICD-11\" />\n* '''6A20-6A2Z''' Schizophrenia or other primary psychotic disorders<ref name=\"ICD-11\" />\n* '''6A40-6A4Z''' Catatonia<ref name=\"ICD-11\" />\n* '''6A60-6A8Z''' Mood Disorders<ref name=\"ICD-11\" />\n* '''6B00-6B0Z''' Anxiety or fear related disorders<ref name=\"ICD-11\" />\n* '''6B20-6B2Z''' Obsessive-compulsive or related disorders<ref name=\"ICD-11\" />\n* '''6B40-6B4Z''' Disorders specifically associated with stress<ref name=\"ICD-11\" />\n* '''6B60-6B6Z''' Dissociative disorders<ref name=\"ICD-11\" />\n* '''6B80-6B8Z''' Feeding or eating disorders<ref name=\"ICD-11\" />\n* '''6C00-6C0Z''' Elimination Disorders<ref name=\"ICD-11\" />\n* '''6C20-6C2Z''' Disorders of bodily distress or bodily experience<ref name=\"ICD-11\" />\n* Disorders due to substance use or addictive behaviors<ref name=\"ICD-11\" />\n* '''6C70-6C7Z''' Impulse control disorders<ref name=\"ICD-11\" />\n* '''6C90-6C9Z''' Disruptive behavior or dissocial disorders<ref name=\"ICD-11\" />\n* '''6D10-6E68''' personality disorders and related traits<ref name=\"ICD-11\" />\n* '''6D30-6D3Z''' Paraphilic disorders<ref name=\"ICD-11\" />\n* '''6D50-6D5Z''' Factitious disorders<ref name=\"ICD-11\" />\n* '''6D70-6E0Z''' Neurocognitive disorders<ref name=\"ICD-11\" />\n* '''6E20-6E2Z''' Mental or behavioral disorders associated with pregnancy, childbirth or the puerperium<ref name=\"ICD-11\" />\n* '''6E40.0-6E40.Z''' (6E40) Psychological or behavioral factors affecting disorders or diseases classified elsewhere<ref name=\"ICD-11\" />\n* '''6E60-6E6Z''' secondary mental or behavioral syndromes associated with disorders or diseases classified elsewhere<ref name=\"ICD-11\" />\n\n"}, {"title": "Perspectives of abnormal psychology", "content": "Psychologists may use different perspectives to try to get better understanding on abnormal psychology. Some of them may just concentrate on a single perspective. But the professionals prefer to combine two or three perspectives together in order to get significant information for better treatments.\n*Behavioral&nbsp;– the perspective focus on observable behaviors\n*Medical&nbsp;– the perspective focus on biological causes on mental illness\n*Cognitive&nbsp;– the perspective focus on how internal thoughts, perceptions and reasoning contribute to psychological disorders\n\n"}, {"title": "Cause", "content": "\n===Genetics===\n* Investigated through family studies, mainly of monozygotic (identical) and dizygotic (fraternal) twins, often in the context of [[adoption]]. Monozygotic twins should be more likely than dizygotic twins to have the same disorder because they share 100% of their genetic material, whereas dizygotic twins share only 50%. For many disorders, this is exactly what research shows. But given that monozygotic twins share 100% of their genetic material, it may be expected of them to have the same disorders 100% of the time, but in fact they have the same disorders only about 50% of the time<ref>{{cite book | vauthors = Davila J, Fincham FD | chapter = Abnormal Psychology | chapter-url = http://www.blackwellpublishing.com/intropsych/pdf/chapter15.pdf | title = Psychology | publisher = }}</ref>\n* These studies allow calculation of a ''heritability coefficient''.\n*Genetic vulnerabilities ([[Diathesis–stress model|Diathesis stress Model]])<ref name = \"Phares_2014\" />{{rp|290–291}}\n\n===Biological causal factors===\n* Neurotransmitter [imbalances of neurotransmitters like [[norepinephrine]], [[dopamine]], [[serotonin]] and [[GABA]] (Gamma aminobutyric acid)] and hormonal imbalances in the brain<ref>{{Cite book| vauthors = Nevid J, Rathus S, Greene B |title=Abnormal Psychology in the changing world|publisher=Pearson|year=2018|isbn=978-0-134-44758-2|location=New York|pages=41–42}}</ref>\n* Constitutional liabilities [physical handicaps and temperament]\n* Brain dysfunction and neural plasticity\n* Physical deprivation or disruption [deprivation of basic physiological needs]\n\n===Socio-cultural factors===\n* Effects of urban/rural dwelling, gender and minority status on state of mind<ref>{{Cite book| vauthors = Fitzgerald K |title=Sociology of Sexualities|publisher=SAGE|year=2020|pages=204–205}}</ref>\n*[[Generalization (learning)|Generalizations]] about cultural practices and beliefs may fail to capture the diversity that exists within and across cultural groups, so we must be extremely careful not to stereotype individuals of any cultural group<ref>{{Cite book|title=Abnormal Child Psychology| vauthors = Mash EJ, Wolfe DA |publisher=Jon-David Hague|year=2013|isbn=978-1-111-83449-4|location=Belmont, CA|pages=110|quote=Generalizations about cultural practices and beliefs may fail to capture the diversity that exists within and across cultural groups, so we must be extremely careful not to stereotype individuals of any cultural group}}</ref>\n* Experiences with child physical and or sexual abuse.<ref name=\"Kube_2020\"/>\n* Encounters with environments that involve actual or threatened death<ref name=\"Kube_2020\" />\n\n===Systemic factors===\n* Family systems<ref name=\"Barbato_2020\" />\n* Negatively Expressed Emotion playing a part in schizophrenic relapse and [[anorexia nervosa]].\n\n===Biopsychosocial factors===\n* Illness dependent on stress \"triggers\".<ref>{{Harvnb|Bennett|2003|pp=17–26}}</ref>\n\n"}, {"title": "Genetics", "content": "* Investigated through family studies, mainly of monozygotic (identical) and dizygotic (fraternal) twins, often in the context of [[adoption]]. Monozygotic twins should be more likely than dizygotic twins to have the same disorder because they share 100% of their genetic material, whereas dizygotic twins share only 50%. For many disorders, this is exactly what research shows. But given that monozygotic twins share 100% of their genetic material, it may be expected of them to have the same disorders 100% of the time, but in fact they have the same disorders only about 50% of the time<ref>{{cite book | vauthors = Davila J, Fincham FD | chapter = Abnormal Psychology | chapter-url = http://www.blackwellpublishing.com/intropsych/pdf/chapter15.pdf | title = Psychology | publisher = }}</ref>\n* These studies allow calculation of a ''heritability coefficient''.\n*Genetic vulnerabilities ([[Diathesis–stress model|Diathesis stress Model]])<ref name = \"Phares_2014\" />{{rp|290–291}}\n\n"}, {"title": "Biological causal factors", "content": "* Neurotransmitter [imbalances of neurotransmitters like [[norepinephrine]], [[dopamine]], [[serotonin]] and [[GABA]] (Gamma aminobutyric acid)] and hormonal imbalances in the brain<ref>{{Cite book| vauthors = Nevid J, Rathus S, Greene B |title=Abnormal Psychology in the changing world|publisher=Pearson|year=2018|isbn=978-0-134-44758-2|location=New York|pages=41–42}}</ref>\n* Constitutional liabilities [physical handicaps and temperament]\n* Brain dysfunction and neural plasticity\n* Physical deprivation or disruption [deprivation of basic physiological needs]\n\n"}, {"title": "Socio-cultural factors", "content": "* Effects of urban/rural dwelling, gender and minority status on state of mind<ref>{{Cite book| vauthors = Fitzgerald K |title=Sociology of Sexualities|publisher=SAGE|year=2020|pages=204–205}}</ref>\n*[[Generalization (learning)|Generalizations]] about cultural practices and beliefs may fail to capture the diversity that exists within and across cultural groups, so we must be extremely careful not to stereotype individuals of any cultural group<ref>{{Cite book|title=Abnormal Child Psychology| vauthors = Mash EJ, Wolfe DA |publisher=Jon-David Hague|year=2013|isbn=978-1-111-83449-4|location=Belmont, CA|pages=110|quote=Generalizations about cultural practices and beliefs may fail to capture the diversity that exists within and across cultural groups, so we must be extremely careful not to stereotype individuals of any cultural group}}</ref>\n* Experiences with child physical and or sexual abuse.<ref name=\"Kube_2020\"/>\n* Encounters with environments that involve actual or threatened death<ref name=\"Kube_2020\" />\n\n"}, {"title": "Systemic factors", "content": "* Family systems<ref name=\"Barbato_2020\" />\n* Negatively Expressed Emotion playing a part in schizophrenic relapse and [[anorexia nervosa]].\n\n"}, {"title": "Biopsychosocial factors", "content": "* Illness dependent on stress \"triggers\".<ref>{{Harvnb|Bennett|2003|pp=17–26}}</ref>\n\n"}, {"title": "Therapies", "content": "===Psychoanalysis (Freud)===\n[[Psychoanalytic theory]] is heavily based on the theory of the neurologist [[Sigmund Freud]]. These ideas often represented repressed emotions and memories from a patient's childhood within their unconscious. According to psychoanalytic theory, these repressions cause the disturbances that people experience in their daily lives, and by finding the source of these disturbances, one should be able to eliminate the disturbance itself. This is accomplished by a variety of methods, with some popular ones being [[Free association (psychology)|free association]], [[hypnosis]], and [[insight]]. The goal of these methods is to induce a [[catharsis]], or emotional release in the patient, which should indicate that the source of the problem has been tapped, and it can then be treated. Freud's [[Psychosexual development|psychosexual stages]] also played a key role in this form of therapy, as he would often believe that the problems the patient was experiencing were due to them becoming stuck, or \"[[Fixation (psychology)|fixated]]\", in a particular stage. Dreams also played a major role in this form of therapy, as Freud viewed dreams as a way to gain insight into the unconscious mind. Patients were often asked to keep dream journals to bring in for discussion during the next therapy session.  There are many potential problems associated with this style of therapy, including resistance to the repressed memory or feeling, and [[negative transference]] onto the therapist. Psychoanalysis was carried on by many after Freud, including his daughter [[Anna Freud]], and [[Jacques Lacan]]. Many others have also gone on to elaborate on Freud's original theory, and to add their own take on [[Defence mechanisms|defense mechanisms]] or [[Dream interpretation|dream analysis]].<ref>{{cite journal | vauthors = Kovacevic F |year= 2013|title=A Lacanian approach to dream interpretation |journal=[[Dreaming (journal)|Dreaming]] |volume=23  |issue=1 |pages=78–89 |doi=10.1037/a0032206}}</ref>  While psychoanalysis has fallen out of favor to more modern forms of therapy, it is still used by some clinical psychologists to varying degrees.<ref>{{cite journal | vauthors = Smit Y, Huibers MJ, Ioannidis JP, van Dyck R, van Tilburg W, Arntz A | title = The effectiveness of long-term psychoanalytic psychotherapy--a meta-analysis of randomized controlled trials | journal = Clinical Psychology Review | volume = 32 | issue = 2 | pages = 81–92 | date = March 2012 | pmid = 22227111 | doi = 10.1016/j.cpr.2011.11.003 }}</ref>\n\n===Behavioral therapy (Wolpe)===\n[[Behaviour therapy|Behavior therapy]] relies on the principles of [[behaviorism]], such as involving [[classical conditioning|classical]] and [[operant conditioning]]. Behaviorism arose in the early 20th century, from the work of psychologists such as James Watson and [[B. F. Skinner]]. Behaviorism states that all behaviors humans do is because of a [[Stimulus (psychology)|stimulus]] and [[reinforcement]]. While this reinforcement is normally for good behavior, it can also occur for maladaptive behavior.  In this therapeutic view, the patients maladaptive behavior has been reinforced, which will cause the maladaptive behavior to be repeated. The goal of the therapy is to reinforce less maladaptive behaviors, so that with time, these adaptive behaviors will become the primary ones in the patient.<ref>{{Cite journal| vauthors = Edwards J |date=2016|title=Behaviorism and Control in the History of Economics and Psychology|url=https://read.dukeupress.edu/hope/article/48/suppl_1/170-197/28071|journal=History of Political Economy|language=en|volume=48|issue=suppl 1|pages=170–197|doi=10.1215/00182702-3619262|issn=0018-2702}}</ref>\n\n===Humanistic therapy (Rogers)===\n\n[[Humanistic psychology|Humanistic therapy]] aims to achieve [[self-actualization]] ([[Carl Rogers]], 1961). In this style of therapy, the therapist will focus on the patient themselves, as opposed to the patient's problem. The goal of this therapy is, by treating the patient as \"human\", rather than \"client\", to get to the source of the problem, and to resolve the problem in an effective manner. Humanistic therapy has been on the rise in recent years, and has been associated with numerous positive benefits. It is considered to be one of the core elements needed for therapeutic effectiveness, and a significant contributor to not only the well-being of the patient, but society as a whole. Some say that all of the therapeutic approaches today draw from the humanistic approach in some regard, and that humanistic therapy is the best way for treat a patient.<ref>{{cite journal | vauthors = Schneider KJ, Längle A | title = The renewal of humanism in psychotherapy: summary and conclusion | journal = Psychotherapy | volume = 49 | issue = 4 | pages = 480–1 | date = December 2012 | pmid = 23205836 | doi = 10.1037/a0028026 }}</ref> Humanistic therapy can be used on people of all ages; it is very popular among children in its variant known as \"[[play therapy]]\".<ref name=\"Lin_2015\" />\n\n===Cognitive behavioural therapy (Ellis and Beck)===\n\n[[Cognitive behavioral therapy|Cognitive behavioural therapy]] (CBT) aims to influence thought and cognition (Beck, 1977). This form of therapy relies on not only the components of behavioral therapy as mentioned before, but also the elements of [[cognitive psychology]].<ref name=\"Phares_2014\" />{{rp|101–102}} This relies on not only the clients behavioral problems that could have arisen from conditioning, but also their [[Schema (psychology)|negative schemas]] and [[Beck's cognitive triad|distorted perceptions]] of the world around them.  These negative schemas may cause distress in the life of the patient; for example, the schemas may give them unrealistic expectations for how well they should perform at their job, or how they should look physically. When these expectations are not met, it will often result in maladaptive behaviors, such as [[Depression (mood)|depression]], [[Obsessive–compulsive disorder|obsessive compulsions]], and [[anxiety]]. With CBT, the goal is to change the schemas that are causing the stress in the patients life, and replace them with more realistic ones. Once the negative schemas have been replaced, it will hopefully cause a remission of the patients symptoms. CBT is considered particularly effective in the treatment of depression, and has even been used in recent years in group settings. It is felt that using CBT in a group setting aids in giving its members a sense of support, and decreasing the likelihood of them dropping out of therapy before the treatment has had time to work properly.<ref>{{cite journal | vauthors = Hans E, Hiller W | title = Effectiveness of and dropout from outpatient cognitive behavioral therapy for adult unipolar depression: a meta-analysis of nonrandomized effectiveness studies | journal = Journal of Consulting and Clinical Psychology | volume = 81 | issue = 1 | pages = 75–88 | date = February 2013 | pmid = 23379264 | doi = 10.1037/a0031080 }}</ref> CBT has been found to be an effective treatment for many patients, even those who do not have diseases and disorders typically thought of as psychiatric ones. For example, patients with the disease [[multiple sclerosis]] have found a lot of help using CBT. The treatment often helps the patients cope with the disorder they have, and how they can adapt to their new lives without developing new problems, such as depression, or negative schemas about themselves.<ref>{{cite journal | vauthors = Moss-Morris R, Dennison L, Landau S, Yardley L, Silber E, Chalder T | title = A randomized controlled trial of cognitive behavioral therapy (CBT) for adjusting to multiple sclerosis (the saMS trial): does CBT work and for whom does it work? | journal = Journal of Consulting and Clinical Psychology | volume = 81 | issue = 2 | pages = 251–62 | date = April 2013 | pmid = 22730954 | doi = 10.1037/a0029132 | author-link1 = Rona Moss-Morris }}</ref>\n\nAccording to RAND, therapies are difficult to provide to all patients in need. A lack of funding and understanding of symptoms provides a major roadblock that is not easily avoided. Individual symptoms and responses to treatments vary, which creates a disconnect between patient, society, and care givers/professionals.<ref>{{cite journal | vauthors = Gresenz CR, Stockdale SE, Wells KB |url= https://www.rand.org/pubs/research_briefs/RB4533/index1.html|title= Are People With Mental Illness Getting the Help They Need? | journal =  Health Services Research |date= January 2000| volume = 35 | issue = 1 | pages = 295–306 }}</ref>\n\n===Play therapy (Humanistic)===\n\nChildren are often sent to therapy due to outbursts that they have in a school or home setting; the theory is that by treating the child in a setting that is similar to the area that they are having their disruptive behavior, the child will be more likely to learn from the therapy, and have an effective outcome. In [[play therapy]], the clinicians will \"play\" with their client, usually with toys, or a tea party. Playing is the typical behavior of a child, and therefore, playing with the therapist will come as a natural response to the child. In playing together, the clinician will ask the patient questions, and due to the setting, the questions seem less intrusive, more therapeutic, and more like a normal conversation. This should help the patient realize issues they have, and confess them to the therapist with less difficulty than they may experience in a traditional counselling setting.<ref>{{cite journal| vauthors = Bratton SC, Ceballos PL, Sheely-Moore AI, Meany-Walen K, Pronchenko Y, Jones LD |year=2013|title=Head start early mental health intervention: Effects of child-centered play therapy on disruptive behaviors|journal=International Journal of Play Therapy|volume=22|pages=28–42|doi=10.1037/a0030318}}</ref>\n\nPlay therapy involves a therapist observing a child as the child plays with toys and interacts with their surrounding environment. The therapist plays an observational, as well as an interactional role, in the intervention. This process allows for the child to enact their problems through play, and speak more comfortably with the therapist.<ref name=\"Phares_2014\" />{{rp|102–103}} Although somewhat controversial, due to data that suggests a lack of effectiveness in children older than 10 years old, play therapy has been shown to be a valuable treatment. This therapy is particularly useful for younger children under the age of 10, who are consciously aware of their environment. Play therapy is important, seeing as many therapeutic interventions that are effective for adults have shown to be less effective for children.<ref name=\"Lin_2015\">{{Cite journal| vauthors = Lin YW, Bratton SC |date=January 2015|title=A Meta-Analytic Review of Child-Centered Play Therapy Approaches |journal=Journal of Counseling & Development|language=en|volume=93|issue=1|pages=45–58|doi=10.1002/j.1556-6676.2015.00180.x}}</ref>\n\n===Family systems therapies===\n\n[[Family therapy|Family systems therapies]] are based on the belief that children's problems revolve around problems that occur within the family. Family systems therapy attempts to improve the relations between multiple people involved in specific families via therapeutic intervention. For the best effect, it is recommended that the entire family be included in the therapy. The treatments include family management skill development, and child–parent attachment development. These interventions help to improve family functioning.<ref name=\"Phares_2014\" />{{rp|102–103}}\n\n===Family management skill development (Family systems therapy)===\n\nFamily management skills can be taught by family therapists, and include methods such as improving supervision, disciplinary practices, and creating environments that allow for positive interactions between parents and children.<ref name=\"Phares_2014\" />{{rp|102–103}}\n\n=== Child–parent attachment development (Family systems therapy) ===\n\nChild–parent [[Attachment theory|attachment]] development involves altering or creating relationships between parents and children, in attempts to create secure bases for the child, and to facilitate trust, independence, and positive perceptions of family relationships. We see these situations a lot more than we think which makes some spectrums of abnormal psychology more normal, and more common.<ref name=\"Barbato_2020\">{{Cite journal| vauthors = Barbato A, D'Avanzo B, Vadilonga F, Cortinovis M, Lombardi S, Pili F, Rangone G, Visconti A | display-authors = 6 |date=November 2020|title=Systemic family therapy integrated with attachment interventions for adoptive families. Development of a treatment manual |journal=Journal of Family Therapy|language=en|volume=42|issue=4|pages=539–540|doi=10.1111/1467-6427.12278| s2cid = 198768158 |issn=0163-4445}}</ref> These goals are often achieved by creating understanding regarding behaviors, creating opportunities for attachment, and increasing the family's ability to think about their history and relationships.<ref name=\"Barbato_2020\" />\n\n"}, {"title": "Psychoanalysis (Freud)", "content": "[[Psychoanalytic theory]] is heavily based on the theory of the neurologist [[Sigmund Freud]]. These ideas often represented repressed emotions and memories from a patient's childhood within their unconscious. According to psychoanalytic theory, these repressions cause the disturbances that people experience in their daily lives, and by finding the source of these disturbances, one should be able to eliminate the disturbance itself. This is accomplished by a variety of methods, with some popular ones being [[Free association (psychology)|free association]], [[hypnosis]], and [[insight]]. The goal of these methods is to induce a [[catharsis]], or emotional release in the patient, which should indicate that the source of the problem has been tapped, and it can then be treated. Freud's [[Psychosexual development|psychosexual stages]] also played a key role in this form of therapy, as he would often believe that the problems the patient was experiencing were due to them becoming stuck, or \"[[Fixation (psychology)|fixated]]\", in a particular stage. Dreams also played a major role in this form of therapy, as Freud viewed dreams as a way to gain insight into the unconscious mind. Patients were often asked to keep dream journals to bring in for discussion during the next therapy session.  There are many potential problems associated with this style of therapy, including resistance to the repressed memory or feeling, and [[negative transference]] onto the therapist. Psychoanalysis was carried on by many after Freud, including his daughter [[Anna Freud]], and [[Jacques Lacan]]. Many others have also gone on to elaborate on Freud's original theory, and to add their own take on [[Defence mechanisms|defense mechanisms]] or [[Dream interpretation|dream analysis]].<ref>{{cite journal | vauthors = Kovacevic F |year= 2013|title=A Lacanian approach to dream interpretation |journal=[[Dreaming (journal)|Dreaming]] |volume=23  |issue=1 |pages=78–89 |doi=10.1037/a0032206}}</ref>  While psychoanalysis has fallen out of favor to more modern forms of therapy, it is still used by some clinical psychologists to varying degrees.<ref>{{cite journal | vauthors = Smit Y, Huibers MJ, Ioannidis JP, van Dyck R, van Tilburg W, Arntz A | title = The effectiveness of long-term psychoanalytic psychotherapy--a meta-analysis of randomized controlled trials | journal = Clinical Psychology Review | volume = 32 | issue = 2 | pages = 81–92 | date = March 2012 | pmid = 22227111 | doi = 10.1016/j.cpr.2011.11.003 }}</ref>\n\n"}, {"title": "Behavioral therapy (Wolpe)", "content": "[[Behaviour therapy|Behavior therapy]] relies on the principles of [[behaviorism]], such as involving [[classical conditioning|classical]] and [[operant conditioning]]. Behaviorism arose in the early 20th century, from the work of psychologists such as James Watson and [[B. F. Skinner]]. Behaviorism states that all behaviors humans do is because of a [[Stimulus (psychology)|stimulus]] and [[reinforcement]]. While this reinforcement is normally for good behavior, it can also occur for maladaptive behavior.  In this therapeutic view, the patients maladaptive behavior has been reinforced, which will cause the maladaptive behavior to be repeated. The goal of the therapy is to reinforce less maladaptive behaviors, so that with time, these adaptive behaviors will become the primary ones in the patient.<ref>{{Cite journal| vauthors = Edwards J |date=2016|title=Behaviorism and Control in the History of Economics and Psychology|url=https://read.dukeupress.edu/hope/article/48/suppl_1/170-197/28071|journal=History of Political Economy|language=en|volume=48|issue=suppl 1|pages=170–197|doi=10.1215/00182702-3619262|issn=0018-2702}}</ref>\n\n"}, {"title": "Humanistic therapy (Rogers)", "content": "\n[[Humanistic psychology|Humanistic therapy]] aims to achieve [[self-actualization]] ([[Carl Rogers]], 1961). In this style of therapy, the therapist will focus on the patient themselves, as opposed to the patient's problem. The goal of this therapy is, by treating the patient as \"human\", rather than \"client\", to get to the source of the problem, and to resolve the problem in an effective manner. Humanistic therapy has been on the rise in recent years, and has been associated with numerous positive benefits. It is considered to be one of the core elements needed for therapeutic effectiveness, and a significant contributor to not only the well-being of the patient, but society as a whole. Some say that all of the therapeutic approaches today draw from the humanistic approach in some regard, and that humanistic therapy is the best way for treat a patient.<ref>{{cite journal | vauthors = Schneider KJ, Längle A | title = The renewal of humanism in psychotherapy: summary and conclusion | journal = Psychotherapy | volume = 49 | issue = 4 | pages = 480–1 | date = December 2012 | pmid = 23205836 | doi = 10.1037/a0028026 }}</ref> Humanistic therapy can be used on people of all ages; it is very popular among children in its variant known as \"[[play therapy]]\".<ref name=\"Lin_2015\" />\n\n"}, {"title": "Cognitive behavioural therapy (Ellis and Beck)", "content": "\n[[Cognitive behavioral therapy|Cognitive behavioural therapy]] (CBT) aims to influence thought and cognition (Beck, 1977). This form of therapy relies on not only the components of behavioral therapy as mentioned before, but also the elements of [[cognitive psychology]].<ref name=\"Phares_2014\" />{{rp|101–102}} This relies on not only the clients behavioral problems that could have arisen from conditioning, but also their [[Schema (psychology)|negative schemas]] and [[Beck's cognitive triad|distorted perceptions]] of the world around them.  These negative schemas may cause distress in the life of the patient; for example, the schemas may give them unrealistic expectations for how well they should perform at their job, or how they should look physically. When these expectations are not met, it will often result in maladaptive behaviors, such as [[Depression (mood)|depression]], [[Obsessive–compulsive disorder|obsessive compulsions]], and [[anxiety]]. With CBT, the goal is to change the schemas that are causing the stress in the patients life, and replace them with more realistic ones. Once the negative schemas have been replaced, it will hopefully cause a remission of the patients symptoms. CBT is considered particularly effective in the treatment of depression, and has even been used in recent years in group settings. It is felt that using CBT in a group setting aids in giving its members a sense of support, and decreasing the likelihood of them dropping out of therapy before the treatment has had time to work properly.<ref>{{cite journal | vauthors = Hans E, Hiller W | title = Effectiveness of and dropout from outpatient cognitive behavioral therapy for adult unipolar depression: a meta-analysis of nonrandomized effectiveness studies | journal = Journal of Consulting and Clinical Psychology | volume = 81 | issue = 1 | pages = 75–88 | date = February 2013 | pmid = 23379264 | doi = 10.1037/a0031080 }}</ref> CBT has been found to be an effective treatment for many patients, even those who do not have diseases and disorders typically thought of as psychiatric ones. For example, patients with the disease [[multiple sclerosis]] have found a lot of help using CBT. The treatment often helps the patients cope with the disorder they have, and how they can adapt to their new lives without developing new problems, such as depression, or negative schemas about themselves.<ref>{{cite journal | vauthors = Moss-Morris R, Dennison L, Landau S, Yardley L, Silber E, Chalder T | title = A randomized controlled trial of cognitive behavioral therapy (CBT) for adjusting to multiple sclerosis (the saMS trial): does CBT work and for whom does it work? | journal = Journal of Consulting and Clinical Psychology | volume = 81 | issue = 2 | pages = 251–62 | date = April 2013 | pmid = 22730954 | doi = 10.1037/a0029132 | author-link1 = Rona Moss-Morris }}</ref>\n\nAccording to RAND, therapies are difficult to provide to all patients in need. A lack of funding and understanding of symptoms provides a major roadblock that is not easily avoided. Individual symptoms and responses to treatments vary, which creates a disconnect between patient, society, and care givers/professionals.<ref>{{cite journal | vauthors = Gresenz CR, Stockdale SE, Wells KB |url= https://www.rand.org/pubs/research_briefs/RB4533/index1.html|title= Are People With Mental Illness Getting the Help They Need? | journal =  Health Services Research |date= January 2000| volume = 35 | issue = 1 | pages = 295–306 }}</ref>\n\n"}, {"title": "Play therapy (Humanistic)", "content": "\nChildren are often sent to therapy due to outbursts that they have in a school or home setting; the theory is that by treating the child in a setting that is similar to the area that they are having their disruptive behavior, the child will be more likely to learn from the therapy, and have an effective outcome. In [[play therapy]], the clinicians will \"play\" with their client, usually with toys, or a tea party. Playing is the typical behavior of a child, and therefore, playing with the therapist will come as a natural response to the child. In playing together, the clinician will ask the patient questions, and due to the setting, the questions seem less intrusive, more therapeutic, and more like a normal conversation. This should help the patient realize issues they have, and confess them to the therapist with less difficulty than they may experience in a traditional counselling setting.<ref>{{cite journal| vauthors = Bratton SC, Ceballos PL, Sheely-Moore AI, Meany-Walen K, Pronchenko Y, Jones LD |year=2013|title=Head start early mental health intervention: Effects of child-centered play therapy on disruptive behaviors|journal=International Journal of Play Therapy|volume=22|pages=28–42|doi=10.1037/a0030318}}</ref>\n\nPlay therapy involves a therapist observing a child as the child plays with toys and interacts with their surrounding environment. The therapist plays an observational, as well as an interactional role, in the intervention. This process allows for the child to enact their problems through play, and speak more comfortably with the therapist.<ref name=\"Phares_2014\" />{{rp|102–103}} Although somewhat controversial, due to data that suggests a lack of effectiveness in children older than 10 years old, play therapy has been shown to be a valuable treatment. This therapy is particularly useful for younger children under the age of 10, who are consciously aware of their environment. Play therapy is important, seeing as many therapeutic interventions that are effective for adults have shown to be less effective for children.<ref name=\"Lin_2015\">{{Cite journal| vauthors = Lin YW, Bratton SC |date=January 2015|title=A Meta-Analytic Review of Child-Centered Play Therapy Approaches |journal=Journal of Counseling & Development|language=en|volume=93|issue=1|pages=45–58|doi=10.1002/j.1556-6676.2015.00180.x}}</ref>\n\n"}, {"title": "Family systems therapies", "content": "\n[[Family therapy|Family systems therapies]] are based on the belief that children's problems revolve around problems that occur within the family. Family systems therapy attempts to improve the relations between multiple people involved in specific families via therapeutic intervention. For the best effect, it is recommended that the entire family be included in the therapy. The treatments include family management skill development, and child–parent attachment development. These interventions help to improve family functioning.<ref name=\"Phares_2014\" />{{rp|102–103}}\n\n"}, {"title": "Family management skill development (Family systems therapy)", "content": "\nFamily management skills can be taught by family therapists, and include methods such as improving supervision, disciplinary practices, and creating environments that allow for positive interactions between parents and children.<ref name=\"Phares_2014\" />{{rp|102–103}}\n\n"}, {"title": " Child–parent attachment development (Family systems therapy) ", "content": "\nChild–parent [[Attachment theory|attachment]] development involves altering or creating relationships between parents and children, in attempts to create secure bases for the child, and to facilitate trust, independence, and positive perceptions of family relationships. We see these situations a lot more than we think which makes some spectrums of abnormal psychology more normal, and more common.<ref name=\"Barbato_2020\">{{Cite journal| vauthors = Barbato A, D'Avanzo B, Vadilonga F, Cortinovis M, Lombardi S, Pili F, Rangone G, Visconti A | display-authors = 6 |date=November 2020|title=Systemic family therapy integrated with attachment interventions for adoptive families. Development of a treatment manual |journal=Journal of Family Therapy|language=en|volume=42|issue=4|pages=539–540|doi=10.1111/1467-6427.12278| s2cid = 198768158 |issn=0163-4445}}</ref> These goals are often achieved by creating understanding regarding behaviors, creating opportunities for attachment, and increasing the family's ability to think about their history and relationships.<ref name=\"Barbato_2020\" />\n\n"}, {"title": " See also ", "content": "{{Main|Outline of abnormal psychology}}\n{{Columns-list|colwidth=22em|\n* [[Abuse]]\n* [[Cognitive behavioral therapy]]\n* [[International Classification of Diseases]]\n* [[Insanity defense]]\n* [[Mental Health Act 1983]]\n* [[Mental Health Act 2007]]\n* [[M'Naghten Rules]]\n* [[Models of abnormality]]\n* [[Outline of psychology]]\n* [[Parapsychology]]\n* [[Seasonal affective disorder]]\n* [[Zero stroke]]\n* [[Society of Clinical Child & Adolescent Psychology]]\n* [[List of psychology organizations|List of organizations in psychology]]\n}}\n\n"}, {"title": "Notes", "content": "{{Reflist}}\n\n"}, {"title": " References ", "content": "{{refbegin}}\n* {{cite book | vauthors = Barlow DH, Durand VM |year=2004 |title=Abnormal Psychology: An Integrative Approach |publisher=Thomson Wadsworth |isbn=978-0-534-63362-2}}\n* {{Cite book | vauthors = Bennett P |year=2003 |title=Abnormal and Clinical Psychology |publisher=Open University Press |isbn=978-0-335-21236-1 }}\n* {{cite news | vauthors = Cherry K |date=May 9, 2016 |url=https://www.verywell.com/what-is-abnormal-psychology-2794775|title=What Is Abnormal Psychology?|work=Verywell|access-date=2017-03-10}}\n* {{cite book | vauthors = Hansell J, Damour L |year=2005 |title=Abnormal Psychology |publisher=Von Hoffman Press |isbn=978-0-471-38982-8 |url-access=registration |url=https://archive.org/details/abnormalpsycholo0000hans }}\n* {{cite journal | vauthors = Ormel J, Jeronimus BF, Kotov R, Riese H, Bos EH, Hankin B, Rosmalen JG, Oldehinkel AJ | display-authors = 6 | title = Neuroticism and common mental disorders: meaning and utility of a complex relationship | journal = Clinical Psychology Review | volume = 33 | issue = 5 | pages = 686–697 | date = July 2013 | pmid = 23702592 | pmc = 4382368 | doi = 10.1016/j.cpr.2013.04.003 }}\n{{refend}}\n\n"}, {"title": " Further reading ", "content": "{{refbegin}}\n* {{cite journal | vauthors = Ahn WK, Novick LR, Kim NS | title = Understanding behavior makes it more normal | journal = Psychonomic Bulletin & Review | volume = 10 | issue = 3 | pages = 746–52 | date = September 2003 | pmid = 14620373 | pmc = 2654343 | doi = 10.3758/bf03196541 | url = https://ahnthinkinglab.yale.edu/sites/default/files/files/Papers/ahnnovickkim2003-1.pdf }}\n* {{cite journal | vauthors = Zvolensky MJ, Kotov R, Antipova AV, Schmidt NB | title = Diathesis stress model for panic-related distress: a test in a Russian epidemiological sample | journal = Behaviour Research and Therapy | volume = 43 | issue = 4 | pages = 521–32 | date = April 2005 | pmid = 15701361 | doi = 10.1016/j.brat.2004.09.001 | s2cid = 2979875 }}\n{{refend}}\n\n"}, {"title": " External links ", "content": "{{Library resources box|by=no|onlinebooks=no|about=yes|wikititle=abnormal psychology}}\n* [https://web.archive.org/web/20080108152418/http://minnay.com/products/ Abnormal Psychology Students Practice Resources]\n* [https://web.archive.org/web/20170712233214/http://english4success.ru/Upload/books/1278.pdf Psychology Terms – a 600-page dictionary pdf]\n* [https://web.archive.org/web/20091202022810/http://ccvillage.buffalo.edu/Abpsy/ A Course in Abnormal Psychology]\n\n{{Psychology}}\n{{Social sciences}}\n\n{{Authority control}}\n\n{{DEFAULTSORT:Abnormal Psychology}}\n[[Category:Abnormal psychology| ]]\n[[Category:Clinical psychology]]\n[[Category:Behavioural sciences]]"}]}